[{"uri": "7041424825", "lang": "eng", "isDuplicate": false, "date": "2022-05-15", "time": "08:26:00", "dateTime": "2022-05-15T08:26:00Z", "dateTimePub": "2022-05-15T07:43:00Z", "dataType": "news", "sim": 0.8235294222831726, "url": "https://censor.net/en/news/3341443/yesterday_occupiers_used_incendiary_or_phosphorus_bombs_against_defenders_of_mariupol_on_azovstal_andriushchenko", "title": "Yesterday occupiers used incendiary or phosphorus bombs against defenders of Mariupol on \"Azovstal\", - Andriushchenko. VIDEO", "body": "The Russian occupiers used incendiary or phosphorus bombs against the defenders of Mariupol at Azovstal.\n\nThe adviser to the mayor Petro Andriushchenko reported about it on Telegram, informs Censor.NET.\n\n\"The occupiers themselves claim that 9M22C incendiary shells with thermite layers were used. The combustion temperature is about 2-2.5 thousand degrees Celsius. It is almost impossible to stop the combustion,\" Andriushchenko said.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1.censor.net/images/0/3/0/f/030f851a5b0b482aa845b32501b542fc/censor_social.jpg", "eventUri": "eng-7715582", "sentiment": -0.03529411764705881, "wgt": 210, "relevance": 1, "stanza_neg": 3, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7042596914", "lang": "eng", "isDuplicate": false, "date": "2022-05-16", "time": "10:12:00", "dateTime": "2022-05-16T10:12:00Z", "dateTimePub": "2022-05-16T09:35:00Z", "dataType": "news", "sim": 0.7960784435272217, "url": "https://en.interfax.com.ua/news/general/832526.html", "title": "Russian occupiers probably use phosphorous or incendiary bombs against defenders of Mariupol - Advisor to mayor Andriuschenko", "body": "The Russian occupiers on Saturday, firing at the Ukrainian military located on the territory of the Azovstal metallurgical plant in besieged Mariupol, probably used phosphorous or incendiary bombs, said adviser to the mayor of Mariupol Petro Andriuschenko.\n\n\"Mariupol. Azovstal. Again - from the sky, the sea, the earth. Yesterday, the occupiers used incendiary or phosphorus bombs against the Defenders of Mariupol for the first time (we will leave the conclusion to specialists). The occupiers themselves claim that 9M22C incendiary shells with thermite layers were used,\" Andriuschenko wrote on Telegram on Sunday.\n\nHe specified that the peak firing temperature of the specified ammunition is about 2,000-2,500 degrees Celsius, while it is almost impossible to stop the burning.\n\n\"Hell has descended to earth. To Azovstal. It's incredible how our Defenders are holding out. We are all deeply indebted to them,\" summed up the adviser to the mayor of Mariupol.", "source": {"uri": "en.interfax.com.ua", "dataType": "news", "title": "Interfax-Ukraine"}, "authors": [], "image": "https://interfax.com.ua/media/thumbs/images/2022/04/I_u1j3EsE6sC.jpg", "eventUri": "eng-7715582", "sentiment": -0.1450980392156863, "wgt": 203, "relevance": 1, "stanza_neg": 3, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7041537849", "lang": "eng", "isDuplicate": false, "date": "2022-05-15", "time": "10:47:00", "dateTime": "2022-05-15T10:47:00Z", "dateTimePub": "2022-05-15T10:46:00Z", "dataType": "news", "sim": 0.7882353067398071, "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/russia-ukraine-war-kyiv-claims-moscow-using-phosphorus-bombs-in-mariupol-articleshow.html", "title": "Russia-Ukraine war: Kyiv claims Moscow using phosphorus bombs in Mariupol", "body": "Use of phosphorous bombs, also known as \"Willie Pete\", is not prohibited by the Chemical Weapons Convention but is subject to strict international regulations.\n\nThe Russian Federation has continued its onslaught in the besieged port city of Mariupol, putting the lives of people who are stranded in the city in jeopardy. In the latest update, Ukraine has claimed that the occupiers deployed incendiary or phosphorous bombs against the Mariupol Defenders on May 14, claiming that they will leave the conclusion on this situation to the specialists. It was stated that the Russian forces have used 9M22C incendiary shells with thermite layers. The temperature of combustion for such bombs is around 2-2.5 thousand degrees Celsius.\n\nPetro Andriushchenko, who is the adviser to the mayor of Mariupol, Vadym Boychenko, stated that Russian forces fired incendiary shells but the specialists will make the conclusion. Andriushchenko further stated that the temperature of the fire caused by the attack was between 2,000 and 2,500 degrees Celsius, and the fire is almost impossible to put out. On Telegram, Andriushchenko shared a video of the bombing of Mariupol's Azovstal steel plant.\n\nAround 1,000 soldiers are still stranded at Azovstal, which is Ukraine's last position in Russia-controlled Mariupol. He further stated that hundreds of soldiers in Azovstal are wounded, according to media reports. Earlier this week Andriushchenko stated that Russian forces have barred all evacuation routes out of Mariupol. He went on to say that there is a scarcity of food and water in the city and those who have remained in the city are cooperating with Russian soldiers for food.\n\nPhosphorous bombs are chemical weapons made out of phosphates that can ignite when exposed to air and burn at temperatures as high as 2,760 degrees. The use of white phosphorous, sometimes known as \"Willie Pete\" after its initials, is not prohibited by the Chemical Weapons Convention but is subject to strict international regulations.\n\nPhosphorus bombs are incendiary weapons. That implies they can spread flames in addition to their catastrophic explosive power.\n\nNotably, this is not the first time Russia has been blamed for using phosphorus bombs in Mariupol. Late last month, Captain Sviatoslav Palamar of the Azov regiment claimed that the Russian armed forces also unleashed a huge quantity of phosphorus bombs on Mariupol and carried out 50 airstrikes throughout the night on April 27.", "source": {"uri": "republicworld.com", "dataType": "news", "title": "Republic World"}, "authors": [], "image": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/kvfkj25hr5pg2neh_1652606994.jpeg", "eventUri": "eng-7715582", "sentiment": -0.1450980392156863, "wgt": 201, "relevance": 1, "stanza_neg": 7, "stanza_neu": 10, "stanza_pos": 1, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7042081181", "lang": "eng", "isDuplicate": false, "date": "2022-05-15", "time": "23:30:00", "dateTime": "2022-05-15T23:30:00Z", "dateTimePub": "2022-05-15T23:29:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://www.thetimes.co.uk/article/azovstal-steel-plant-defenders-hit-with-phosphorus-bombs-pwlxl0t0k", "title": "Azovstal steel plant defenders 'hit with phosphorus bombs'", "body": "Russian forces were accused yesterday of striking the steelworks in besieged Mariupol with white phosphorus bombs.\n\nThe sprawling Azovstal plant has been the last holdout of Ukrainian resistance in the occupied port city for over two months. Ukrainian officials and humanitarian organisations have sounded the alarm for the fate of about 1,000 soldiers in the plant -- hundreds of whom are injured -- as they face increasingly dire conditions and relentless Russian bombings.\n\nPetro Andryushchenko, an adviser to the mayor of Mariupol, said Russian forces had been targeting Azovstal with incendiary or phosphorus bombs over the weekend. \"The occupiers themselves claim that they used 9M22C incendiary rockets with thermite layers. The temperature of the flames is about 2,000 to 2,500 degrees Celsius. It", "source": {"uri": "thetimes.co.uk", "dataType": "news", "title": "The Sunday Times"}, "authors": [{"uri": "samantha_berkhead@thetimes.co.uk", "name": "Samantha Berkhead", "type": "author", "isAgency": false}], "image": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F68babc1e-d494-11ec-bb99-1bcd45646516.jpg?crop=1600%2C900%2C0%2C0&resize=1200", "eventUri": "eng-7715582", "sentiment": -0.1529411764705882, "wgt": 192, "relevance": 1, "stanza_neg": 1, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7045691223", "lang": "eng", "isDuplicate": false, "date": "2022-05-18", "time": "13:59:00", "dateTime": "2022-05-18T13:59:00Z", "dateTimePub": "2022-05-18T13:59:00Z", "dataType": "news", "sim": 0.6196078658103943, "url": "https://www.lemonde.fr/en/international/article/2022/05/18/a-rain-of-forbidden-firebombs-on-the-azovstal-factory_5983906_4.html", "title": "Ukraine: A rain of forbidden firebombs falls on the Azovstal factory", "body": "A rain of fire fell on Saturday morning, May 14, on the Azovstal factory, the day before the surrender of the Ukrainian military besieged in the last corner of Mariupol resistance. In a video of the scene, filmed from a drone, probably Russian, we see about 20 rockets explode successively, each releasing an orange spray. Like fireworks in the morning light, the sprays densely cover a square of 500 meters on each side, made up of concrete, asphalt and the roofs of the buildings at the heart of the famous steel plant. When they touch the ground, the pellets produce a brief flash and then remain incandescent, producing white smoke and sometimes a burst of flame.\n\nOn Sunday, the dramatic video circulated on Russian and Ukrainian social media, especially after the adviser of the mayor of Mariupol, Piotr Andriushchenko, added his commentary. He believes that it is \"incendiary ammunition... perhaps white phosphorus (we will leave the conclusion to specialists). The occupants themselves state that they are 9M22C incendiary shells with thermite cartridges. The combustion temperature is about 2,500 degrees. It is virtually impossible to stop combustion. Hell has descended on Earth.\" In the aftermath, the Prosecutor General's Office of Ukraine opened an investigation, arguing that \"thermite incendiary projectiles are prohibited by the norms of international law.\"\n\nThe use of incendiary munitions is regulated by Protocol III of the Convention on Certain Conventional Weapons, which took effect in December 1983. According to the protocol, this type of weapon \"is prohibited in all circumstances\" against civilian populations and also against military targets when they are close to civilian populations. \"We must not delude ourselves: The laws of war are over. The Russians have been sitting on them for a long time,\" said Léo Péria-Peigné, an arms researcher at the Center for Security Studies at the Institut français des relations internationales (French Institute for International Relations). \"We are witnessing an old-fashioned war here. The Russians have already used firebombs in Kharkiv, Chernihiv and Kyiv.\"\n\n\"The use of incendiary weapons in urban areas is clearly a war crime.\" Joseph Henrotin, political scientist\n\nFor the researcher, the bombing of Azovstal \"may have been intended to asphyxiate the people who took refuge underground. The flaming pellets generate toxic vapors that spread through the ventilation system in the tunnels. Moreover, the heat released by the pellets is such that it penetrates the ground, passes through the metal and burns everything within a radius of 15 meters. This is a classic Russian tactic to create a no-go zone.\" The incendiary bombing would have finalized an effort to demoralize the Ukrainian fighters, many of whom were already wounded.", "source": {"uri": "lemonde.fr", "dataType": "news", "title": "Le Monde.fr"}, "authors": [], "image": "https://img.lemde.fr/2022/05/18/402/0/4821/2410/1440/720/60/0/fcd466b_1652862090839-315419.jpg", "eventUri": "eng-7715582", "sentiment": -0.07450980392156858, "wgt": 158, "relevance": 1, "stanza_neg": 9, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7041433878", "lang": "eng", "isDuplicate": false, "date": "2022-05-15", "time": "08:38:00", "dateTime": "2022-05-15T08:38:00Z", "dateTimePub": "2022-05-15T08:38:00Z", "dataType": "news", "sim": 0.5607843399047852, "url": "https://www.express.co.uk/news/world/1610539/Russia-Chemical-weapon-fears-Ukraine-Mariupol-phosphorus-bomb-investigation-latest", "title": "Chemical weapon fears as Putin may have dropped 'unstoppable' 2,500C 'phosphorus bombs'", "body": "We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. More info\n\nPetro Andriushchenko, an advisor to the mayor of the city, reportedly told of fires burning as hot as 2,500 degrees Celcius. He added that the \"fire is almost impossible to stop\".\n\nMr Andriushchenko is said to have posted a video of the bombing of Mariupol's Azovstal steel plant on Telegram.\n\nHe said that experts would have to investigate the cause of the searing inferno, but that the Russians themselves claim they used incendiary shells.", "source": {"uri": "express.co.uk", "dataType": "news", "title": "EXPRESS"}, "authors": [{"uri": "aleks_phillips@express.co.uk", "name": "Aleks Phillips", "type": "author", "isAgency": false}], "image": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1610539.jpg", "eventUri": "eng-7715582", "sentiment": 0.07450980392156858, "wgt": 143, "relevance": 1, "stanza_neg": 2, "stanza_neu": 5, "stanza_pos": 1, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}]