[{"uri": "7115599629", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "09:55:00", "dateTime": "2022-07-15T09:55:00Z", "dateTimePub": "2022-07-15T09:27:00Z", "dataType": "news", "sim": 0.8627451062202454, "url": "https://www.ukrinform.net/rubric-ato/3529589-russia-will-be-held-accountable-for-crimes-in-vinnytsia-and-other-cities-of-ukraine-eu.html", "title": "Russia will be held accountable for crimes in Vinnytsia and other cities of Ukraine - EU", "body": "European Union High Representative for Foreign Affairs and Security Policy Josep Borrell and European Commissioner for Crisis Management Janez Lenarčič said this in a statement published on the website of the Diplomatic Service of the European Union, Ukrinform reports.\n\n\"The Russian invading forces in Ukraine attacked a civilian building and a cultural centre in the city of Vinnytsia, killing more than 20 people and injuring scores of others, many of them critically. The European Union condemns in the strongest possible terms these continued indiscriminate targeting of civilian objects including hospitals, medical facilities, schools and shelters. This atrocity in Vinnytsia is the latest in a long series of brutal attacks targeting civilians and civilian infrastructure,\" the document reads.\n\nThe EU officials reminded that Russia's war of aggression against Ukraine has been ravaging the country for more than four and half months.\n\n\"Bucha, Mariupol, Kramatorsk, Kremenchuk, Sloviansk, Chasiv Yar, Kharkiv, Odesa, and now Vinnytsia - Russia's Armed Forces and their proxies are leaving a trail of blood across Ukraine. Thousands of civilians have been already murdered,\" the EU officials said.\n\nThey stressed that this barbaric Russian behaviour, in total disregard of International Humanitarian Law, must stop immediately.\n\n\"We have both witnessed the horrific destruction Russia brought on Ukraine and its people with our own eyes. The civilian population continues to pay a high toll in this war, due to Russia's fundamental disregard of international humanitarian law, facing death, violence, including sexual violence, forced deportations and destruction. There can be no impunity for violations and crimes committed by the Russian forces and their political superiors,\" they said.\n\nThe EU officials emphasized that all those responsible for these atrocities will be held to account for their actions, in accordance with international law. The EU supports every effort to ensure accountability for human rights violations and violations of international humanitarian law.\n\nAs Ukrinform reported, on July 14, Russia struck Vinnytsia with Kalibr missiles, launched from a submarine deployed in the Black Sea. According to latest reports, the strike killed 23 people, including three children. Currently, 73 injured persons stay in hospitals. As many as 18 people are considered missing.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1657817730-624.jpg", "eventUri": "eng-7865602", "sentiment": -0.4509803921568627, "wgt": 220, "relevance": 1, "stanza_neg": 4, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7114956445", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "20:12:00", "dateTime": "2022-07-14T20:12:00Z", "dateTimePub": "2022-07-14T20:12:00Z", "dataType": "news", "sim": 0.7764706015586853, "url": "https://censor.net/en/news/3354207/perpetrators_will_be_punished_for_these_atrocities_eu_on_shelling_of_vinnytsia", "title": "Perpetrators will be punished for these atrocities - EU on shelling of Vinnytsia", "body": "The European Union High Representative Josep Borrell and European Commissioner for Crisis Management Janez Lenarčič issued a statement in connection with the missile attack on Vinnitsa, which caused significant loss of life: the perpetrators will be held accountable for these atrocities.\n\nThe text of the statement was distributed on Thursday in Brussels by the External Diplomatic Service of the EU, reports Censor.NЕТ, with reference to Іnterfax-Ukraine.\n\n\"Today, Russian invasion forces in Ukraine attacked a civilian building and cultural center in the city of Vinnytsia, killing more than 20 people and wounding dozens more, many of them in critical condition. The European Union condemns in the strongest terms these indiscriminate shelling of ongoing civilian targets, including hospitals, medical facilities, schools and shelters. This atrocity in Vinnytsia is the latest in a long series of brutal attacks targeting civilians and civilian infrastructure,\" the statement said.\n\nBorrell and Lenarčič recalled that Russia's war of aggression against Ukraine \"has been raging in the country for more than four and a half months. \"Bucha, Mariupol, Kramatorsk, Kremenchug, Slavyansk, Chasiv Yar, Kharkiv, Odessa, and now Vinnitsa - the Russian Armed Forces and their murtaddies are leaving a bloody trail in Ukraine. Thousands of civilians have already been killed. This barbaric behavior of Russia in complete disregard of international humanitarian law must be stopped immediately,\" they are convinced.\n\nHigh-ranking Europeans stated that both have seen with their own eyes the terrible destruction that Russia has inflicted on Ukraine and its people. \"Civilians continue to suffer great losses in this war because of Russia's principled disregard for international humanitarian law, facing death, violence, in particular sexual violence, forced deportation and annihilation. There can be no impunity for the violations and crimes committed by Russian forces\" and their political superiors.\n\nAll those responsible for these atrocities will be held accountable for their actions under International Law. The EU supports all efforts to ensure accountability for violations of Human Rights and International Humanitarian Law,\" the statement said.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/9/5/4/9/95492d50d7e56da2b7da0a3066a3bdfa/censor_social.jpg", "eventUri": "eng-7865602", "sentiment": -0.5607843137254902, "wgt": 198, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7114816124", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "17:38:00", "dateTime": "2022-07-14T17:38:00Z", "dateTimePub": "2022-07-14T17:38:00Z", "dataType": "news", "sim": 0.772549033164978, "url": "https://www.eeas.europa.eu/eeas/ukraine-statement-high-representative-josep-borrell-and-commissioner-crisis-management-janez_en", "title": "\nUkraine: Statement by High Representative Josep Borrell and Commissioner for Crisis Management Janez Lenarčič on Russian attacks against civilian targets", "body": "Today, the Russian invading forces in Ukraine attacked a civilian building and a cultural centre in the city of Vinnytsia, killing more than 20 people and injuring scores of others, many of them critically.\n\nThe European Union condemns in the strongest possible terms these continued indiscriminate targeting of civilian objects including hospitals, medical facilities, schools and shelters.\n\nThis atrocity in Vinnitsya is the latest in a long series of brutal attacks targeting civilians and civilian infrastructure.\n\nRussia's war of aggression against Ukraine has been ravaging the country for more than four and half months. Bucha, Mariupol, Kramatorsk, Kremenchuk, Sloviansk, Chasiv Yar, Kharkiv, Odesa, and now Vinnytsia - Russia's Armed Forces and their proxies are leaving a trail of blood across Ukraine. Thousands of civilians have been already murdered. This barbaric Russian behaviour, in total disregard of International Humanitarian Law, must stop immediately.\n\nWe have both witnessed the horrific destruction Russia brought on Ukraine and its people with our own eyes. The civilian population continues to pay a high toll in this war, due to Russia's fundamental disregard of international humanitarian law, facing death, violence, including sexual violence, forced deportations and destruction.\n\nThere can be no impunity for violations and crimes committed by the Russian forces and their political superiors. All those responsible for these atrocities will be held to account for their actions, in accordance with international law. The EU supports every effort to ensure accountability for human rights violations and violations of international humanitarian law.", "source": {"uri": "eeas.europa.eu", "dataType": "news", "title": "Europa"}, "authors": [], "image": null, "eventUri": "eng-7865602", "sentiment": -0.5764705882352941, "wgt": 197, "relevance": 1, "stanza_neg": 5, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115599627", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "09:55:00", "dateTime": "2022-07-15T09:55:00Z", "dateTimePub": "2022-07-15T09:50:00Z", "dataType": "news", "sim": 0.6980392336845398, "url": "https://www.ukrinform.net/rubric-ato/3529613-brink-compares-russian-airstrikes-on-ukraine-with-nazi-atrocities-in-babyn-yar.html", "title": "Brink compares Russian airstrikes on Ukraine with Nazi atrocities in Babyn Yar", "body": "U.S. Ambassador to Ukraine Bridget Brink calls for helping Ukraine to defend against the atrocities of Russians.\n\n\"My walk through Babyn Yar was a sobering reminder of the Nazi horrors committed against Jews and others, which Russian missiles made all too real again striking nearby and killing innocents,\" she wrote on Twitter, Ukrinform reports.\n\n\"We must never forget and we must help Ukraine defend against these latest atrocities,\" Brink stressed.\n\nAs Ukrinform reported, on July 14, Russia struck Vinnytsia with Kalibr missiles, launched from a submarine deployed in the Black Sea. According to latest reports, the strike killed 23 people, including three children. Currently, 73 injured persons stay in hospitals. As many as 18 people are considered missing.\n\nEuropean Union High Representative for Foreign Affairs and Security Policy Josep Borrell and European Commissioner for Crisis Management Janez Lenarčič said in a statement that there can be no impunity for war crimes committed by Russian military in Ukraine and those responsible for the barbaric shelling of Vinnytsia and the killing of civilians in other cities of Ukraine will be held accountable.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1657877466-712.jpg", "eventUri": "eng-7865602", "sentiment": -0.3019607843137255, "wgt": 178, "relevance": 1, "stanza_neg": 3, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7116111663", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "17:19:00", "dateTime": "2022-07-15T17:19:00Z", "dateTimePub": "2022-07-15T15:57:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.eurointegration.com.ua/eng/news/2022/07/15/7143258/", "title": "US Ambassador Compared Russian Attacks on Ukraine with Nazis' Atrocities in Babyn Yar", "body": "US Ambassador Bridget Brink called on the world to help Ukraine protect itself from Russia.\n\n\"My walk through Babyn Yar was a sobering reminder of the Nazi horrors committed against Jews and others, which Russian missiles made all too real again striking nearby and killing innocents. We must never forget and we must help Ukraine defend against these latest atrocities,\" Bridget Brink tweeted.\n\nOn Thursday, around 11:00, Russian missiles struck a business complex in the central Ukrainian city of Vinnytsia. As a result of the missile іекшлу, more than 20 people were killed, and dozens were injured.\n\nEU High Representative of the European Union for Foreign Affairs and Security Policy, Josep Borrell, and European Commissioner for Humanitarian Aid and Crisis Management, Janez Lenarčič, strongly condemned the attack and stated that the violations and crimes committed by the Russian army and its political leadership would not stay unpunished.", "source": {"uri": "eurointegration.com.ua", "dataType": "news", "title": "Європейська правда"}, "authors": [], "image": "https://img.eurointegration.com.ua/images/doc/7/a/7ac5b00-630-360-1657877466-712.jpg", "eventUri": "eng-7865602", "sentiment": -0.2470588235294118, "wgt": 163, "relevance": 1, "stanza_neg": 2, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7111941915", "lang": "eng", "isDuplicate": false, "date": "2022-07-12", "time": "14:59:00", "dateTime": "2022-07-12T14:59:00Z", "dateTimePub": "2022-07-12T14:59:00Z", "dataType": "news", "sim": 0.5568627715110779, "url": "https://www.jurist.org/commentary/2022/07/milena-sterio-russia-war-crimes-ukraine/", "title": "The Russian Invasion of Ukraine: Violations of International Law", "body": "Milena Sterio, Charles R. Emrick Jr.-Calfee Halter & Griswold Professor of Law at Cleveland State University in Cleveland, Ohio discusses alleged war crimes by Russia in Ukraine...\n\nOn February 24, 2022, Russia initiated a full-scale invasion of Ukraine. Since then, Russian forces have attacked different parts of Ukraine using both ground troops as well as air strikes. So far, tens of thousands of Ukrainians have died as a result of Russian attacks. By so blatantly attacking Ukraine, another sovereign country, Russia has violated international law's basic prohibition on the use of force, which has been the underlying tenet of the post-World War II international legal order. Moreover, the Russian invasion of Ukraine has been characterized by various international humanitarian law violations, such as the intentional targeting of civilian objectives, torture, rape and sexual violence. Russian actions may have given rise to several atrocity crimes, such as war crimes, crimes against humanity, genocide, and aggression. Russian leaders and soldiers, responsible for the commission of such crimes, should be held accountable and be prosecuted before a domestic, hybrid, or international tribunal.\n\nIllegal Use of Force\n\nArticle 2(4) of the United Nations Charter prohibits states from using force against the territorial integrity or political independence of other states. The United Nations Charter was negotiated after World War II, with the goal of adopting international laws which would prevent another global war by limiting states' ability to use force against each other. Although wars have been fought and states have used force in violation of Article 2(4) several times since then, instances where states have blatantly invaded other states have remained rare. Russia's use of force against Ukraine, committed with the end goal of invading and annexing Ukraine and \"Russifying\" Ukrainians, represents a rare instance of a blatant violation of the Charter's fundamental rules. To the extent that the Charter reflects our legal understanding of the post-World War II world order, Russian actions can be understood as a direct threat to the entire community of states.\n\nViolations of International Humanitarian Law\n\nOver the past three months, Russian forces have carried out multiple ground and aerial attacks. Several attacks have been launched against civilian objectives, such as the March 9 assault on a Mariupol maternity hospital, numerous other attacks on medical facilities, and most recently the Amstor shopping Center on June 27 in Kremenchuk. International humanitarian law, through both treaties as well as customary law, prohibits states from internationally targeting civilian objectives.\n\nThe so-called \"principle of distinction,\" a tenet of international humanitarian law, was first set forth in the St. Petersburg Declaration, indirectly reaffirmed in the Hague Regulations, and clearly codified in Articles 48, 51(2) and 52(2) of Additional Protocol I to the Geneva Conventions, which provide that Parties to an armed conflict must \"at all times distinguish between the civilian population and combatants and between civilian objects and military objectives and accordingly shall direct their operations only against military objectives.\" It is abundantly clear that Russian leaders have deliberately ordered attacks against non-military objectives, such as hospitals, medical facilities, and shopping centers.\n\nAnother relevant international humanitarian law principle which Russian forces have likely violated is the principle of proportionality, which prohibits attacks expected to cause excessive incidental civilian harm in relation to the concrete military advantage anticipated. Russia has also violated the principle of precaution, which dictates that during the conduct of military operations, constant care must be taken to spare the civilian population, as well as civilian objectives. In addition, members of the Russian military have mistreated and tortured civilians, as well as carried out rapes and other forms of sexual violence; these acts constitute additional blatant violations of international humanitarian law.\n\nSerious violations of international humanitarian laws constitute war crimes. In fact, international humanitarian law holds individuals responsible for war crimes which they commit themselves, or which they order to be committed. States have the right to investigate persons responsible for the commission of war crimes in their national courts, under the principle of universal jurisdiction. Moreover, international humanitarian law is complemented by international criminal law, which sets out different modes of individual criminal responsibility for the commission of war crimes. Acts which constitute war crimes in all conflicts include those mentioned above - deliberately targeting civilians who are not directly taking part in hostilities, mistreating and torturing civilians, and rape and other forms of sexual violence. Therefore, it is clear that Russian forces have committed war crimes in Ukraine.\n\nThe Commission of Other Atrocity Crimes\n\nIn addition to war crimes, Russian leaders and forces have committed other atrocity crimes in Ukraine, including aggression, crimes against humanity, and possibly genocide. As mentioned above, Russia's invasion of Ukraine is a direct violation of international law's basic prohibition on the use of force. Moreover, Russia's attack against and invasion of Ukraine gives rise to the crime of aggression, which is defined by the International Criminal Court as the use of armed force by a State against the sovereignty, integrity or independence of another State.\n\nAlthough negotiations among states within the ICC's treaty framework have been complex and have resulted in an aggression regime which allows states to opt out, it may be argued that this definition of aggression has been accepted by the majority of states and that it reflects an emerging norm of customary law binding on all states. Russian actions in Ukraine clearly satisfy the legal definition of aggression; Russian leaders should face accountability for these acts.\n\nIn addition to aggression, Russian actions in Ukraine likely have given rise to crimes against humanity: acts committed as part of a widespread or systematic attack directed at a civilian population, such as murder, torture and rape. Russian forces have carried out a deliberate and systematic series of attacks against Ukrainian civilians, as well as acts of murder, torture, and rape. Although crimes against humanity have not been codified in a multilateral treaty as of writing, the commission of such crimes has been prosecuted in various international criminal tribunals as well as at the ICC. Russian leaders should incur criminal responsibility for the ordering and commissioning of crimes against humanity in Ukraine.\n\nFinally, Russian leaders appear to be acting with genocidal intent to \"Russify\" Ukraine by denying the existence of Ukrainian identity and ethnicity. Genocide is defined as the intentional destruction of a national, ethnic, religious or racial group. It has been codified since World War II in the Genocide Convention as well as in the statutes of international and hybrid criminal tribunals, including the ICC. Russian officials have deliberately depicted Ukrainians as subhuman, using terms such as \"scum,\" \"filth,\" \"bestial,\" or \"subordinate.\" Russian leaders have also portrayed Ukraine as a Nazi regime, in order to justify their pursuit of eliminating and destroying Ukraine.\n\nThe Russian pattern of atrocities committed in Ukraine, including mass killings, the shelling of shelters and evacuation routes, the indiscriminate bombardment of residential areas, and a pattern of rape and sexual violence all point toward a genocidal intent. Finally, forcible transfer of more than a million people to Russia, including 180,000 children, and reports of planned reforms in Russian legislation to accelerate adoption procedures for children from the Donbas region, as well as forcing abducted Ukrainian children to take Russian classes, further point to a genocidal intent to destroy the Ukrainian ethnicity. According to a recently published expert report, Russia is guilty of inciting genocide and of having the intent to commit genocide in Ukraine. United States President, Joe Biden, has already labeled Russian actions in Ukraine as genocide and other state leaders have followed. Russian leaders should face serious accountability for their genocidal plan and the ordering of genocidal acts against Ukraine.\n\nThe Need for Accountability\n\nRussian leaders, as well as members of the Russian military who have ordered the commission of atrocities or who have committed atrocities themselves should face accountability. Various accountability mechanisms where such prosecutions can take place either already exist or have been seriously debated in the international community.\n\nFirst, the ICC already has jurisdiction in Ukraine over genocide, crimes against humanity and war crimes in light of Ukraine's declarations accepting the Court's jurisdiction over these crimes, and ICC Prosecutor, Karim Khan, has deployed a team of investigators and prosecutors. Regrettably, the ICC does not have jurisdiction over the crime of aggression as neither Russia nor Ukraine are members of the ICC. However, Russian leaders may face accountability for crimes other than aggression at the ICC.\n\nIn order to prosecute Russian leaders for aggression, experts have been advocating toward the establishment of an ad hoc tribunal for aggression. Such a tribunal could be established either through an agreement among several states, or through an agreement between the United Nations and Ukraine. In addition, it is possible to prosecute some Russian perpetrators of atrocities in the national courts of third-party countries, under the principle of universal jurisdiction.\n\nFinally, Ukraine has already prosecuted one Russian soldier and it is possible that Ukrainian courts will continue to prosecute others. Some experts have started to advocate in favor of creating a special war crimes chamber within the Ukrainian court system, which would specialize in the prosecution of those who commit war crimes and other atrocities.\n\nConsidering the gravity and systematic nature of the crimes committed in Ukraine, it is crucial that Russian political and military leaders and soldiers who committed atrocities face accountability, whether at the international level, or through a hybrid or local prosecutorial mechanism.\n\nProfessor Sterio earned her law degree, magna cum laude, from Cornell Law School in 2002. At Cornell, she was Order of the Coif, general editor of the Cornell International Law Journal and a member of Phi Beta Kappa. In 2003, she earned a master's degree, cum laude, in Private International Law from the University Paris I-Pantheon-Sorbonne; in 2002, she earned a Maitrise en droit franco-americain cum laude, also from the Sorbonne. Her undergraduate degree, summa cum laude, in Political Science and French Literature is from Rutgers College, New Brunswick, New Jersey. Before joining the Cleveland-Marshall faculty, she was an associate in the New York City firm of Cleary, Gottlieb, Steen & Hamilton and an Adjunct Law Professor at Cornell, where she taught in the International War Crimes Clinic.\n\nSuggested citation: Milena Sterio, The Russian Invasion of Ukraine: Violations of International Law, JURIST - Academic Commentary, July 12, 2022, https://www.jurist.org/commentary/2022/07/Milena-Sterio-Russia-war-crimes-Ukraine/.", "source": {"uri": "jurist.org", "dataType": "news", "title": "JURIST"}, "authors": [], "image": "https://www.jurist.org/commentary/wp-content/uploads/sites/3/2022/06/ukraine_1656457347.jpg", "eventUri": "eng-7865602", "sentiment": -0.5137254901960784, "wgt": 142, "relevance": 1, "stanza_neg": 6, "stanza_neu": 60, "stanza_pos": 1, "swn_neg": 67, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]