[{"uri": "7204967410", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "10:47:00", "dateTime": "2022-09-28T10:47:00Z", "dateTimePub": "2022-09-28T10:47:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://wyborcza.pl/7,173236,28962802,poland-s-former-defense-minister-thanks-the-us-for-attacking.html", "title": "Poland&#039;s Former Defense Minister Thanks the US for Attacking Nord Stream Pipelines. Russian Officials Respond", "body": "\"Thank you, USA\" - Mr. Sikorski, Poland's former Minister of Defense, wrote on Twitter. It was a comment on the mysterious leaks in the Russian-owned Nord Stream gas pipelines discovered on Tuesday, September 27.\n\nFirst Deputy Permanent Representative of Russia to the UN Dmitry Polyanskiy joined the fiery exchange between Sikorski and Zakharova, ironically thanking Mr. Sikorski for revealing who was behind the \"terrorist-style targeting of civilian infrastructure\".\n\nSikorski himself quoted US President Joe Biden, who said at a press conference in February 2022 that if Russia attacks [Ukraine], \"there will be no longer a Nord Stream II\". When asked by reporters how the US intends to do it, he assured them that it \"will be able to do that\".\n\nSikorski, who also served as the head of Poland's Ministry of Foreign Affairs, recalled that Ukraine and all the Baltic States have opposed the construction of Nord Stream II for 20 years, and now \"$20 billion of scrap metal lies at the bottom of the [Baltic] sea - another cost to Russia after its criminal decision to invade Ukraine\". In another post, Mr. Sikorski stated that such a situation strengthens the position of Poland, Ukraine, as well as Turkey. He also pointed out that the pipeline was a tool for Putin to \"blackmail or wage war on Eastern Europe with impunity\", and that the damage to Nord Stream narrows Putin's room for maneuver- \"if he wants to resume gas supplies to Europe, he will have to talk to the countries controlling the Brotherhood and Yamal pipelines\".\n\nFor his statement, the MEP was also attacked by representatives of Poland's ruling Law and Justice party. The spokesman for Polish intelligence services Stanisław Żaryn called Sikorski's Tweet \"irresponsible\", while Deputy Minister for the Interior Maciej Wąsik said that the statement will surely be used by Russian propaganda.\n\n\"Let's remember that Putin doesn't need his agents and useful idiots to love Russia. It's enough for them to be anti-Western\" - Sikorski responded to his critics.\n\nIt is not the first time that the former Minister of Foreign Affairs Radosław Sikorski and Russia's MFA spokeswoman Maria Zakharova exchanged such harsh words. Another spat took place when Sikorski recalled that Russia violated the Budapest Memorandum guaranteeing Ukraine's security in exchange for the transfer of nuclear weapons to Russia. Yet another one, when Russians insulted his wife, the Atlantic columnist and writer Anne Applebaum.\n\nAt the time, Sikorski said that it was a good thing that the Russians had read her books \"Gulag\" and \"Red Famine\", and - referring to Zakharova's problems with alcohol - wrote that it was \"good that she got sober\". In the past, Sikorski has compared the Nord Stream II gas pipeline deal to the Molotov-Ribbentrop Pact.\n\n***\n\nEvery day, 400 journalists at Gazeta Wyborcza write verified, fact-checked stories about Polish politics and society, keeping a critical eye on the ruling camp's persistent assault on democratic values and the rule of law; the growing cultural tension between religious fundamentalism and human rights; and the ongoing Russian invasion in Ukraine. Our journalists are on the front lines in 32 Polish cities, reporting from the streets, hospitals, and courtrooms about issues that move public opinion.\n\nWe decided to make our service available to everyone free of charge in order to provide access to high quality journalism for expats and English speakers interested in Polish affairs.", "source": {"uri": "wyborcza.pl", "dataType": "news", "title": "wyborcza.pl"}, "authors": [], "image": "https://bi.im-g.pl/im/6f/9e/1b/z28961903FBW,Wyciek-z-gazociagu-Nord-Stream-1--Baltyk--okolice-.jpg", "eventUri": "eng-8059177", "sentiment": -0.1294117647058823, "wgt": 211, "relevance": 1, "stanza_neg": 5, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7206973473", "lang": "eng", "isDuplicate": false, "date": "2022-09-29", "time": "19:40:00", "dateTime": "2022-09-29T19:40:00Z", "dateTimePub": "2022-09-29T18:40:00Z", "dataType": "news", "sim": 0.8235294222831726, "url": "https://www.sgtreport.com/2022/09/russia-tells-eu-to-treat-u-s-as-a-suspect-in-sabotage-of-nord-stream-pipelines/", "title": "Russia Tells EU to Treat U.S. as a Suspect in Sabotage of Nord Stream Pipelines", "body": "The Russian Foreign Ministry on Wednesday asked the EU to treat the US as a suspect in the sabotage of the Nord Stream pipelines, citing Polish MEP Radoslaw Sikorski \"thanking\" the US for the destruction of the pipelines and Joe Biden's \"promise\" that there \"will be no longer a Nord Stream 2\" if Russia invades Ukraine.\n\nRussian Foreign Ministry spokesperson Maria Zakharova has asked who the EU intends to punish with the \"strongest possible response\" for damage to the Nord Stream gas pipelines.\n\nThe diplomat said Poland's former foreign minister has already identified the US as the party behind the apparent sabotage. Radoslaw Sikorski is well connected to Washington elites through his employment at various think tanks.\n\nThe two Nord Stream pipelines were seriously damaged this week in what is suspected to have been a deliberate attack.\n\nEuropean Commission President Ursula von der Leyen on Tuesday called the incident \"sabotage action\" and warned that \"any deliberate disruption of active European energy infrastructure is unacceptable and will lead to the strongest possible response.\"\n\nOn Wednesday, Zakharova asked who exactly the warning would apply to.\n\n\"I don't get it. MEP Sikorski thanked the US for what had happened, so whom is Ursula 'threatening' there?\" she wrote on social media.\n\nZakharova was referring to the reaction to the incident by Sikorski, now an EU lawmaker, who posted a photo of the site where the explosions occurred on Twitter with the words: \"Thank you, USA.\" He described the incident as a \"special maintenance operation.\"\n\nSikorski added that \"there's no shortage of pipeline capacity for taking gas from Russia to Western Europe, including Germany,\" referring to the Yamal-Europe land pipeline that goes through Belarus and Poland. After the damage to the Nord Stream strings, Russian President Vladimir Putin \"will have to talk to countries controlling\" the alternative route to resume supplies, he predicted.\n\nZakharova earlier asked if Sikorski's tweets amounted to an \"official statement that this was a terrorist attack.\" Meanwhile, Dmitry Polyanskiy, the Russian deputy ambassador to the UN, thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure!\"\n\nCui bono?\n\nThe US, Poland and Ukraine appear to be the main benefactors. The CIA wouldn't want their fingerprints on the attack so they could have worked with either country (or both) to carry out the attack.", "source": {"uri": "sgtreport.com", "dataType": "news", "title": "SGT Report"}, "authors": [], "image": null, "eventUri": "eng-8059177", "sentiment": -0.2549019607843137, "wgt": 210, "relevance": 1, "stanza_neg": 4, "stanza_neu": 12, "stanza_pos": 2, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7205649341", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "20:49:00", "dateTime": "2022-09-28T20:49:00Z", "dateTimePub": "2022-09-28T20:37:00Z", "dataType": "news", "sim": 0.800000011920929, "url": "https://therussophile.org/russia-tells-eu-to-treat-us-as-pipeline-sabotage-suspect.html/", "title": "Russia tells EU to treat US as pipeline sabotage suspect - Russia News Now", "body": "Russian Foreign Ministry spokesperson Maria Zakharova has asked who the EU intends to punish with the \"strongest possible response\" for damage to the Nord Stream gas pipelines.\n\nThe diplomat said Poland's former foreign minister has already identified the US as the party behind the apparent sabotage. Radoslaw Sikorski is well connected to Washington elites through his employment at various think tanks.\n\nThe two Nord Stream pipelines were seriously damaged this week in what is suspected to have been a deliberate attack.\n\nEuropean Commission President Ursula von der Leyen on Tuesday called the incident \"sabotage action\" and warned that \"any deliberate disruption of active European energy infrastructure is unacceptable and will lead to the strongest possible response.\"\n\nOn Wednesday, Zakharova asked who exactly the warning would apply to. She wrote on social media:\n\n\"I don't get it. MEP Sikorski thanked the US for what had happened, so whom is Ursula 'threatening' there?\"\n\nZakharova was referring to the reaction to the incident by Sikorski, now an EU lawmaker, who posted a photo of the site where the explosions occurred on Twitter with the words:\"Thank you, USA.\" He described the incident as a \"special maintenance operation.\"\n\nSikorski added that \"there's no shortage of pipeline capacity for taking gas from Russia to Western Europe, including Germany,\" referring to the Yamal-Europe land pipeline that goes through Belarus and Poland. After the damage to the Nord Stream strings, Russian President Vladimir Putin \"will have to talk to countries controlling\" the alternative route to resume supplies, he predicted.\n\nZakharova earlier asked if Sikorski's tweets amounted to an \"official statement that this was a terrorist attack.\" Meanwhile, Dmitry Polyanskiy, the Russian deputy ambassador to the UN, thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure!\"\n\nThere has been no shortage of threats from some Western nations against Russian undersea pipelines, particularly the Nord Stream 2 both before and after late February, when Moscow sent troops into Ukraine. It had been ready to pump gas since September last year, but was not put into operation due to Germany's refusal to certify it. Polish President Andrzej Duda demanded last month that the pipeline be \"totally scrapped.\"\n\nUS President Joe Biden warned in early February, before Russia began its military operation in Ukraine, that if Moscow acts against Kiev, \"there will no longer be a Nord Stream 2. We will bring an end to it.\" A journalist asked him to clarify what exactly he meant, to which Biden responded: \"I promise you, we will be able to do that.\"\n\nUS Secretary of State Antony Blinken commented on the incident on Tuesday, stating that attacking Russian pipelines was \"in no one's interest.\"\n\nfrom https://www.sott.net/article/472604-Russia-tells-EU-to-treat-US-as-pipeline-sabotage-suspect", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/09/1_Gas_leak_at_Nord_Stream_2_se.jpg?fit=520%2C307&ssl=1", "eventUri": "eng-8059177", "sentiment": -0.1294117647058823, "wgt": 204, "relevance": 1, "stanza_neg": 7, "stanza_neu": 14, "stanza_pos": 2, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7205474481", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "17:40:00", "dateTime": "2022-09-28T17:40:00Z", "dateTimePub": "2022-09-28T17:40:00Z", "dataType": "news", "sim": 0.7882353067398071, "url": "https://www.opednews.com/articles/Regarding-the-consensus-of-Investigation-220928-318.html", "title": "Regarding the consensus of sabotage to the Nord Stream 1 and 2 gas pipelines a thorough investigation must be conducted", "body": "Nord Stream Gas Pipelines Have Been Attacked! Both Nord Stream 1 and Nord Stream 2 natural gas pipelines in the Baltic Sea that connect Russia to Germany have been ...\n\n(Image by YouTube, Channel: Nobody Special Finance)\n\nRussian President Vladimir Putin shown with map of Nord Stream pipeline in the background revealing it was attacked.\n\nAs we know severe explosive damage to the Nord Stream 1 and 2 gas pipelines occurred on Monday in the Baltic Sea off the coast of the Danish island of Bornholm. There appears to be a consensus it was sabotage.\n\nAt this point \"the US, Russia and most European governments have reserved judgment as to who might be behind Monday's explosion of both Nord Stream pipelines.\" [1]\n\nHowever \"former Polish Foreign Minister Radoslaw Sikorski had no such qualms \" tweeting \"Thank You USA\".\n\nIn response to Sikorski \"Russian Foreign Ministry spokeswoman Maria Zakharova asked if his tweet amounted to an \"official statement that this was a terrorist attack\". Moscow's Deputy Ambassador to the UN Dmitri Polyansky thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure\". Yet Polish Prime Minister Mateusz Morawiecki wouldn't go as far as Sikorski calling it \"an act of sabotage, related to the next step of escalation of the situation in Ukraine\".\n\nEuropean Commission President Ursula von der Leyen weighed in calling the incident \"sabotage action\" and warned \"any deliberate disruption of active European energy infrastructure is unacceptable and will lead to the strongest possible response\". To which Zakharova asked the EU who it intends to punish for the damage to the pipelines.\" This after Sikorski-now an EU lawmaker- had identified the US as the culprit behind the apparent sabotage.\n\nApparently President Biden warned in early February, before Russia began its military operation in Ukraine, that if Moscow acts against Kiev \"there will no longer be a Nord Stream 2. We will bring an end to it\". Asked by a journalist to clarify his statement, \"Biden responded: I promise you, we will be able to do that.\" [2]\n\nSo did Biden let the cat out of the bag in February stating what he'd do to the Nord Stream 2 pipeline if Russia attacked Ukraine? His statement was pretty clear.", "source": {"uri": "opednews.com", "dataType": "news", "title": "OpEdNews"}, "authors": [{"uri": "dave_lefcourt@opednews.com", "name": "Dave Lefcourt", "type": "author", "isAgency": false}], "image": "https://i.ytimg.com/vi/DSWNA-WbrOc/mqdefault.jpg", "eventUri": "eng-8059177", "sentiment": -0.2549019607843137, "wgt": 201, "relevance": 1, "stanza_neg": 9, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 2, "title_swn_sent": 0}, {"uri": "7204999510", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "11:12:00", "dateTime": "2022-09-28T11:12:00Z", "dateTimePub": "2022-09-28T11:12:00Z", "dataType": "news", "sim": 0.7843137383460999, "url": "https://www.polandsun.com/news/272805738/russia-tells-eu-to-treat-us-as-pipeline-sabotage-suspect", "title": "Russia tells EU to treat US as pipeline sabotage suspect", "body": "Undersea infrastructure bringing Russian gas directly to Germany was damaged in what many believe to be a clandestine attack\n\nRussian Foreign Ministry spokesperson Maria Zakharova has asked who the EU intends to punish with the \"strongest possible response\" for damage to the Nord Stream gas pipelines.\n\nThe diplomat said Poland's former foreign minister has already identified the US as the party behind the apparent sabotage. Radoslaw Sikorski is well connected to Washington elites through his employment at various think tanks.\n\nThe two Nord Stream pipelines were seriously damaged this week in what is suspected to have been a deliberate attack.\n\nEuropean Commission President Ursula von der Leyen on Tuesday called the incident \"sabotage action\" and warned that \"any deliberate disruption of active European energy infrastructure is unacceptable and will lead to the strongest possible response.\"\n\nOn Wednesday, Zakharova asked who exactly the warning would apply to.\n\n\"I don't get it. MEP Sikorski thanked the US for what had happened, so whom is Ursula 'threatening' there?\" she wrote on social media.\n\nZakharova was referring to the reaction to the incident by Sikorski, now an EU lawmaker, who posted a photo of the site where the explosions occurred on Twitter with the words: \"Thank you, USA.\" He described the incident as a \"special maintenance operation.\"\n\nSikorski added that \"there's no shortage of pipeline capacity for taking gas from Russia to Western Europe, including Germany,\" referring to the Yamal-Europe land pipeline that goes through Belarus and Poland. After the damage to the Nord Stream strings, Russian President Vladimir Putin \"will have to talk to countries controlling\" the alternative route to resume supplies, he predicted.\n\nZakharova earlier asked if Sikorski's tweets amounted to an \"official statement that this was a terrorist attack.\" Meanwhile, Dmitry Polyanskiy, the Russian deputy ambassador to the UN, thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure!\"\n\nThere has been no shortage of threats from some Western nations against Russian undersea pipelines, particularly the Nord Stream 2 both before and after late February, when Moscow sent troops into Ukraine. It had been ready to pump gas since September last year, but was not put into operation due to Germany's refusal to certify it. Polish President Andrzej Duda demanded last month that the pipeline be \"totally scrapped.\"\n\nUS President Joe Biden warned in early February, before Russia began its military operation in Ukraine, that if Moscow acts against Kiev, \"there will no longer be a Nord Stream 2. We will bring an end to it.\" A journalist asked him to clarify what exactly he meant, to which Biden responded: \"I promise you, we will be able to do that.\"\n\nUS Secretary of State Antony Blinken commented on the incident on Tuesday, stating that attacking Russian pipelines was \"in no one's interest.\"", "source": {"uri": "polandsun.com", "dataType": "news", "title": "Poland Sun"}, "authors": [], "image": "https://cdn.bignewsnetwork.com/rtc1664360015.jpg", "eventUri": "eng-8059177", "sentiment": -0.1607843137254902, "wgt": 200, "relevance": 1, "stanza_neg": 8, "stanza_neu": 12, "stanza_pos": 2, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7205115158", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "12:45:00", "dateTime": "2022-09-28T12:45:00Z", "dateTimePub": "2022-09-28T12:44:00Z", "dataType": "news", "sim": 0.7803921699523926, "url": "https://www.b92.net/eng/news/world.php?yyyy=2022&mm=09&dd=28&nav_id=114552", "title": "The Russians to the EU: \"We are ready\"", "body": "Russia is ready to consider the European Union's idea of a joint investigation into the Nord Stream incident.\n\nAccording to \"Sputnik\", this was stated by a diplomat.\n\nAs a reminder, the damage to the North Stream attracted a lot of public attention, and some believe that it was sabotage.\n\nEuropean parliamentarian and former Polish foreign minister Rados³aw Sikorski \"thanked\" the United States of America for damaging the Nord Stream gas pipeline.\n\n\"A small thing, but so much joy. Thank you, USA,\" Sikorski announced on his Twitter account and posted a photo of the accident site on the Severn Stream gas pipeline, reports TASS.\n\nIn doing so, Sikorski quoted US President Joe Biden, who threatened on February 7 that the US would shoot down the Nord Stream if Russian troops crossed the Ukrainian border.\n\nOn the other hand, Western media believe that it is sabotage and that Russian President Vladimir Putin is most likely responsible for it.", "source": {"uri": "b92.net", "dataType": "news", "title": "B92"}, "authors": [], "image": "https://www.b92.net/news/pics/2022/09/28/44678093363343beda9c11820822360_640x360x002928.jpg", "eventUri": "eng-8059177", "sentiment": -0.0117647058823529, "wgt": 199, "relevance": 1, "stanza_neg": 1, "stanza_neu": 6, "stanza_pos": 1, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7208406310", "lang": "eng", "isDuplicate": false, "date": "2022-09-30", "time": "21:41:00", "dateTime": "2022-09-30T21:41:00Z", "dateTimePub": "2022-09-30T21:00:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://www.sott.net/article/472673-Ex-Polish-FM-deletes-tweet-implying-US-sabotaged-gas-pipeline", "title": "Ex-Polish FM deletes tweet implying US sabotaged gas pipeline -- Sott.net", "body": "Polish MEP and former foreign minister Radoslaw Sikorski has deleted a tweet in which he thanked the United States for apparently blowing up Russia's Nord Stream gas pipelines. Sikorski still reckons the US had the \"motive and the ability\" to sabotage the lines.\n\nAfter the Nord Stream 1 and Nord Stream 2 pipelines lost all pressure on Monday following a series of underwater explosions off the Danish island of Bornholm, Sikorski took to Twitter to gloat, posting a photo of a massive gas leak in the Baltic Sea and declaring, \"Thank you, USA.\" He added that the apparent act of sabotage means that Russia will now need to negotiate with Ukraine and Poland to ensure the continued flow of gas to Europe.\n\nAs of Thursday, Sikorski has deleted his thank-you message to Washington. In a tweet posted on Wednesday, he clarified that he was \"glad that the Nordstream ... is paralyzed.\"\n\n\"I naturally make working hypotheses about who had the motive and the ability to do so only on my own behalf,\" he stated.\n\nRussian Foreign Ministry spokeswoman Maria Zakharova had suggested that Sikorsky's tweet amounted to an \"official statement that this was a terrorist attack,\" while Moscow's deputy ambassador to the UN, Dmitry Polyanskiy, thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure!\"\n\nThe Biden administration has not blamed the incident on any one culprit, although US officials have described it as an act of \"apparent sabotage.\" Ukrainian officials and some Western media outlets have blamed Russia, accusations dismissed as \"stupid\" by Kremlin spokesman Dmitry Peskov.\n\nUS President Joe Biden claimed in February that the US would \"end\" Nord Stream 2 if Russian troops entered Ukraine, telling a reporter \"I promise you, we will be able to do it.\" NATO carried out tests of underwater drones near Bornholm earlier this summer, and Zakharova pointed out on Thursday that the entire Baltic Sea was \"packed full\" of the bloc's military infrastructure.", "source": {"uri": "sott.net", "dataType": "news", "title": "Signs Of The TImes"}, "authors": [], "image": "https://www.sott.net/image/s32/658740/full/d58.jpg", "eventUri": "eng-8059177", "sentiment": 0.07450980392156858, "wgt": 192, "relevance": 1, "stanza_neg": 3, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7205022067", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "11:30:00", "dateTime": "2022-09-28T11:30:00Z", "dateTimePub": "2022-09-28T11:29:00Z", "dataType": "news", "sim": 0.7490196228027344, "url": "https://www.ansa.it/nuova_europa/en/news/sections/news/2022/09/28/poland-former-ministry-thanks-us-after-nord-stream_ce4aa174-00dd-430a-a8b1-90c116d55ec1.html", "title": "Poland: former ministry 'thanks' US after Nord Stream - News - Nuova Europa", "body": "(ANSA) - BELGRADE, SEP 28 - Former Polish foreign minister and current European Parliament member Radoslav Sikorski appears to have implied the involvement of the US in the Nord Stream pipeline incidents by tweeting a photo of the accident site with the caption \"Thank you, USA.\" Sikorski went on to say that \"there is no shortage of pipeline capacity for transporting gas from Russia to Western Europe, including Germany.\" Nordstream's only logic was for Putin to be able to blackmail or wage war on Eastern Europe with impunity.\" The words of Sikorski caused a stir on Twitter, the public Polish television reported.\n\nThe Russian Foreign Ministry Spokeswoman Maria Zakharova reacted to his tweet, by asking if Sikorski's position was \"an official statement on this being a terrorist attack.\" Subsequently, Sikorski replied on Twitter by saying that \"all Ukrainian and Baltic sea states have opposed Nordstream's construction for 20 years. Now 20 billion-dollars of scrap metal lies at the bottom of the sea, another cost to Russia of its criminal decision to invade Ukraine. Someone, did a special maintenance operation,\" he added, replying on Twitter to the Russian Ministry of Foreign Affairs. (ANSA).", "source": {"uri": "ansa.it", "dataType": "news", "title": "ANSA.it"}, "authors": [], "image": "https://www.ansa.it/webimages/foto_large/2022/9/27/e52d4e037d8125cce84626c554ff17f0.jpg", "eventUri": "eng-8059177", "sentiment": -0.2549019607843137, "wgt": 191, "relevance": 1, "stanza_neg": 1, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7206873100", "lang": "eng", "isDuplicate": false, "date": "2022-09-29", "time": "17:53:00", "dateTime": "2022-09-29T17:53:00Z", "dateTimePub": "2022-09-29T17:46:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.rt.com/news/563752-sikorski-deletes-tweet-nordstream/", "title": "Polish MEP deletes tweet implying US sabotage  --  RT World News", "body": "Polish MEP and former foreign minister Radoslaw Sikorski has deleted a tweet in which he thanked the United States for apparently blowing up Russia's Nord Stream gas pipelines. Sikorski still reckons the US had the \"motive and the ability\" to sabotage the lines.\n\nAfter the Nord Stream 1 and Nord Stream 2 pipelines lost all pressure on Monday following a series of underwater explosions off the Danish island of Bornholm, Sikorski took to Twitter to gloat, posting a photo of a massive gas leak in the Baltic Sea and declaring, \"Thank you, USA.\" He added that the apparent act of sabotage means that Russia will now need to negotiate with Ukraine and Poland to ensure the continued flow of gas to Europe.\n\nAs of Thursday, Sikorski has deleted his thank-you message to Washington. In a tweet posted on Wednesday, he clarified that he was \"glad that the Nordstream ... is paralyzed.\"\n\n\"I naturally make working hypotheses about who had the motive and the ability to do so only on my own behalf,\" he stated.\n\nRussian Foreign Ministry spokeswoman Maria Zakharova had suggested that Sikorsky's tweet amounted to an \"official statement that this was a terrorist attack,\" while Moscow's deputy ambassador to the UN, Dmitry Polyanskiy, thanked Sikorski for \"making it crystal clear who stands behind this terrorist-style targeting of civilian infrastructure!\"\n\nThe Biden administration has not blamed the incident on any one culprit, although US officials have described it as an act of \"apparent sabotage.\" Ukrainian officials and some Western media outlets have blamed Russia, but with the flow of gas through the connection already controlled by Russia, Kremlin spokesman Dmitry Peskov called such accusations \"stupid.\"\n\nUS President Joe Biden claimed in February that the US would \"end\" Nord Stream 2 if Russian troops entered Ukraine, telling a reporter \"I promise you, we will be able to do it.\" NATO carried out tests of underwater drones near Bornholm earlier this summer, and Zakharova pointed out on Thursday that the entire Baltic Sea was \"packed full\" of the bloc's military infrastructure.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.09/article/6335d9b485f540024b436583.jpg", "eventUri": "eng-8059177", "sentiment": 0.07450980392156858, "wgt": 188, "relevance": 1, "stanza_neg": 3, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7206803549", "lang": "eng", "isDuplicate": false, "date": "2022-09-29", "time": "16:46:00", "dateTime": "2022-09-29T16:46:00Z", "dateTimePub": "2022-09-29T16:44:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://tass.com/society/1515423", "title": "Poland's former MFA deletes from Twitter his thanks to US for Nord Stream emergency", "body": "On Wednesday, Radoslaw Sikorski tried to present an excuse, saying his speculations about the US involvement in damaging the gas pipelines were his personal working suspicion\n\nWARSAW, September 29. /TASS/. Poland's former foreign minister (2007-2014), European parliament member Radoslaw Sikorski, on Thursday removed from Twitter his thanks to the United States for damaging the Nord Stream and Nord Stream 2 gas pipelines.\n\nOn Tuesday, Sikorsky thanked the US for the damage to the Nord Stream gas pipeline on his Twitter page. He illustrated the post with a photo from the site of the emergency and supplied it with a hashtag #Nordstream. In support of his conclusion Washington was behind the incident Sikorski cited US President Joe Biden's remark dropped on February 7 to the effect that the United States would put an end to Nord Stream 2, if Russian troops crossed the Ukrainian border.\n\nSikorski's statement triggered a wave of sharp criticism in Poland. It was called extremely irresponsible. Also, many in Warsaw demanded a probe into Sikorski's sources of funding in addition to his earnings as a member of the European Parliament.\n\nOn Wednesday, Sikorski tried to present an excuse, saying his speculations about the US involvement in damaging the gas pipelines were his personal working suspicion. He said he was glad that the pipeline, which the Polish governments had been fighting against 20 years, was three-quarters paralyzed. He said that was good for Poland and expressed the hope that the Danish investigation would expose those responsible.\n\nOn September 27, Nord Stream AG reported \"unprecedented damage\" on three strings of the offshore gas pipelines of the Nord Stream system. Russian presidential spokesman Dmitry Peskov said that Moscow was \"extremely concerned about this news.\" He did not rule out that the disruption of the pipelines' operation might have been a result of sabotage.\n\nLater, Swedish seismologists said they had identified two explosions on the routes the Nord Stream pipelines on Monday. The head of the European Commission, Ursula von der Leyen, classified these incidents as sabotage.\n\n\"Any deliberate disruption of European energy infrastructure is utterly unacceptable and will be met with a robust and united response,\" EU foreign policy chief Josep Borrell underlined in a statement.\n\nRussian Foreign Ministry spokeswoman Maria Zakharova said that in any case Washington would have to explain gas leaks incidents on pipelines and make a confession. Zakharova also said that the US president was obliged to answer the question whether Washington had acted on its February 7 threat against Nord Stream 2. The US administration has denied that Biden actually threatened to destroy the Nord Stream pipelines. White House spokesperson Karine Jean-Pierre said that Biden had in mind joint efforts with Germany to freeze the implementation of the Nord Stream 2 project.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "eventUri": "eng-8059177", "sentiment": -0.207843137254902, "wgt": 188, "relevance": 1, "stanza_neg": 8, "stanza_neu": 13, "stanza_pos": 2, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 2, "title_swn_sent": 0}, {"uri": "7205631499", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "20:28:00", "dateTime": "2022-09-28T20:28:00Z", "dateTimePub": "2022-09-28T20:20:00Z", "dataType": "news", "sim": 0.7098039388656616, "url": "https://www.sgtreport.com/2022/09/thank-you-usa-polish-mep-praises-u-s-for-destroyed-nord-stream-pipelines/", "title": "\"Thank You, USA\": Polish MEP Praises U.S. For Destroyed Nord Stream Pipelines", "body": "Polish MEP Radoslaw Sikorski, who attended the Bilderberg meeting in DC earlier this year together with his arch-neocon wife Anne Applebaum, openly \"thanked\" the US for the destruction of the Nord Stream pipelines in a post Tuesday on Twitter.\n\n\"Thank you, USA,\" Sikorski said on Twitter, sharing a photograph of the Nord Stream 2 pipeline leaking massive amounts of gas into the ocean off the coast of Denmark's Bornholm island.\n\nRight before making the comment, Sikorski retweeted Biden's \"promise\" from back in February where he said there \"will be no longer a Nord Stream 2\" if Russia invades Ukraine.\n\nRight before making the comment, Sikorski retweeted Biden's \"promise\" from back in February where he said there \"will be no longer a Nord Stream 2\" if Russia invades Ukraine.\n\nThe implication is clearly that the Biden regime bombed the pipelines.\n\nSikorski's wife, Anne Applebaum, has been intimately involved in fomenting the Ukraine war effort and was even given an award by Volodymyr Zelensky himself earlier this month for being a \"journalist\" who is helping \"fight for Ukraine on the military and information fronts.\"\n\nIf the CIA bombed these civilian pipelines that's an insane act of war that will further devastate Europe's economy and risk a full-blown war with Russia.", "source": {"uri": "sgtreport.com", "dataType": "news", "title": "SGT Report"}, "authors": [], "image": null, "eventUri": "eng-8059177", "sentiment": -0.1843137254901961, "wgt": 181, "relevance": 1, "stanza_neg": 0, "stanza_neu": 6, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7205173810", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "13:31:00", "dateTime": "2022-09-28T13:31:00Z", "dateTimePub": "2022-09-28T13:02:00Z", "dataType": "news", "sim": 0.6784313917160034, "url": "http://conservativeangle.com/poland-slams-politician-who-suggested-u-s-blew-up-pipelines-what-an-act-of-gross-irresponsibility/", "title": "Poland Slams Politician Who Suggested U.S. Blew Up Pipelines: 'What An Act Of Gross Irresponsibility!' - Conservative Angle", "body": "A top Polish official slammed a Polish member of European Parliament on Tuesday for suggesting the United States was behind damage to two Russian gas pipelines to Germany this week.\n\nRadoslaw Sikorski, a member of European Parliament and chairman of the Delegation for relations with the United States, wrote on Twitter, \"Thank you, USA,\" along with a picture that showed methane coming to the surface from one of the spots where the pipeline ruptured.\n\n\"By the way, there's no shortage of pipeline capacity for taking gas from Russia to Western Europe, including Germany,\" Sikorski claimed on Twitter. \"Nordstream's only logic was for Putin to be able to blackmail or wage war on Eastern Europe with impunity.\"\n\n\"All Ukrainian and Baltic sea states have opposed Nordstream's construction for 20 years,\" he continued. \"Now $20 billion of scrap metal lies at the bottom of the sea, another cost to Russia of its criminal decision to invade Ukraine. Someone, @MFA_Russia , did a special maintenance operation.\"\n\nRussia instantly capitalized on the statement from Sikorksi, who is married to American leftist writer Anne Applebaum, asking on social media if his statement was \"an official statement on this being a terrorist attack.\"\n\nSikorksi's remarks were quickly condemned by Stanislaw Zaryn, Poland's secretary of state and former director of the Department of National Security.\n\n\"Russian #propaganda instantly launched a smear campaign against Poland, the US and Ukraine, accusing the West of aggression against #NS1 and #NS2,\" Zaryn tweeted. \"Authenticating the Russian lies at this particular moment jeopardizes the security of Poland. What an act of gross irresponsibility!\"\n\nNord Stream AG, the Russian company behind the pipelines, released a statement on the incident, calling it \"unprecedented.\"\n\n\"The destruction that occurred on the same day simultaneously on three strings of the offshore gas pipelines of the Nord Stream system is unprecedented,\" the company said in a statement. \"It is not yet possible to estimate the timing of the restoration of the gas transport infrastructure.\"\n\nA report from German news outlet Spiegel said that the CIA had cautioned Germany about possible attacks on Baltic Sea gas pipelines weeks ago. Berlin is presently assuming it was a targeted attack on the Nord Stream system, unnamed sources said.\n\nGermany, the continent's largest economy, relied upon Russian natural gas for 55% of its imports before the beginning of the conflict. The producer price index for industrial products in Germany has risen 45.8% year-over-year as of August 2022, according to data from the Federal Statistical Office of Germany, which followed increases of 37.2% in July 2022 and 32.7% in June 2022.\n\nSeveral manufacturers have therefore paused operations in response to high energy prices and a likely drop in consumer demand. Industrial production in the eurozone has fallen 2.3%, according to data from the European Union.\n\nBen Zeisloft contributed to this report.", "source": {"uri": "conservativeangle.com", "dataType": "news", "title": "Brigitte Gabriel"}, "authors": [], "image": "https://dw-wp-production.imgix.net/2022/09/pipeline-scaled.jpg", "eventUri": "eng-8059177", "sentiment": -0.192156862745098, "wgt": 173, "relevance": 1, "stanza_neg": 4, "stanza_neu": 18, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7204547644", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "04:12:00", "dateTime": "2022-09-28T04:12:00Z", "dateTimePub": "2022-09-28T04:00:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.rawstory.com/trump-nord-stream-pipeline/", "title": "Trump spreads Nord Stream pipeline conspiracy theory in late night Truth Social post", "body": "Notorious birther, QAnoner and election denier Donald Trump is now spreading a conspiracy theory that the United States sabotaged Russia's Nord Stream pipeline.\n\n\"Explosions under the Baltic Sea and the rupture of major natural gas pipelines from Russia to Germany appeared to be a deliberate attack, officials across Europe said on Tuesday, deepening uncertainty about European energy security amid soaring prices and fears of running short of fuel over the winter,\" The New York Times reported. \"Three separate leaks erupted from the Nord Stream 1 and 2 pipelines, which were already caught up in the conflict over Russia's invasion of Ukraine, sending swirling streams of methane to the surface of waters off Denmark and Sweden. Top Polish and Ukrainian leaders blamed Moscow, while Russian state media suggested U.S. or Ukrainian involvement.\"\n\nTrump noted a Twitter post Radek Sikorski, a Polish member of the European Parliament and the government's former minister of foreign affairs. Sikorski is married to The Atlantic staff writer Anne Applebaum, the author of Twilight of Democracy: The Seductive Lure of Authoritarianism.\n\nOn Truth Social, Trump commented on Sikorski's tweet.", "source": {"uri": "rawstory.com", "dataType": "news", "title": "Raw Story"}, "authors": [], "image": "https://www.rawstory.com/media-library/sabotage-suspected-after-discovery-of-nord-stream-gas-pipeline-leaks.jpg?id=31832441&width=1200&height=600&coordinates=0%2C133%2C0%2C133", "eventUri": "eng-8059177", "sentiment": -0.192156862745098, "wgt": 170, "relevance": 1, "stanza_neg": 2, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7206915520", "lang": "eng", "isDuplicate": false, "date": "2022-09-29", "time": "18:36:00", "dateTime": "2022-09-29T18:36:00Z", "dateTimePub": "2022-09-29T18:29:00Z", "dataType": "news", "sim": 0.658823549747467, "url": "https://therussophile.org/cia-warned-germany-about-gas-pipeline-attack-weeks-ago.html/", "title": "CIA Warned Germany About Gas Pipeline Attack Weeks Ago - Russia News Now", "body": "According to a report by German magazine Der Spiegel, the CIA warned Berlin about a potential attack on gas pipelines in the Baltic Sea \"weeks ago.\"\n\nCiting \"several people familiar with the matter,\" the publication reports that a tip from the US spy agency was \"received in Berlin during the summer.\"\n\nAs we highlighted yesterday, Germany's initial response to the incident was that it was likely to be a \"targeted attack\" carried out by either Russia or Ukraine.\n\nGerman investigators concluded that attack had to be deliberate because it would have been carried out by special forces, navy divers or a submarine which were able to reach the bottom of the sea and place mines or explosives.\n\nAlthough not ruling out that the attack could have been a Russian \"false flag,\" the only perceived motive would have been to \"blame other parties for the incident,\" Der Spiegel reported, while acknowledging that a \"permanent interruption of gas supplies from Russia\" would be in Ukraine's interest.\"\n\nUkraine has inevitably blamed Russia, although why Moscow would sabotage two pipelines that weren't even transporting gas to Europe remains a mystery.\n\nOthers have suggested the U.S. is to blame, including former Polish Defense Minister, Radek Sikorski, who appeared to thanks Washington for carrying out the attack in a tweet (now apparently deleted - Ed.).\n\nAmazon.com\n\nAs Chris Menahan explains, Sikorski is married to arch-neocon Anne Applebaum and attended the Bilderberg meeting earlier this year, meaning he is very much part of the global elite.\n\n\"If the CIA bombed these civilian pipelines that's an insane act of war that will further devastate Europe's economy and risk a full-blown war with Russia,\" he writes.\n\nHowever, Poland's Secretary of State, Stanislaw Zaryn, accused Sikorki of amplifying \"Russian propaganda.\"\n\n\"Authenticating the Russian lies at this particular moment jeopardizes the security of Poland. What an act of gross irresponsibility!\" wrote Zaryn.\n\nOthers have pointed to Joe Biden's promise that he would \"bring an end to\" Nord Stream 2 if Russia attacked Ukraine.\n\nUndersecretary of State for Political Affairs Victoria Nuland also previously insisted, \"If Russia invades Ukraine, one way or another, Nord Stream 2 will not move forward.\"\n\nDenmark became the latest country to announce that it had detected seismic blasts immediately before the leak, adding it believed \"deliberate actions\" by unknown perpetrators were responsible.\n\n\"It is the authorities' clear assessment that these are deliberate actions -- not accidents,\" Danish Prime Minister Mette Frederiksen said.\n\nfrom https://www.activistpost.com/2022/09/cia-warned-germany-about-gas-pipeline-attack-weeks-ago.html", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/09/nordstream-2-tmu.jpg?fit=1161%2C660&ssl=1", "eventUri": "eng-8059177", "sentiment": -0.3568627450980392, "wgt": 168, "relevance": 1, "stanza_neg": 4, "stanza_neu": 14, "stanza_pos": 0, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7205572300", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "19:21:00", "dateTime": "2022-09-28T19:21:00Z", "dateTimePub": "2022-09-28T18:54:00Z", "dataType": "news", "sim": 0.6549019813537598, "url": "https://newspunch.com/inside-job-cia-gave-germany-heads-up-about-pipeline-attack-weeks-ago/", "title": "Inside Job: CIA Gave Germany Heads Up About Pipeline Attack Weeks Ago - News Punch", "body": "The CIA warned German authorities that a planned attack on a gas pipeline in the Baltic Sea was imminent just a few weeks ago.\n\nAccording to a report by German magazine Der Spiegel, several German government officials were tipped off from the US spy agency about the attack during the summer.\n\nSummit.news reports: As we highlighted yesterday, Germany's initial response to the incident was that it was likely to be a \"targeted attack\" carried out by either Russia or Ukraine.\n\nGerman investigators concluded that attack had to be deliberate because it would have been carried out by special forces, navy divers or a submarine which were able to reach the bottom of the sea and place mines or explosives.\n\nAlthough not ruling out that the attack could have been a Russian \"false flag,\" the only perceived motive would have been to \"blame other parties for the incident,\" Der Spiegel reported, while acknowledging that a \"permanent interruption of gas supplies from Russia\" would be in Ukraine's interest.\"\n\nUkraine has inevitably blamed Russia, although why Moscow would sabotage two pipelines that weren't even transporting gas to Europe remains a mystery.\n\nOthers have suggested the U.S. is to blame, including former Polish Defense Minister, Radek Sikorski, who appeared to thanks Washington for carrying out the attack in a tweet.\n\nAs Chris Menahan explains, Sikorski is married to arch-neocon Anne Applebaum and attended the Bilderberg meeting earlier this year, meaning he is very much part of the global elite.\n\n\"If the CIA bombed these civilian pipelines that's an insane act of war that will further devastate Europe's economy and risk a full-blown war with Russia,\" he writes.\n\nHowever, Poland's Secretary of State, Stanislaw Zaryn, accused Sikorki of amplifying \"Russian propaganda.\"\n\n\"Authenticating the Russian lies at this particular moment jeopardizes the security of Poland. What an act of gross irresponsibility!\" wrote Zaryn.\n\nOthers have pointed to Joe Biden's promise that he would \"bring an end to\" Nord Stream 2 if Russia attacked Ukraine.\n\nUndersecretary of State for Political Affairs Victoria Nuland also previously insisted, \"If Russia invades Ukraine, one way or another, Nord Stream 2 will not move forward.\"\n\nDenmark became the latest country to announce that it had detected seismic blasts immediately before the leak, adding it believed \"deliberate actions\" by unknown perpetrators were responsible.\n\n\"It is the authorities' clear assessment that these are deliberate actions -- not accidents,\" Danish Prime Minister Mette Frederiksen said.", "source": {"uri": "newspunch.com", "dataType": "news", "title": "News Punch"}, "authors": [], "image": "https://cdn.newspunch.com/wp-content/uploads/2022/09/CIA-germany.jpg.webp", "eventUri": "eng-8059177", "sentiment": -0.4196078431372549, "wgt": 167, "relevance": 1, "stanza_neg": 6, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7207998077", "lang": "eng", "isDuplicate": false, "date": "2022-09-30", "time": "14:29:00", "dateTime": "2022-09-30T14:29:00Z", "dateTimePub": "2022-09-30T14:28:00Z", "dataType": "news", "sim": 0.6274510025978088, "url": "https://www.breitbart.com/europe/2022/09/30/russia-stand-to-gain-the-most-from-sabotage-of-russian-gas-pipelines-claims-german-intelligence-chief/", "title": "Russians 'Gain the Most' from Pipeline Sabotage, Says German Spy Boss", "body": "The former head of the German Federal Intelligence Service claims Russia stood \"to gain the most\" from sabotaging Russian gas pipelines to Germany bypassing Ukraine and Poland.\n\n\"An unnoticed, conspiratorial damage to pipelines at a depth of 80 meters in the Baltic Sea requires sophisticated technical and organizational capabilities that clearly point to a state actor,\" said ex-intelligence chief Gerhard Schindler, in comments to German media quoted by POLITICO.\n\nThe German went on to insist that \"[o]nly Russia can really be considered for this, especially since it stands to gain the most from this act of sabotage\". While this is a common view among European leaders, it otherwise amounts to one of several publicly unproven theories in a global game of finger-pointing around the sabotage of the Nord Stream natural gas pipelines.\n\nOthers said to have an interest in the pipeline being damaged are Ukraine, who would be disadvantaged in the war if European countries crumbled on sanctions over winter in a bid to buy Russian gas to keep the heating on, and Poland who are hawkish on Russia and earn money on transit fees of gas passing through their territory, which Nord Stream does not.\n\nWhile transit fees are still an important source of revenue for Ukraine to this day, with payments ongoing despite Moscow and Ukraine being actively at war with one another it seems to stretch credulity to breaking point to imagine Poland would choose now of all times to start bombing energy infrastructure.\n\nSome -- particularly Russia and China -- have pointed the finger of blame at the United States, citing a February speech made by U.S. President Joe Biden vowing that if Russia invaded Ukraine, he had the tools at his disposal to \"bring an end\" to Nord Stream 2.\n\nNevertheless, officials in European Union countries appear confident that the damage to the Nord Stream pipelines, which was inflicted right as a new Norway-Denmark-Poland gas pipeline opened, was a result of sabotage rather than an accident or seismic activity.\n\nUkrainian officials, like their counterparts abroad including Germany's Schindler and the likes of UK Conservative politician Bob Seely in the United Kingdom, have also pointed the finger of blame at Russia, with Mykhailo Podolyak, an adviser to President Volodymyr Zelensky, branding the explosions \"a terrorist attack planned by Russia and an act of aggression towards [the European Union].\"\n\nPolitical insiders are promoting similar arguments, suggesting that Russia destroyed its own Nord Stream pipelines -- but not pipelines running overland -- to send its Western customers a message.\n\n\"Prepare for a life without Russian gas... It's a threat of a complete cut-off,\" suggested David Goldwyn, the U.S. State Department's energy tsar under Barack Obama, in terms of a potential rationale for Russia destroying its own pipelines -- although they had cut off Nord Stream 1 already and Nord Stream 2 never went into operation.\n\nThe speculation that Western actors were behind the alleged sabotage of Nord Stream has been fuelled to a great extent by Radek Sikorski, a Member of the European Parliament (MEP) and former Polish foreign minister under the previous globalist Civil Platform (PO) party.\n\nSikorski, who ironically was forced out of office after a recorded conversation in which his foul-mouthed dismissal of the Polish alliance with Barack Obama's America as \"worthless\" was leaked, tweeted a picture of the sea bubbling at the site of the damage with the words \"Thank you, USA\" shortly after the damage was first reported.", "source": {"uri": "breitbart.com", "dataType": "news", "title": "Breitbart"}, "authors": [{"uri": "jack_montgomery@breitbart.com", "name": "Jack Montgomery", "type": "author", "isAgency": false}], "image": "https://media.breitbart.com/media/2022/09/GettyImages-123930939-e1664526039525.jpg", "eventUri": "eng-8059177", "sentiment": 0.1450980392156862, "wgt": 160, "relevance": 1, "stanza_neg": 6, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7207728697", "lang": "eng", "isDuplicate": false, "date": "2022-09-30", "time": "10:48:00", "dateTime": "2022-09-30T10:48:00Z", "dateTimePub": "2022-09-30T10:30:00Z", "dataType": "news", "sim": 0.615686297416687, "url": "https://therussophile.org/aftershock-of-nord-stream-explosions-rumbles-warsaw-polish-politicians-go-nutters.html/", "title": "AFTERSHOCK OF NORD STREAM EXPLOSIONS RUMBLES WARSAW  --  POLISH POLITICIANS GO \"NUTTERS\" - Russia News Now", "body": "The Polish government in Warsaw, facing re-election in less than a year, wants all the credit from Washington for their joint operation to sabotage the Nord Stream gas pipelines on the Baltic seabed.\n\nIt also wants to intimidate the German chancellor in Berlin, and deter both American and German officials from plotting a takeover by the Polish opposition party, Civic Platform, next year.\n\nBlaming the Russians for the attack is their cover story. Attacking anyone who doesn't believe it, including Poles and Germans, Warsaw officials and their supporting media claim they are dupes or agents of Russian disinformation.\n\nTheir rivals, Civic Platform (PO) politicians trailing the PiS in the polls by seven percentage points, want Polish voters to think that no credit for the Nord Stream attack should be earned by the ruling Law and Justice (PiS) party. They also want to divert the Russian counter-attack from Warsaw to Washington.\n\n\"Thank you USA\" was the first Polish political declaration tweeted hours after the blasts by Radoslaw Sikorski, the PO's former defence and foreign minister, now a European Parliament deputy. In support and justification, his old friend and PO ministerial colleague, Roman Giertych, warned Sikorski's critics: \"Would you nutters prefer that the Russians find us guilty?\"\n\nIn Washington this week to ask for more military and financial assistance, Zbigniew Rau, the PiS foreign minister, said: \"Radosław Sikorski in this hybrid war between Russia and NATO countries has taken the wrong side.\"\n\nSignalling the domestic impact of the Nord Stream operation, TVP Info, controlled by the government's broadcast agency Telewizja Polska, headlined Rau as attacking Sikorski, not the Russians for the alleged seabed attack. \"The hypothesis that Russian services are behind it is becoming more and more credible,\" Rau reportedly added.\n\nMaciej Wąsik, the PiS official in charge of the Polish security services at the Interior Ministry, was more explicit. He tweeted:\n\nState Department officials were telling the truth, Wasik said - Sikorski was lying. The tweet reads: \"US State Department spokesman on Sikorski's statements: 'The idea that the US was behind the Nord Stream explosions is ridiculous and is nothing more than a function of Russian disinformation.' Sikorski. Civil Platform. Russian disinformation.\"\n\n\"I don't know if the U.S. is behind the explosion of gas pipelines in the Baltic,\" commented Roman Giertych (right); he was a deputy prime\n\nminister in the PiS government of 2007-2007, when Sikorski was defence minister, then foreign minister; they are reported to be friends.\n\nGiertych tweeted: \"I don't know if the U.S. is behind the explosion of gas pipelines in the Baltic. But I do know that I'd rather the Russians think they were behind it than us. And I am very concerned that there is some rage within the Law and Justice Party against Sikorski for his tweet. Would you nutters prefer that the Russians find us guilty?\"\n\nThis support failed to relieve Sikorski; he has erased his tweet in support of the operation. But Giertych has continued to defend Sikorski by showing Sikorski's wife, Anne Applebaum, receiving an award from the Ukrainian president in Kiev:\n\nFor the time being, the official Russian counter-attack has focused on the US role in the operation, keeping silent on the Polish one. This may change as the promised Russian government investigation decides to publish parts of the Russian intelligence records. \"I hope, \" Maria Zakharova, the Foreign Ministry spokesman, said in the most detailed statement to date from Moscow on Thursday afternoon, \"that someone in the United States, or maybe someone in Europe -- although, unfortunately, Europe in this case can no longer be counted on -- someone from among independent investigators will have a desire to clarify the involvement of the United States, its special services and all other bodies in what happened on 25-27 September of this year in the Baltic Sea.\"\n\nZakharova is making a Russian pitch at the public opinion of the Germans - possibly the last one - but no longer the Poles. \"There is a feeling that for Europe, at an existential level, the very idea that those whom they call 'allies' may be behind this incident, [and that their] provocation, sabotage is unacceptable. This idea is so monstrous for them and marks the point of no return that they cannot afford other arguments than the hackneyed Russian 'factor'. They are afraid to break away from the 'written', because then the whole ideology will collapse at an instant, and the terrible truth will be exposed.\"\n\n\"But we have to start somewhere. Brussels will still have to explain to its citizens what they have done to their continent. With ours. This is our continent, too.\"\n\nby Editor - Friday, September 30th, 2022\n\nFrom http://johnhelmer.net/aftershock-of-nord-stream-explosions-rumbles-warsaw-polish-politicians-go-nutters/", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/09/2737AFTERSHOCK-OF-NORD-STREAM-1.jpg?fit=514%2C347&ssl=1", "eventUri": "eng-8059177", "sentiment": -0.08235294117647063, "wgt": 157, "relevance": 1, "stanza_neg": 13, "stanza_neu": 24, "stanza_pos": 1, "swn_neg": 38, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7208761037", "lang": "eng", "isDuplicate": false, "date": "2022-10-01", "time": "16:22:00", "dateTime": "2022-10-01T16:22:00Z", "dateTimePub": "2022-10-01T15:59:00Z", "dataType": "news", "sim": 0.6039215922355652, "url": "https://www.sgtreport.com/2022/10/should-europeans-thank-the-americans-for-destroying-nord-stream/", "title": "Should Europeans 'Thank' the Americans for Destroying Nord Stream?", "body": "Europe should have heeded the advice of Henry Kissinger: \"To be an enemy of the U.S. is dangerous, but to be a friend is fatal.\"\n\nWith an investigation continuing into the destruction of the Nord Stream gas pipeline that provided energy supplies to Europe from Russia, there appears to be just one prime suspect, and that should surprise nobody.\n\nFollowing the sabotage of the Nord Stream 1 and 2 gas pipelines, former Polish Foreign Minister Radoslaw Sikorski already seemed to know the identity of the perpetrator when he tweeted out: \"Thank you, USA.\"\n\nTRUTH LIVES on at https://sgtreport.tv/\n\nAt first glance, it seemed that Sikorski was speaking sarcastically, berating Washington for carrying out an attack that will have severe repercussions for the people of Europe. After all, how could anyone see any good coming from the termination of Europe's primary source of gas reserves with winter just around the corner? It was Sikorski's homeland of Poland, after all, that urged its citizens to collect firewood in the face of dwindling gas reserves.\n\nIn fact, the Polish diplomat was speaking one-hundred percent literally, thanking the United States for plunging the continent deeper into the abyss. This has been the attitude of European leaders from the start of Russia's special military operation in Ukraine: 'we will accept our self-destruction as scripted by Washington policymakers so long as the baddies in Moscow hears our virtue-signaling whimpers and screams.' European capitals are about to learn the hard way that virtue signaling does not put food on the table or heat homes.\n\nJudging by the rising temperature in Europe, however, last seen in Italy where a far-right leader has come to power on the wave of voters fed up with high electricity bills and loose immigration, the phrase 'Thank you, USA' may eventually be chiseled into Europe's tombstone.\n\nBut first, the big question: was the United States really responsible for the destruction of Nord Stream, as Sikorski seems to believe? Well, if we were are to take bumbling Joe Biden at his word, then the answer would seem to be yes.\n\n\"If Russia invades, that means tanks or troops crossing the border of Ukraine, again, then there will be -- there will be no longer a Nord Stream 2,\" the U.S. leader told reporters two weeks before Russia began its Ukrainian mission. \"We will bring an end to it.\"\n\nWhen asked to specify, Biden responded, \"I promise you, we'll be able to do it.\"\n\nThere are other clues that point to American complicity.\n\nOn September 2, an American helicopter with the call sign FFAB123 was observed maneuvering in the area of the Nord Stream pipelines. According to the site ads-b.nl, six aircraft used this call sign that day, of which the tail numbers of three were established. All of them were Sikorsky MH-60S. By overlaying the FFAB123 route on the scheme marking the areas of the explosions, it is observable that the helicopter either flew along the Nord Stream-2 route, or exactly between the points where the 'accident' occurred.\n\nMeanwhile, on Twitter, there are screenshots of other American aircraft flights as of September 13th in exactly the same area. In June there was an article in Sea Power magazine where the Americans boast of experiments in the field of underwater drones that they set up at the BALTOPS 22 exercises - in the area of Bornholm Island, the Danish island where the explosions were reported to have occurred.\n\n\"Experimentation was conducted off the coast of Bornholm, Denmark, with participants from Naval Information Warfare Center Pacific, Naval Undersea Warfare Center Newport, and Mine Warfare Readiness and Effectiveness Measuring all under the direction of U.S. 6th Fleet Task Force 68,\" Sea Power reports.\n\nSuch an \"experiment\" would have required the deep-sea equipment needed for reaching the depths where the Nord Stream pipelines are located.\n\nFinally, here's one last tantalizing piece of information for all of the 'coincidence theorists' out there. On the day after Nord Stream 1 and 2 went offline, Poland, Norway and Denmark's leaders attended the opening ceremony of the new Baltic Pipe, which will transport natural gas from Norway via Denmark and through the Baltic Sea to, yes, Sikorski's ferociously Russophobic homeland of Poland. Yes, just a coincidence.\n\nHowever, the main motivating factor for Washington having a hand in destroying Nord Stream is the awesome powers - both financial and political - that it will reap. The economic crisis in Europe is already forcing companies and corporations to consider relocating to the U.S., which is providing a better business environment and more or less affordable electricity bills.\n\nAnd after the destruction of Nord Stream, the economic situation on the continent will deteriorate significantly. Even though the NS-II was not launched, there was the chance of its launch, and this \"chance\" had a considerable effect on the market. Now, without its main energy supplier, Europe is doomed while America will soar.\n\nThe economic destruction of Europe makes it totally dependent on the U.S. economically, politically, and militarily, turning it into a toothless tiger with no political will and independence. At the same time, Europe will become almost completely dependent on the U.S. for its (prohibitive) gas. The United States plans to supply at least 15 billion cubic metres (bcm) of liquefied natural gas (LNG) to European Union markets this year as Europe seeks to wean itself off Russian gas supplies.", "source": {"uri": "sgtreport.com", "dataType": "news", "title": "SGT Report"}, "authors": [], "image": null, "eventUri": "eng-8059177", "sentiment": 0.01960784313725483, "wgt": 154, "relevance": 1, "stanza_neg": 9, "stanza_neu": 24, "stanza_pos": 3, "swn_neg": 36, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7205381673", "lang": "eng", "isDuplicate": false, "date": "2022-09-28", "time": "16:17:00", "dateTime": "2022-09-28T16:17:00Z", "dateTimePub": "2022-09-28T15:35:00Z", "dataType": "news", "sim": 0.5921568870544434, "url": "https://europe.infowars.com/cia-warned-germany-about-gas-pipeline-attack-weeks-ago/", "title": "CIA Warned Germany About Gas Pipeline Attack Weeks Ago", "body": "According to a report by German magazine Der Spiegel, the CIA warned Berlin about a potential attack on gas pipelines in the Baltic Sea \"weeks ago.\"\n\nCiting \"several people familiar with the matter,\" the publication reports that a tip from the US spy agency was \"received in Berlin during the summer.\"\n\nAs we highlighted yesterday, Germany's initial response to the incident was that it was likely to be a \"targeted attack\" carried out by either Russia or Ukraine.\n\nGerman investigators concluded that attack had to be deliberate because it would have been carried out by special forces, navy divers or a submarine which were able to reach the bottom of the sea and place mines or explosives.\n\nAlthough not ruling out that the attack could have been a Russian \"false flag,\" the only perceived motive would have been to \"blame other parties for the incident,\" Der Spiegel reported, while acknowledging that a \"permanent interruption of gas supplies from Russia\" would be in Ukraine's interest.\"\n\nUkraine has inevitably blamed Russia, although why Moscow would sabotage two pipelines that weren't even transporting gas to Europe remains a mystery.\n\nOthers have suggested the U.S. is to blame, including former Polish Defense Minister, Radek Sikorski, who appeared to thanks Washington for carrying out the attack in a tweet.\n\nAs Chris Menahan explains, Sikorski is married to arch-neocon Anne Applebaum and attended the Bilderberg meeting earlier this year, meaning he is very much part of the global elite.\n\n\"If the CIA bombed these civilian pipelines that's an insane act of war that will further devastate Europe's economy and risk a full-blown war with Russia,\" he writes.\n\nHowever, Poland's Secretary of State, Stanislaw Zaryn, accused Sikorki of amplifying \"Russian propaganda.\"\n\n\"Authenticating the Russian lies at this particular moment jeopardizes the security of Poland. What an act of gross irresponsibility!\" wrote Zaryn.\n\nOthers have pointed to Joe Biden's promise that he would \"bring an end to\" Nord Stream 2 if Russia attacked Ukraine.\n\nUndersecretary of State for Political Affairs Victoria Nuland also previously insisted, \"If Russia invades Ukraine, one way or another, Nord Stream 2 will not move forward.\"\n\nDenmark became the latest country to announce that it had detected seismic blasts immediately before the leak, adding it believed \"deliberate actions\" by unknown perpetrators were responsible.\n\n\"It is the authorities' clear assessment that these are deliberate actions -- not accidents,\" Danish Prime Minister Mette Frederiksen said.\n\nIn the age of mass Silicon Valley censorship It is crucial that we stay in touch.\n\nGet early access, exclusive content and behind the scenes stuff by following me on Locals.", "source": {"uri": "europe.infowars.com", "dataType": "news", "title": "Infowars Europe"}, "authors": [{"uri": "paul_joseph_watson@europe.infowars.com", "name": "Paul Joseph Watson", "type": "author", "isAgency": false}], "image": "https://europe.infowars.com/content/images/2022/09/280922pipeline1.jpg", "eventUri": "eng-8059177", "sentiment": -0.3568627450980392, "wgt": 151, "relevance": 1, "stanza_neg": 4, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7208631698", "lang": "eng", "isDuplicate": false, "date": "2022-10-01", "time": "04:55:00", "dateTime": "2022-10-01T04:55:00Z", "dateTimePub": "2022-10-01T04:24:00Z", "dataType": "news", "sim": 0.5490196347236633, "url": "https://therussophile.org/should-europeans-thank-the-americans-for-destroying-nord-stream-by-robert-bridge.html/", "title": "Should Europeans 'Thank' the Americans for Destroying Nord Stream? By Robert Bridge - Russia News Now", "body": "The Europeans aren't getting anything but misery for going along with the American war in Ukraine. From Robert Bridge at strategic-culture.org:\n\nEurope should have heeded the advice of Henry Kissinger: \"To be an enemy of the U.S. is dangerous, but to be a friend is fatal.\"\n\nWith an investigation continuing into the destruction of the Nord Stream gas pipeline that provided energy supplies to Europe from Russia, there appears to be just one prime suspect, and that should surprise nobody.\n\nFollowing the sabotage of the Nord Stream 1 and 2 gas pipelines, former Polish Foreign Minister Radoslaw Sikorski already seemed to know the identity of the perpetrator when he tweeted out: \"Thank you, USA.\"\n\nAt first glance, it seemed that Sikorski was speaking sarcastically, berating Washington for carrying out an attack that will have severe repercussions for the people of Europe. After all, how could anyone see any good coming from the termination of Europe's primary source of gas reserves with winter just around the corner? It was Sikorski's homeland of Poland, after all, that urged its citizens to collect firewood in the face of dwindling gas reserves.\n\nIn fact, the Polish diplomat was speaking one-hundred percent literally, thanking the United States for plunging the continent deeper into the abyss. This has been the attitude of European leaders from the start of Russia's special military operation in Ukraine: 'we will accept our self-destruction as scripted by Washington policymakers so long as the baddies in Moscow hears our virtue-signaling whimpers and screams.' European capitals are about to learn the hard way that virtue signaling does not put food on the table or heat homes.\n\nJudging by the rising temperature in Europe, however, last seen in Italy where a far-right leader has come to power on the wave of voters fed up with high electricity bills and loose immigration, the phrase 'Thank you, USA' may eventually be chiseled into Europe's tombstone.\n\nBut first, the big question: was the United States really responsible for the destruction of Nord Stream, as Sikorski seems to believe? Well, if we were are to take bumbling Joe Biden at his word, then the answer would seem to be yes.\n\n\"If Russia invades, that means tanks or troops crossing the border of Ukraine, again, then there will be -- there will be no longer a Nord Stream 2,\" the U.S. leader told reporters two weeks before Russia began its Ukrainian mission. \"We will bring an end to it.\"\n\nWhen asked to specify, Biden responded, \"I promise you, we'll be able to do it.\"\n\nThere are other clues that point to American complicity.\n\nOn September 2, an American helicopter with the call sign FFAB123 was observed maneuvering in the area of the Nord Stream pipelines. According to the site ads-b.nl, six aircraft used this call sign that day, of which the tail numbers of three were established. All of them were Sikorsky MH-60S. By overlaying the FFAB123 route on the scheme marking the areas of the explosions, it is observable that the helicopter either flew along the Nord Stream-2 route, or exactly between the points where the 'accident' occurred.\n\nMeanwhile, on Twitter, there are screenshots of other American aircraft flights as of September 13th in exactly the same area. In June there was an article in Sea Power magazine where the Americans boast of experiments in the field of underwater drones that they set up at the BALTOPS 22 exercises - in the area of Bornholm Island, the Danish island where the explosions were reported to have occurred.\n\n\"Experimentation was conducted off the coast of Bornholm, Denmark, with participants from Naval Information Warfare Center Pacific, Naval Undersea Warfare Center Newport, and Mine Warfare Readiness and Effectiveness Measuring all under the direction of U.S. 6th Fleet Task Force 68,\" Sea Power reports.\n\nSuch an \"experiment\" would have required the deep-sea equipment needed for reaching the depths where the Nord Stream pipelines are located.\n\nFinally, here's one last tantalizing piece of information for all of the 'coincidence theorists' out there. On the day after Nord Stream 1 and 2 went offline, Poland, Norway and Denmark's leaders attended the opening ceremony of the new Baltic Pipe, which will transport natural gas from Norway via Denmark and through the Baltic Sea to, yes, Sikorski's ferociously Russophobic homeland of Poland. Yes, just a coincidence.\n\nHowever, the main motivating factor for Washington having a hand in destroying Nord Stream is the awesome powers - both financial and political - that it will reap. The economic crisis in Europe is already forcing companies and corporations to consider relocating to the U.S., which is providing a better business environment and more or less affordable electricity bills.\n\nAnd after the destruction of Nord Stream, the economic situation on the continent will deteriorate significantly. Even though the NS-II was not launched, there was the chance of its launch, and this \"chance\" had a considerable effect on the market. Now, without its main energy supplier, Europe is doomed while America will soar.\n\nThe economic destruction of Europe makes it totally dependent on the U.S. economically, politically, and militarily, turning it into a toothless tiger with no political will and independence. At the same time, Europe will become almost completely dependent on the U.S. for its (prohibitive) gas. The United States plans to supply at least 15 billion cubic metres (bcm) of liquefied natural gas (LNG) to European Union markets this year as Europe seeks to wean itself off Russian gas supplies.\n\nIn other words, the transformation of the EU into a banana republic - albeit it one in the northern hemisphere with winter quickly approaching - has already begun.\n\nEurope, you really should have heeded the advice of Henry Kissinger, who understands the nature of the U.S. better than anyone: \"To be an enemy of the U.S. is dangerous, but to be a friend is fatal.\"", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2018/08/Straight-Line-Logic.jpg?fit=984%2C507&ssl=1", "eventUri": "eng-8059177", "sentiment": -0.1058823529411764, "wgt": 140, "relevance": 1, "stanza_neg": 8, "stanza_neu": 28, "stanza_pos": 3, "swn_neg": 39, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7208166231", "lang": "eng", "isDuplicate": false, "date": "2022-09-30", "time": "16:55:00", "dateTime": "2022-09-30T16:55:00Z", "dateTimePub": "2022-09-30T16:54:00Z", "dataType": "news", "sim": 0.5137255191802979, "url": "https://thehill.com/policy/international/3668946-pipeline-sabotage-is-mystery-but-putin-russia-are-prime-suspects/", "title": "Pipeline sabotage is mystery, but Putin, Russia are prime suspects", "body": "Russia is the prime suspect in the apparent sabotage of pipelines transporting natural gas to Europe, which has left foul methane gas spewing into the Baltic Sea.\n\nExperts say damage to the Nord Stream 1 and 2 gas pipelines is a cynical use of a \"gray-zone\" aggression that leaves few good options for retribution.\n\n\"We have war-gamed this for years, we've always been a bit afraid that this is something that the Russians could do if they wanted to,\" said Jim Townsend, who served as deputy assistant secretary of defense for Europe and NATO during the Obama administration.\n\n\"I think all of us have got to know that Putin has other cards that he can play besides conventional or nuclear, he's got something in between - this critical infrastructure, that can be a target.\"\n\nNational Security Advisor Jake Sullivan spoke with NATO Secretary-General Jens Stoltenberg on Friday about protecting critical infrastructure in the wake of the \"apparent sabotage\" of the pipelines.\n\nExplosions on the pipeline, which was not in use, released the trapped gas, first discovered in Danish waters early Monday.\n\nTop European and NATO officials are bluntly assigning sabotage, even as they stop short of directly blaming Putin ahead of an investigation.\n\n\"The sabotage of the Nordstream pipelines is of deep concern. NATO is committed to deter and defend against hybrid attacks,\" Stoltenberg earlier tweeted.\n\n\"Any deliberate attack against Allies' critical infrastructure would be met with a united and determined response.\"\n\nRussia has worked to cast blame on the U.S. by circulating out-of-context clips of President Biden lambasting the Nord Stream pipelines -- which were opposed by the Obama and Trump administrations. Moscow held up a since-deleted tweet from a Polish politician, Radek Sikorski, that appeared to sarcastically thank the U.S. over the pipeline attack.\n\nSikorski, a former Polish minister of defense and foreign affairs, is a well-known, outspoken Kremlin-critic who for years has railed against European politicians that pursued construction of the Nord Stream 2 pipeline from Russia to Germany. He traveled to Washington to urge former President Trump to impose sanctions to halt the pipeline's construction.\n\n\"I was surprised, of all people, that Radek Sikorski was to hint it was the U.S.,\" Townsend said. \"I think he could have been trying to be clever and he came across as being stupid.\"\n\nSikorski could not be reached for comment by The Hill.\n\nElizabeth Braw, a senior fellow at the American Enterprise Institute, called Sikorski's tweet - which he later deleted - \"extremely foolish.\"\n\n\"He clearly meant to be sarcastic or ironic, but that completely misfired and has fed Russian propaganda and conspiracy theories,\" she said.\n\n\"In a situation like this, even more than in previous months and years, citizens have to be extremely careful about what they share on social media, they have to try and verify,\"Braw continued.\n\n\"Because that gives the Russians the upper hand in this sort of influence game, and they manage to steer attention away on things they have done, and cast doubt on America, or whoever their target happens to be.\"\n\nA Russian request to hold an urgent Security Council meeting to determine the culprit behind the pipeline attacks was rejected by the French, who hold the presidency of the United Nations Security Council for the month of September.\n\n\"French Presidency of the Security Council did not find an opportunity to accommodate our urgent request for convening today a UNSC meeting regarding subversive activities at the NordStream pipeline,\" Russia's mission to the U.N. tweeted. \"We are truly disappointed by this decision.\"\n\nWestern nations on Friday focused on their rejection of Putin's move to annex four regions of Ukraine despite Moscow holding a tenuous military occupation on only some of the territory.\n\nEurope and the U.S. are unlikely to take any action against Russia related to the pipeline sabotage absent the conclusion of an investigation.\n\n\"They're going to be doing a forensic investigation, presumably, trying to ascertain what caused\" the damage to the pipelines, said Scott Savitz, senior engineer at the RAND Corporation.\n\nThe time needed to carry out the investigation depends on sea conditions and the human and machine resources needed and available to collect what Savitz said should be \"incontrovertible\" evidence.\n\n\"This is substantial, [the explosions] occurred in multiple locations which will make it that much harder. Divers and specialized gear will need to be addressing multiple problems at once,\" he said.\n\nSavitz, who based his analysis on media reports, said the attack on the pipeline appeared to be \"relatively straight forward,\" with explosives somehow placed near the pipe - an action that could be as simple as pushing mines off a ship or enlisting human divers or an uncrewed undersea vehicle.\n\n\"These are heavily trafficked waters in which a ship, pushing a heavy object, or multiple, over the side would not be terribly difficult and all it would need to have is a simple setting in that it detonates after a certain time period. That's trivially easy. That's technology from a century ago if not more,\" he said.\n\n\"Conceivably based on the evidence we've seen thus far, it's not 100 percent the case that it was Russia, but it looks very probable.\"\n\nIf Russia is determined to be behind the attack, the problem for the international community is how to respond.\n\n\"I don't think we're wading into Article V territory,\" Braw said, referring to NATO treaty text that provides for collective defense, that an attack on one member is an attack on all.\n\n\"It will have to be more sanctions, even though we are running short of entities and people to sanction. That is the one area where we can do something without escalating and risking a situation where then Russia would escalate back, and that would be extremely dangerous.\"\n\nTownsend, who is also an adjunct senior fellow with the Center for a New American Security, said NATO should at least send some of its naval units as a show of support to the Danes.\n\n\"They're not big battle ships. That might be, at least initially what NATO might do, just to tell the Danes and others in the Baltic that NATO is there, NATO knows this is happening.\"\n\nTownsend added that the episode is a stark reminder that while Russia is hemorrhaging its military, economic and human resources in Ukraine, it retains the ability to keep its global adversaries in the crosshairs.\n\n\"We cannot just say, 'well we don't have to worry about Russia, they are just incompetent,'\" he said.\n\n\"Well, things haven't gone very well for them but I wouldn't call it incompetent, I'd call it evil geniuses. And what will we see next? We've got to be aware of that and be ready to deal with it.\"", "source": {"uri": "thehill.com", "dataType": "news", "title": "The Hill"}, "authors": [], "image": "https://thehill.com/wp-content/uploads/sites/2/2022/09/95d0a27276144a65a9c8a0d158ce9cda.jpg?w=1280", "eventUri": "eng-8059177", "sentiment": -0.3176470588235294, "wgt": 131, "relevance": 1, "stanza_neg": 16, "stanza_neu": 30, "stanza_pos": 1, "swn_neg": 47, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7208245776", "lang": "eng", "isDuplicate": false, "date": "2022-09-30", "time": "18:16:00", "dateTime": "2022-09-30T18:16:00Z", "dateTimePub": "2022-09-30T18:15:00Z", "dataType": "news", "sim": 0.4941176474094391, "url": "https://www.naturalnews.com/2022-09-30-nord-stream-attack-updates.html", "title": "Nord Stream attack updates", "body": "(Natural News) Rados?aw Sikorski, MEP, former Polish defence minister and husband of well-connected neoconservative intellectual Anne Appelbaum, has publicly thanked the United States for attacking the Nord Stream pipelines.\n\n(Article republished from Eugyppius.com)\n\nJim Geraghty, senior political correspondent for the American political journal National Review, has also praised the attacks in a brief column under the headline \"Who Will Rid Me of This Meddlesome Pipeline?\" He's been arguing about the importance of taking Nord Stream 2 offline since February, and suggests that the present attacks reflect his influence.\n\nThe biggest detail to break since I went to sleep yesterday, is this claim made by an anonymous intelligence source to Der Spiegel, that the CIA had warned Germany of Baltic pipeline attacks over the summer:\n\nThe United States warned the German government weeks ago of possible attacks on gas pipelines in the Baltic Sea. According to information from SPIEGEL, a corresponding tip from the US intelligence service CIA was received in Berlin in the summer.\n\nSeveral persons familiar with the matter confirmed this. ...\n\nEven before the invasion of Ukraine, Nato partners had repeatedly pointed to suspicious activities of Russian ships over nodes of the underwater networks.\n\nHowever, an initial analysis of satellite images from the area of the incidents showed only inconspicuous ship traffic at first glance, security circles said.\n\nThe Tagesspiegel has a longer piece today trying to come up with a plausible motive for Russia. They imagine that a Russian attack might have had the purpose of allowing Gazprom to escape contractual requirements to deliver gas through Nord Stream 1, thus driving European energy prices higher. Alternatively, they propose it might've been a ruse to circumvent sanctions for the repair of the pipeline. To even retype these theses is to reveal their infirmity.\n\nThe damage is expected to be extensive, and the gas will probably continue to vent for up to two weeks. The company that operates Nord Stream 1 has not ruled out a repair attempt. Nord Stream 2 AG spokesman Ulrich Lissek told NDR that images of the venting gas suggest that \"the structural integrity of the pipeline must be massively damaged.\"\n\nMeanwhile, the German and EU officials have promised to get to the bottom of this and threatened the saboteur with sanctions.\n\nFor more, see the updates to yesterday's post.\n\nUPDATE: One speculative point I'm been thinking about, is it looks like the attacks were partially botched. According to all reports, one of the Nord Stream 2 pipes has not been ruptured, and about 17 hours passed between the first and second explosions. Ideally they would've cut all four pipes simultaneously, no?", "source": {"uri": "naturalnews.com", "dataType": "news", "title": "NaturalNews.com"}, "authors": [], "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/09/nordstream-gas-leak.jpg", "eventUri": "eng-8059177", "sentiment": 0.01960784313725483, "wgt": 126, "relevance": 1, "stanza_neg": 11, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]