[{"uri": "7222203115", "lang": "eng", "isDuplicate": false, "date": "2022-10-12", "time": "13:25:00", "dateTime": "2022-10-12T13:25:00Z", "dateTimePub": "2022-10-12T13:21:00Z", "dataType": "news", "sim": 0.9098039269447327, "url": "https://www.globalresearch.ca/exposed-before-ukraine-blew-up-kerch-bridge-british-spies-plotted-it/5796092", "title": "Exposed: Before Ukraine Blew Up Kerch Bridge, British Spies Plotted It - Global Research", "body": "All Global Research articles can be read in 51 languages by activating the Translate This Article button below the author's name.\n\nTo receive Global Research's Daily Newsletter (selected articles), click here.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\n***\n\nThe secret British intelligence plot to blow up Crimea's Kerch Bridge is revealed in internal documents and correspondence obtained exclusively by The Grayzone.\n\nThe Grayzone has obtained an April 2022 presentation drawn up for senior British intelligence officers hashing out an elaborate scheme to blow up Crimea's Kerch Bridge with the involvement of specially trained Ukrainian soldiers. Almost six months after the plan was circulated, Kerch Bridge was attacked in an October 8th suicide bombing apparently overseen by Ukraine's SBU intelligence services.\n\nDetailed proposals for providing \"audacious\" support to Kiev's \"maritime raiding operations\" were drafted at the request of Chris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor. The wide-ranging plan's core component was \"destruction of the bridge over the Kerch Strait.\"\n\nDocuments and correspondence plotting the operation were provided to The Grayzone by an anonymous source.\n\nThe truck bombing of the Kerch Bridge differed operationally from the plot sketched therein. Yet, Britain's evident interest in planning such an attack underscores the deep involvement of NATO powers in the Ukraine proxy war. At almost precisely the time that London reportedly sabotaged peace talks between Kiev and Moscow in April this year, British military intelligence operatives were drawing up blueprints to destroy a major Russian bridge crossed by thousands of civilians per day.\n\nThe roadmap was produced by Hugh Ward, a British military veteran. A number of strategies for helping Ukraine \"pose a threat to Russian naval forces\" in the Black Sea are outlined. The overriding objectives are stated as aiming to \"degrade\" Russia's ability to blockade Kiev, \"erode\" Moscow's \"warfighting capability\", and isolate Russian land and maritime forces in Crimea by \"denying resupply by sea and overland via Kerch bridge.\"\n\nIn an email, Ward asked Donnelly to \"please protect this document,\" and it's easy to see why. Of these assorted plans, only the \"Kerch Bridge Raid CONOPS [concept of operation]\" is subject to a dedicated annex at the conclusion of Ward's report, underlining its significance.\n\nThe content amounts to direct, detailed advocacy for the commission of what could constitute a grave war crime. Markedly, in plotting ways to destroy a major passenger bridge, there is no reference to avoiding civilian casualties.\n\nAcross three separate pages, alongside diagrams, the author spells out the terms of the \"mission\" - \"[disabling] the Kerch Bridge in a way that is audacious, disrupts road and rail access to Crimea and maritime access to the Sea of Azov.\"\n\nWard suggests that destroying the bridge \"would require a cruise missile battery to hit the two concrete pillars either side of the central steel arch, which will cause a complete structural failure,\" and \"prevent any road re-supply from the Russian mainland to Crimea and temporally [sic] disrupt the shipping lane.\"\n\nAn alternative \"scheme\" entails a \"team of attack divers or UUVs [unmanned underwater vehicles] equipped with limpet mines and linear cutting charges\" targeting a \"key weakness\" and \"design flaw\" in the bridge's pillars.\n\nThis \"flaw\" is \"several thin pylons used to support the main span,\" which were intended to allow strong currents to flow underneath the Bridge with minimal friction. Ward pinpoints a particular area in which the depth of water around a set of pillars was just 10 meters, making it the \"weakest part\" of the structure.\n\nIn related emails obtained by The Grayzone, Chris Donnelly, the senior British army intelligence operative and former NATO advisor, declared the proposals to be \"very impressive indeed.\"\n\nReached by phone, Hugh Ward did not deny that he had prepared the Kerch Bridge destruction blueprint for Chris Donnelly.\n\n\"I'm going to have a chat with Chris [Donnelly] and confirm with him what he's prepared for me to release,\" Ward told The Grayzone, when asked directly if he drafted the \"audacious\" plan.\n\nAsked again to confirm his role in the blueprint, Ward paused, then said: \"I can not confirm that. I'll have a chat with Chris first.\"\n\nA suicide attack on a $4 billion transportation artery\n\nAt dawn on October 8th, an incendiary attack damaged the Kerch Bridge. A truck exploded, setting two oil tankers ablaze, causing two Crimea-bound spans of the roadway to collapse into the sea below, and killing three.\n\nWhile the affected section was quickly repaired and traffic resumed the next day, Western media has celebrated the incident as the latest Russian embarrassment and failure in the conflict with Ukraine. In some cases, journalists openly cheered and joked about what could plausibly be categorized as a war crime that claimed civilian lives.\n\nThe suicide strike targeted a connecting structure between Crimea and mainland Russia constructed at a cost of $4 billion, and whose opening provided a major public relations victory for the Kremlin, reinforcing Moscow's renewed control of the majority Russian-speaking territory.\n\nUpon its unveiling in May 2018, Russian President Vladimir Putin remarked:\n\n\"In different historical epochs, even under the tsar priests, people dreamed of building this bridge. Then they returned to this in the 1930s, the 40s, the 50s. And finally, thanks to your work and your talent, the miracle has happened.\"\n\nThe Bridge has been heavily defended since February 24th, not least because it serves as a major transport route for military equipment to Russian soldiers in Ukraine. Russia has previously promised major reprisals in response to any strike on the structure.\n\nFollowing the attack, widespread euphoria erupted among Ukrainians, Ukrainian authorities, and Ukraine supporters on social media. Oleksiy Danilov, head of Ukraine's national security and defense council, posted a video of the burning bridge alongside a black-and-white clip of Marilyn Monroe singing Happy Birthday, Mr. President -- a reference to Putin turning 70 the same day.\n\nFurthermore, Ukrainian media has reported via an anonymous source \"in law enforcement agencies\" that the attack was carried out by the Security Service of Ukraine. Yet, high-ranking Ukrainian officials, including chief presidential adviser Mykhailo Podolyak, are now backtracking, claiming instead that the incident was a Russian false flag.\n\nSuch allegations have become commonplace in the wake of incidents in which Ukrainian - or Western - culpability seems likely or indeed certain, such as the Nord Stream pipeline explosions.\n\nLaying the foundations of World War III\n\nWhile the attack on Kerch Bridge did not involve specialist divers, underwater drones or cruise missiles, there are indications that Ward's plans were shared with the Ukrainian government at the highest levels. In fact, Chris Donnelly forwarded them to former Lithuanian Minister of Defense Audrius Butkevičius, before introducing the pair by email.\n\nA leading figure in Lithuania's anti-Communist movement, Butkevičius has admitted to deliberately leading pro-independence fighters into Soviet snipers' line of fire on January 13th 1991. This incident is sometimes referred to as Vilnius' \"Bloody Sunday,\" and is officially observed as the Day of the Defenders of Freedom. Butkevičius and his confederates knew the maneuver would provoke mass casualties, further inflaming the local population against Soviet leadership and encourage regime change, which is why they orchestrated it.\n\nMore recently, Butkevičius co-owned Bulcommerce KS, a company that servedas \"the main intermediary in the supply of Bulgarian weapons and ammunition to Ukraine through third countries,\" for use in the civil war in Donbas.\n\nButkevičius has been credibly accused of working for British intelligence. Email exchanges with Donnelly confirm he is in contact with Guy Spindler, a long-time MI6 officer who was posted in London's Moscow Embassy concurrently with the infamous Trump-Russia \"dossier\" author Christopher Steele.\n\nReached by phone and asked if he reviewed the \"Audacious\" plan to destroy Kerch Bridge, Spindler told The Grayzone: \"I have absolutely no idea what you're talking about.\"\n\nContemporary accounts suggest Spindler directly coordinated with Boris Yeltsin at the time of a failed coup against Mikhail Gorbachev in August 1991.\n\nButkevičius was also for many years a \"senior fellow\" at the Institute for Statecraft, a shadowy \"charity\" founded by Donnelly that manages a number of arm's length military and intelligence operations on behalf of the British state and NATO, including the now notorious Foreign Office black propaganda unit, the Integrity Initiative.\n\nLeaked Initiative files name Butkevičius as the organization's key contact in Ukraine at the time of the country's 2019 election. Three years earlier, he was one of the \"escorting personnel\" for five Ukrainian intelligence operatives whisked to London by the Institute for Statecraft in order to brief the British military on Russian \"hybrid warfare\" techniques. Alongside him was Vidmantas Eitutis, who at the time trained Ukraine's army to conduct \"active counterintelligence operations\" in Luhansk.\n\nIn the Kerch Bridge sabotage proposal commissioned by Donnelly, Ward asks whether the Russian military knew how vulnerable the bridge supposedly was, and \"what countermeasures could be expected\" in response to its destruction (see image above).\n\nThe blitz of retaliatory missile strikes on Ukraine on October 10th provides a likely answer. It is also probable that if Ward's outline was followed, Moscow's reprisal would have been even more deadly, putting the lives of countless Ukrainians - and Russians - at significant risk.\n\nDonnelly was clearly unmoved by such concerns, declaring the plans to be \"very impressive indeed.\"\n\nA similar disregard for catastrophic consequences was evident in a private memo authored by Donnelly in March 2014, outlining \"military measures\" that Ukraine should take following Moscow's seizure of Crimea.\n\nStating that, \"if I were in charge I would get the following implemented,\" Donnelly advocated mining Sevastopol harbor using a \"car ferry,\" destroying fighter jets on Crimean airfields \"as a gesture that they are serious,\" using a \"big microwave anti-satellite weapon\" to take down Russian space installations, and turning to the West for oil and gas supplies.\n\n\"I am trying to get this message across,\" he concluded. These prescriptions have yet to be implemented, perhaps because they risk triggering an apocalyptic situation. Indeed, such \"gestures\" would amount to brazen provocations against a nuclear power, from which Ukraine's oil and gas network was and remains exclusively designed to receive energy.\n\nYet it appears Donnelly and those around him would be content to see World War III erupt over Crimea. In fact, as the leaked documents obtained by The Grayzone will continue to demonstrate, provoking conflict between the West and Russia has long-been one of his ultimate objectives.\n\n*\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nKit Klarenberg is an investigative journalist exploring the role of intelligence services in shaping politics and perceptions.\n\nFeatured image is from The Grayzone", "source": {"uri": "globalresearch.ca", "dataType": "news", "title": "Global Research"}, "authors": [], "image": "https://www.globalresearch.ca/wp-content/uploads/2022/10/AUDACIONS-COVER-IMAGE.jpg", "eventUri": "eng-8094546", "sentiment": 0.1058823529411765, "wgt": 232, "relevance": 1, "stanza_neg": 12, "stanza_neu": 67, "stanza_pos": 2, "swn_neg": 81, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221881301", "lang": "eng", "isDuplicate": false, "date": "2022-10-12", "time": "09:07:00", "dateTime": "2022-10-12T09:07:00Z", "dateTimePub": "2022-10-12T09:06:00Z", "dataType": "news", "sim": 0.8705882430076599, "url": "https://mronline.org/2022/10/12/exposed-before-ukraine-blew-up-kerch-bridge-british-spies-plotted-it/", "title": "EXPOSED: Before Ukraine blew up Kerch Bridge, British spies plotted it | MR Online", "body": "The Grayzone has obtained an April 2022 presentation drawn up for senior British intelligence officers hashing out an elaborate scheme to blow up Crimea's Kerch Bridge with the involvement of specially trained Ukrainian soldiers. Almost six months after the plan was circulated, Kerch Bridge was attacked in an October 8th suicide bombing apparently overseen by Ukraine's SBU intelligence services.\n\nDetailed proposals for providing \"audacious\" support to Kiev's \"maritime raiding operations\" were drafted at the request of Chris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor. The wide-ranging plan's core component was \"destruction of the bridge over the Kerch Strait.\"\n\nDocuments and correspondence plotting the operation were provided to The Grayzone by an anonymous source.\n\nThe truck bombing of the Kerch Bridge differed operationally from the plot sketched therein. Yet, Britain's evident interest in planning such an attack underscores the deep involvement of NATO powers in the Ukraine proxy war. At almost precisely the time that London reportedly sabotaged peace talks between Kiev and Moscow in April this year, British military intelligence operatives were drawing up blueprints to destroy a major Russian bridge crossed by thousands of civilians per day.\n\nThe roadmap was produced by Hugh Ward, a British military veteran. A number of strategies for helping Ukraine \"pose a threat to Russian naval forces\" in the Black Sea are outlined. The overriding objectives are stated as aiming to \"degrade\" Russia's ability to blockade Kiev, \"erode\" Moscow's \"warfighting capability\", and isolate Russian land and maritime forces in Crimea by \"denying resupply by sea and overland via Kerch bridge.\"\n\nRead the complete blueprint: Support for Maritime Raiding Operations -- Proposal\n\nIn an email, Ward asked Donnelly to \"please protect this document,\" and it's easy to see why. Of these assorted plans, only the \"Kerch Bridge Raid CONOPS [concept of operation]\" is subject to a dedicated annex at the conclusion of Ward's report, underlining its significance.\n\nThe content amounts to direct, detailed advocacy for the commission of what could constitute a grave war crime. Markedly, in plotting ways to destroy a major passenger bridge, there is no reference to avoiding civilian casualties.\n\nAcross three separate pages, alongside diagrams, the author spells out the terms of the \"mission\" -- \"[disabling] the Kerch Bridge in a way that is audacious, disrupts road and rail access to Crimea and maritime access to the Sea of Azov.\"\n\nWard suggests that destroying the bridge \"would require a cruise missile battery to hit the two concrete pillars either side of the central steel arch, which will cause a complete structural failure,\" and \"prevent any road re-supply from the Russian mainland to Crimea and temporally [sic] disrupt the shipping lane.\"\n\nAn alternative \"scheme\" entails a \"team of attack divers or UUVs [unmanned underwater vehicles] equipped with limpet mines and linear cutting charges\" targeting a \"key weakness\" and \"design flaw\" in the bridge's pillars.\n\nThis \"flaw\" is \"several thin pylons used to support the main span,\" which were intended to allow strong currents to flow underneath the Bridge with minimal friction. Ward pinpoints a particular area in which the depth of water around a set of pillars was just 10 meters, making it the \"weakest part\" of the structure.\n\nIn related emails obtained by The Grayzone, Chris Donnelly, the senior British army intelligence operative and former NATO advisor, declared the proposals to be \"very impressive indeed.\"\n\nReached by phone, Hugh Ward did not deny that he had prepared the Kerch Bridge destruction blueprint for Chris Donnelly.\n\n\"I'm going to have a chat with Chris [Donnelly] and confirm with him what he's prepared for me to release,\" Ward told The Grayzone, when asked directly if he drafted the \"audacious\" plan.\n\nAsked again to confirm his role in the blueprint, Ward paused, then said:\n\nI can not confirm that. I'll have a chat with Chris first.\n\nAt dawn on October 8th, an incendiary attack damaged the Kerch Bridge. A truck exploded, setting two oil tankers ablaze, causing two Crimea-bound spans of the roadway to collapse into the sea below, and killing three.\n\nWhile the affected section was quickly repaired and traffic resumed the next day, Western media has celebrated the incident as the latest Russian embarrassment and failure in the conflict with Ukraine. In some cases, journalists openly cheered and joked about what could plausibly be categorized as a war crime that claimed civilian lives.\n\nThe suicide strike targeted a connecting structure between Crimea and mainland Russia constructed at a cost of $4 billion, and whose opening provided a major public relations victory for the Kremlin, reinforcing Moscow's renewed control of the majority Russian-speaking territory.\n\nUpon its unveiling in May 2018, Russian President Vladimir Putin remarked:\n\n\"In different historical epochs, even under the tsar priests, people dreamed of building this bridge. Then they returned to this in the 1930s, the 40s, the 50s. And finally, thanks to your work and your talent, the miracle has happened.\"\n\nThe Bridge has been heavily defended since February 24th, not least because it serves as a major transport route for military equipment to Russian soldiers in Ukraine. Russia has previously promised major reprisals in response to any strike on the structure.\n\nFollowing the attack, widespread euphoria erupted among Ukrainians, Ukrainian authorities, and Ukraine supporters on social media. Oleksiy Danilov, head of Ukraine's national security and defense council, posted a video of the burning bridge alongside a black-and-white clip of Marilyn Monroe singing Happy Birthday, Mr. President-a reference to Putin turning 70 the same day.\n\nFurthermore, Ukrainian media has reported via an anonymous source \"in law enforcement agencies\" that the attack was carried out by the Security Service of Ukraine. Yet, high-ranking Ukrainian officials, including chief presidential adviser Mykhailo Podolyak, are now backtracking, claiming instead that the incident was a Russian false flag.\n\nSuch allegations have become commonplace in the wake of incidents in which Ukrainian -- or Western -- culpability seems likely or indeed certain, such as the Nord Stream pipeline explosions.\n\nWhile the attack on Kerch Bridge did not involve specialist divers, underwater drones or cruise missiles, there are indications that Ward's plans were shared with the Ukrainian government at the highest levels. In fact, Chris Donnelly forwarded them to former Lithuanian Minister of Defense Audrius Butkevičius, before introducing the pair by email.\n\nA leading figure in Lithuania's anti-Communist movement, Butkevičius has admitted to deliberately leading pro-independence fighters into Soviet snipers' line of fire on January 13th 1991. This incident is sometimes referred to as Vilnius' \"Bloody Sunday,\" and is officially observed as the Day of the Defenders of Freedom. Butkevičius and his confederates knew the maneuver would provoke mass casualties, further inflaming the local population against Soviet leadership and encourage regime change, which is why they orchestrated it.\n\nMore recently, Butkevičius co-owned Bulcommerce KS, a company that served as \"the main intermediary in the supply of Bulgarian weapons and ammunition to Ukraine through third countries,\" for use in the civil war in Donbas.\n\nButkevičius has been credibly accused of working for British intelligence. Email exchanges with Donnelly confirm he is in contact with Guy Spindler, a long-time MI6 officer who was posted in London's Moscow Embassy concurrently with the infamous Trump-Russia \"dossier\" author Christopher Steele.\n\nReached by phone and asked if he reviewed the \"Audacious\" plan to destroy Kerch Bridge, Spindler told The Grayzone:\n\nI have absolutely no idea what you're talking about.\n\nContemporary accounts suggest Spindler directly coordinated with Boris Yeltsin at the time of a failed coup against Mikhail Gorbachev in August 1991.\n\nButkevičius was also for many years a \"senior fellow\" at the Institute for Statecraft, a shadowy \"charity\" founded by Donnelly that manages a number of arm's length military and intelligence operations on behalf of the British state and NATO, including the now notorious Foreign Office black propaganda unit, the Integrity Initiative.\n\nLeaked Initiative files name Butkevičius as the organization's key contact in Ukraine at the time of the country's 2019 election. Three years earlier, he was one of the \"escorting personnel\" for five Ukrainian intelligence operatives whisked to London by the Institute for Statecraft in order to brief the British military on Russian \"hybrid warfare\" techniques. Alongside him was Vidmantas Eitutis, who at the time trained Ukraine's army to conduct \"active counterintelligence operations\" in Luhansk.\n\nIn the Kerch Bridge sabotage proposal commissioned by Donnelly, Ward asks whether the Russian military knew how vulnerable the bridge supposedly was, and \"what countermeasures could be expected\" in response to its destruction (see image above).\n\nThe blitz of retaliatory missile strikes on Ukraine on October 10th provides a likely answer. It is also probable that if Ward's outline was followed, Moscow's reprisal would have been even more deadly, putting the lives of countless Ukrainians -- and Russians -- at significant risk.\n\nDonnelly was clearly unmoved by such concerns, declaring the plans to be \"very impressive indeed.\"\n\nA similar disregard for catastrophic consequences was evident in a private memo authored by Donnelly in March 2014, outlining \"military measures\" that Ukraine should take following Moscow's seizure of Crimea.\n\nStating that, \"if I were in charge I would get the following implemented,\" Donnelly advocated mining Sevastopol harbor using a \"car ferry,\" destroying fighter jets on Crimean airfields \"as a gesture that they are serious,\" using a \"big microwave anti-satellite weapon\" to take down Russian space installations, and turning to the West for oil and gas supplies.\n\n\"I am trying to get this message across,\" he concluded. These prescriptions have yet to be implemented, perhaps because they risk triggering an apocalyptic situation. Indeed, such \"gestures\" would amount to brazen provocations against a nuclear power, from which Ukraine's oil and gas network was and remains exclusively designed to receive energy.\n\nYet it appears Donnelly and those around him would be content to see World War III erupt over Crimea. In fact, as the leaked documents obtained by The Grayzone will continue to demonstrate, provoking conflict between the West and Russia has long-been one of his ultimate objectives.", "source": {"uri": "mronline.org", "dataType": "news", "title": "MR Online"}, "authors": [{"uri": "barbara_ehrenreich@mronline.org", "name": "Barbara Ehrenreich", "type": "author", "isAgency": false}, {"uri": "john_bellamy_foster@mronline.org", "name": "John Bellamy Foster", "type": "author", "isAgency": false}], "image": "https://mronline.org/wp-content/uploads/2022/10/AUDACIONS-COVER-IMAGE-copy.jpg", "eventUri": "eng-8094546", "sentiment": -0.04313725490196074, "wgt": 222, "relevance": 1, "stanza_neg": 10, "stanza_neu": 57, "stanza_pos": 2, "swn_neg": 69, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7220152893", "lang": "eng", "isDuplicate": false, "date": "2022-10-11", "time": "03:33:00", "dateTime": "2022-10-11T03:33:00Z", "dateTimePub": "2022-10-11T02:37:00Z", "dataType": "news", "sim": 0.8470588326454163, "url": "https://therussophile.org/exposed-before-ukraine-blew-up-kerch-bridge-british-spies-plotted-it.html/", "title": "Exposed: Before Ukraine blew up Kerch Bridge, British spies plotted it - Russia News Now", "body": "The secret British intelligence plot to blow up Crimea's Kerch Bridge is revealed in internal documents and correspondence obtained exclusively by The Grayzone.\n\nThe Grayzone has obtained an April 2022 presentation drawn up for senior British intelligence officers hashing out an elaborate scheme to blow up Crimea's Kerch Bridge with the involvement of specially trained Ukrainian soldiers. Almost six months after the plan was circulated, Kerch Bridge was attacked in an October 8th suicide bombing apparently overseen by Ukraine's SBU intelligence services.\n\nDetailed proposals for providing \"audacious\" support to Kiev's \"maritime raiding operations\" were drafted at the request of Chris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor. The wide-ranging plan's core component was \"destruction of the bridge over the Kerch Strait.\"\n\nDocuments and correspondence plotting the operation were provided to The Grayzone by an anonymous source.\n\nThe truck bombing of the Kerch Bridge differed operationally from the plot sketched therein. Yet, Britain's evident interest in planning such an attack underscores the deep involvement of NATO powers in the Ukraine proxy war. At almost precisely the time that London reportedly sabotaged peace talks between Kiev and Moscow in April this year, British military intelligence operatives were drawing up blueprints to destroy a major Russian bridge crossed by thousands of civilians per day.\n\nThe roadmap was produced by Hugh Ward, a British military veteran. A number of strategies for helping Ukraine \"pose a threat to Russian naval forces\" in the Black Sea are outlined. The overriding objectives are stated as aiming to \"degrade\" Russia's ability to blockade Kiev, \"erode\" Moscow's \"warfighting capability\", and isolate Russian land and maritime forces in Crimea by \"denying resupply by sea and overland via Kerch bridge.\"\n\nRead the complete blueprint: Support for Maritime Raiding Operations - Proposal (PDF)\n\nIn an email, Ward asked Donnelly to \"please protect this document,\" and it's easy to see why. Of these assorted plans, only the \"Kerch Bridge Raid CONOPS [concept of operation]\" is subject to a dedicated annex at the conclusion of Ward's report, underlining its significance.\n\nThe content amounts to direct, detailed advocacy for the commission of what could constitute a grave war crime. Markedly, in plotting ways to destroy a major passenger bridge, there is no reference to avoiding civilian casualties.\n\nAcross three separate pages, alongside diagrams, the author spells out the terms of the \"mission\" - \"[disabling] the Kerch Bridge in a way that is audacious, disrupts road and rail access to Crimea and maritime access to the Sea of Azov.\"\n\nWard suggests that destroying the bridge \"would require a cruise missile battery to hit the two concrete pillars either side of the central steel arch, which will cause a complete structural failure,\" and \"prevent any road re-supply from the Russian mainland to Crimea and temporally [sic] disrupt the shipping lane.\"\n\nAn alternative \"scheme\" entails a \"team of attack divers or UUVs [unmanned underwater vehicles] equipped with limpet mines and linear cutting charges\" targeting a \"key weakness\" and \"design flaw\" in the bridge's pillars.\n\nThis \"flaw\" is \"several thin pylons used to support the main span,\" which were intended to allow strong currents to flow underneath the Bridge with minimal friction. Ward pinpoints a particular area in which the depth of water around a set of pillars was just 10 meters, making it the \"weakest part\" of the structure.\n\nIn related emails obtained by The Grayzone, Chris Donnelly, the senior British army intelligence operative and former NATO advisor, declared the proposals to be \"very impressive indeed.\"\n\nReached by phone, Hugh Ward did not deny that he had prepared the Kerch Bridge destruction blueprint for Chris Donnelly.\n\n\"I'm going to have a chat with Chris [Donnelly] and confirm with him what he's prepared for me to release,\" Ward told The Grayzone, when asked directly if he drafted the \"audacious\" plan.\n\nAsked again to confirm his role in the blueprint, Ward paused, then said: \"I can not confirm that. I'll have a chat with Chris first.\"\n\nA suicide attack on a $4 billion transportation artery\n\nAt dawn on October 8th, an incendiary attack damaged the Kerch Bridge. A truck exploded, setting two oil tankers ablaze, causing two Crimea-bound spans of the roadway to collapse into the sea below, and killing three.\n\nWhile the affected section was quickly repaired and traffic resumed the next day, Western media has celebrated the incident as the latest Russian embarrassment and failure in the conflict with Ukraine. In some cases, journalists openly cheered and joked about what could plausibly be categorized as a war crime that claimed civilian lives.\n\nThe suicide strike targeted a connecting structure between Crimea and mainland Russia constructed at a cost of $4 billion, and whose opening provided a major public relations victory for the Kremlin, reinforcing Moscow's renewed control of the majority Russian-speaking territory.\n\nUpon its unveiling in May 2018, Russian President Vladimir Putin remarked:\n\nIn different historical epochs, even under the tsar priests, people dreamed of building this bridge. Then they returned to this in the 1930s, the 40s, the 50s. And finally, thanks to your work and your talent, the miracle has happened.\n\nThe Bridge has been heavily defended since February 24th, not least because it serves as a major transport route for military equipment to Russian soldiers in Ukraine. Russia has previously promised major reprisals in response to any strike on the structure.\n\nFollowing the attack, widespread euphoria erupted among Ukrainians, Ukrainian authorities, and Ukraine supporters on social media. Oleksiy Danilov, head of Ukraine's national security and defense council, posted a video of the burning bridge alongside a black-and-white clip of Marilyn Monroe singing Happy Birthday, Mr. President -- a reference to Putin turning 70 the same day.\n\nFurthermore, Ukrainian media has reported via an anonymous source \"in law enforcement agencies\" that the attack was carried out by the Security Service of Ukraine. Yet, high-ranking Ukrainian officials, including chief presidential adviser Mykhailo Podolyak, are now backtracking, claiming instead that the incident was a Russian false flag.\n\nSuch allegations have become commonplace in the wake of incidents in which Ukrainian - or Western - culpability seems likely or indeed certain, such as the Nord Stream pipeline explosions.\n\nLaying the foundations of World War III\n\nWhile the attack on Kerch Bridge did not involve specialist divers, underwater drones or cruise missiles, there are indications that Ward's plans were shared with the Ukrainian government at the highest levels. In fact, Chris Donnelly forwarded them to former Lithuanian Minister of Defense Audrius Butkevičius, before introducing the pair by email.\n\nA leading figure in Lithuania's anti-Communist movement, Butkevičius has admitted to deliberately leading pro-independence fighters into Soviet snipers' line of fire on January 13th 1991. This incident is sometimes referred to as Vilnius' \"Bloody Sunday,\" and is officially observed as the Day of the Defenders of Freedom. Butkevičius and his confederates knew the maneuver would provoke mass casualties, further inflaming the local population against Soviet leadership and encourage regime change, which is why they orchestrated it.\n\nMore recently, Butkevičius co-owned Bulcommerce KS, a company that served as \"the main intermediary in the supply of Bulgarian weapons and ammunition to Ukraine through third countries,\" for use in the civil war in Donbas.\n\nButkevičius has been credibly accused of working for British intelligence. Email exchanges with Donnelly confirm he is in contact with Guy Spindler, a long-time MI6 officer who was posted in London's Moscow Embassy concurrently with the infamous Trump-Russia \"dossier\" author Christopher Steele.\n\nReached by phone and asked if he reviewed the \"Audacious\" plan to destroy Kerch Bridge, Spindler told The Grayzone: \"I have absolutely no idea what you're talking about.\"\n\nContemporary accounts suggest Spindler directly coordinated with Boris Yeltsin at the time of a failed coup against Mikhail Gorbachev in August 1991.\n\nButkevičius was also for many years a \"senior fellow\" at the Institute for Statecraft, a shadowy \"charity\" founded by Donnelly that manages a number of arm's length military and intelligence operations on behalf of the British state and NATO, including the now notorious Foreign Office black propaganda unit, the Integrity Initiative.\n\nLeaked Initiative files name Butkevičius as the organization's key contact in Ukraine at the time of the country's 2019 election. Three years earlier, he was one of the \"escorting personnel\" for five Ukrainian intelligence operatives whisked to London by the Institute for Statecraft in order to brief the British military on Russian \"hybrid warfare\" techniques. Alongside him was Vidmantas Eitutis, who at the time trained Ukraine's army to conduct \"active counterintelligence operations\" in Luhansk.\n\nIn the Kerch Bridge sabotage proposal commissioned by Donnelly, Ward asks whether the Russian military knew how vulnerable the bridge supposedly was, and \"what countermeasures could be expected\" in response to its destruction (see image above).\n\nThe blitz of retaliatory missile strikes on Ukraine on October 10th provides a likely answer. It is also probable that if Ward's outline was followed, Moscow's reprisal would have been even more deadly, putting the lives of countless Ukrainians - and Russians - at significant risk.\n\nDonnelly was clearly unmoved by such concerns, declaring the plans to be \"very impressive indeed.\"\n\nA similar disregard for catastrophic consequences was evident in a private memo authored by Donnelly in March 2014, outlining \"military measures\" that Ukraine should take following Moscow's seizure of Crimea.\n\nStating that, \"if I were in charge I would get the following implemented,\" Donnelly advocated mining Sevastopol harbor using a \"car ferry,\" destroying fighter jets on Crimean airfields \"as a gesture that they are serious,\" using a \"big microwave anti-satellite weapon\" to take down Russian space installations, and turning to the West for oil and gas supplies.\n\n\"I am trying to get this message across,\" he concluded. These prescriptions have yet to be implemented, perhaps because they risk triggering an apocalyptic situation. Indeed, such \"gestures\" would amount to brazen provocations against a nuclear power, from which Ukraine's oil and gas network was and remains exclusively designed to receive energy.\n\nYet it appears Donnelly and those around him would be content to see World War III erupt over Crimea. In fact, as the leaked documents obtained by The Grayzone will continue to demonstrate, provoking conflict between the West and Russia has long-been one of his ultimate objectives.\n\nfrom https://www.sott.net/article/473016-Exposed-Before-Ukraine-blew-up-Kerch-Bridge-British-spies-plotted-it", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/10/AUDACIONS_COVER_IMAGE.jpg?fit=519%2C301&ssl=1", "eventUri": "eng-8094546", "sentiment": 0.02745098039215677, "wgt": 216, "relevance": 1, "stanza_neg": 11, "stanza_neu": 58, "stanza_pos": 2, "swn_neg": 71, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221167591", "lang": "eng", "isDuplicate": false, "date": "2022-10-11", "time": "18:40:00", "dateTime": "2022-10-11T18:40:00Z", "dateTimePub": "2022-10-11T18:25:00Z", "dataType": "news", "sim": 0.8039215803146362, "url": "https://www.rt.com/news/564495-uk-plotted-crimea-bridge-attack/", "title": "UK intelligence plotted Crimean Bridge bombing - report  --  RT World News", "body": "Attacking the strategically vital Crimean Bridge was clearly not a new idea for Ukraine and its anti-Russia allies. In fact, UK intelligence officials reportedly commissioned a study in April examining ways to blow up the key transportation link across the Kerch Strait.\n\nThe secret plot was drawn up at the request of senior British Army intelligence operative Chris Donnelly, the Grayzone reported on Tuesday, citing internal documents and correspondence that the investigative journalism outlet obtained from an unidentified source. The stated goal was to destroy the bridge to cut off a key Russian supply route, isolate military forces in Crimea and temporarily block maritime access to the Sea of Azov.\n\nThe attack roadmap was titled, 'Audacious: Support for Ukraine Maritime Raiding Operations', and it was produced by UK military veteran Hugh Ward, according to the documents obtained by Grayzone. Donnelly, who's also a veteran NATO advisor, called the plans \"very impressive indeed.\"\n\nWard laid out multiple options for blowing up the $4 billion bridge, including a cruise missile attack targeting concrete pillars on each side of the central steel arch. He also examined using divers or underwater drones to attach limpet mines to pillars at the \"weakest part\" of the structure.\n\nAlthough last week's attack on the bridge was carried out using a truck bomb, rather than the options discussed in the UK analysis, there are indications that British spies had shared their findings with Ukraine's government \"at the highest levels,\" Grayzone said. The outlet obtained an email in which Donnelly forwarded the plans to Lithuanian Defense Minister Audrius Butkevicius.\n\nReached by phone, Ward didn't deny that he prepared the attack plans for Donnelly, Grayzone said. \"I'm going to have a chat with Chris and confirm with him what he's prepared for me to release,\" Ward told the outlet.\n\nAlthough the Crimean Bridge is crossed by thousands of civilians daily, the UK study included no reference to avoiding non-combatant casualties. Saturday's bombing, as it turned out, killed at least four civilians. Russian President Vladimir Putin called the blast a terrorist attack and indicated that Monday's air strikes against infrastructure targets in Kiev and other Ukrainian cities were carried out in response to the bridge incident.\n\nUkrainian media outlets reported that the attack was perpetrated by the Security Service of Ukraine (SBU). Senior officials in Ukraine's government celebrated the bombing and made jokes about it. The SBU posted a photo of the damaged bridge with a note saying, \"The sun is rising, the bridge is burning beautifully.\" Senior presidential aide Mikhail Podoliak posted a Twitter message calling the blast \"just the beginning.\"", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.10/article/6345b20b203027319d207c18.jpg", "eventUri": "eng-8094546", "sentiment": -0.09019607843137256, "wgt": 205, "relevance": 1, "stanza_neg": 5, "stanza_neu": 12, "stanza_pos": 2, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221291651", "lang": "eng", "isDuplicate": false, "date": "2022-10-11", "time": "20:57:00", "dateTime": "2022-10-11T20:57:00Z", "dateTimePub": "2022-10-11T20:22:00Z", "dataType": "news", "sim": 0.800000011920929, "url": "https://therussophile.org/uk-intelligence-plotted-crimean-bridge-bombing.html/", "title": "UK Intelligence Plotted Crimean Bridge Bombing - Russia News Now", "body": "Months ago, British intelligence operatives reportedly studied ways to blow up the strategic bridge that was attacked last week.\n\nAttacking the strategically vital Crimean Bridge was clearly not a new idea for Ukraine and its anti-Russia allies. In fact, UK intelligence officials reportedly commissioned a study in April examining ways to blow up the key transportation link across the Kerch Strait.\n\nThe secret plot was drawn up at the request of senior British Army intelligence operative Chris Donnelly, the Grayzone reported on Tuesday, citing internal documents and correspondence that the investigative journalism outlet obtained from an unidentified source. The stated goal was to destroy the bridge to cut off a key Russian supply route, isolate military forces in Crimea and temporarily block maritime access to the Sea of Azov.\n\nThe attack roadmap was titled, 'Audacious: Support for Ukraine Maritime Raiding Operations', and it was produced by UK military veteran Hugh Ward, according to the documents obtained by Grayzone. Donnelly, who's also a veteran NATO advisor, called the plans \"very impressive indeed.\"\n\nWard laid out multiple options for blowing up the $4 billion bridge, including a cruise missile attack targeting concrete pillars on each side of the central steel arch. He also examined using divers or underwater drones to attach limpet mines to pillars at the \"weakest part\" of the structure.\n\nAlthough last week's attack on the bridge was carried out using a truck bomb, rather than the options discussed in the UK analysis, there are indications that British spies had shared their findings with Ukraine's government \"at the highest levels,\" Grayzone said. The outlet obtained an email in which Donnelly forwarded the plans to Lithuanian Defense Minister Audrius Butkevicius.\n\nReached by phone, Ward didn't deny that he prepared the attack plans for Donnelly, Grayzone said. \"I'm going to have a chat with Chris and confirm with him what he's prepared for me to release,\" Ward told the outlet.\n\nAlthough the Crimean Bridge is crossed by thousands of civilians daily, the UK study included no reference to avoiding non-combatant casualties. Saturday's bombing, as it turned out, killed at least four civilians. Russian President Vladimir Putin called the blast a terrorist attack and indicated that Monday's air strikes against infrastructure targets in Kiev and other Ukrainian cities were carried out in response to the bridge incident.\n\nUkrainian media outlets reported that the attack was perpetrated by the Security Service of Ukraine (SBU). Senior officials in Ukraine's government celebrated the bombing and made jokes about it. The SBU posted a photo of the damaged bridge with a note saying,\n\n\"The sun is rising, the bridge is burning beautifully.\" Senior presidential aide Mikhail Podoliak posted a Twitter message calling the blast \"just the beginning.\"\n\nRT creates news with an edge for viewers who want to Question More. RT covers stories overlooked by the mainstream media, provides alternative perspectives on current affairs, and acquaints international audiences with a Russian viewpoint on major global events.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.\n\nfrom https://therussophile.org/uk-intelligence-plotted-crimean-bridge-bombing.html/", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/10/not-just-for-covid19.png?fit=980%2C146&ssl=1", "eventUri": "eng-8094546", "sentiment": -0.09019607843137256, "wgt": 204, "relevance": 1, "stanza_neg": 7, "stanza_neu": 14, "stanza_pos": 4, "swn_neg": 25, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221788222", "lang": "eng", "isDuplicate": false, "date": "2022-10-12", "time": "07:48:00", "dateTime": "2022-10-12T07:48:00Z", "dateTimePub": "2022-10-12T06:58:00Z", "dataType": "news", "sim": 0.7921568751335144, "url": "https://sana.sy/en/?p=286597", "title": "Before Ukraine blew up Kerch Bridge, British spies plotted it, Grayzone says", "body": "London, SANA- The secret British intelligence plot to blow up Crimea's Kerch Bridge is revealed in internal documents and correspondence obtained exclusively by The Grayzone.\n\nThe Grayzone has obtained an April 2022 presentation drawn up for senior British intelligence officers hashing out an elaborate scheme to blow up Crimea's Kerch Bridge with the involvement of specially trained Ukrainian soldiers.\n\nAlmost six months after the plan was circulated, Kerch Bridge was attacked in an October 8th suicide bombing apparently overseen by Ukraine's SBU intelligence services.\n\nDetailed proposals for providing \"audacious\" support to Kiev's \"maritime raiding operations\" were drafted at the request of Chris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor. The wide-ranging plan's core component was \"destruction of the bridge over the Kerch Strait.\"\n\nDocuments and correspondence plotting the operation were provided to The Grayzone by an anonymous source.\n\nWard suggests that destroying the bridge \"would require a cruise missile battery to hit the two concrete pillars either side of the central steel arch, which will cause a complete structural failure,\" and \"prevent any road re-supply from the Russian mainland to Crimea and temporally disrupt the shipping lane.\"", "source": {"uri": "sana.sy", "dataType": "news", "title": "S A N A"}, "authors": [], "image": "https://sana.sy/en/wp-content/uploads/2022/10/111-2.jpg", "eventUri": "eng-8094546", "sentiment": -0.01960784313725494, "wgt": 202, "relevance": 1, "stanza_neg": 1, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221579509", "lang": "eng", "isDuplicate": false, "date": "2022-10-12", "time": "04:02:00", "dateTime": "2022-10-12T04:02:00Z", "dateTimePub": "2022-10-12T03:37:00Z", "dataType": "news", "sim": 0.6705882549285889, "url": "https://www.dailystar.co.uk/news/world-news/conspiracy-theorists-claim-british-secret-28215256", "title": "Conspiracy theorists claim British intelligence plotted to blow up Crimea bridge", "body": "An alleged plan headed by senior British intelligence officers to blow up Crimea's Kerch Bridge has supposedly been obtained by a news website called The Grayzone.\n\nThe presentation of the alleged scheme was made in April 2022 and almost six months on, Kerch Bridge was attacked on Saturday (October 8) with differing opinions on what caused the explosion which led to the partial collapse of the road along the bridge.\n\nChris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor, allegedly requested proposals for providing \"audacious\" support to Kyiv's \"maritime raiding operations\".\n\nREAD MORE: British spies accused of gifting Chinese and Russian agents secrets with LinkedIn boasts\n\nThe aim of the plan was to cause \"destruction of the bridge over the Kerch Strait\".\n\nAn anonymous source provided the documents and correspondence that plotted the alleged operation to The Grayzone.\n\nAccording to documents, the reasons for the alleged operation included the likes of aiming to \"degrade\" Russia's ability to blockade Kyiv, \"erode\" Moscow's \"warfighting capability\", as well as isolating Russian land in Crimea by \"denying resupply by sea and overland via Kerch bridge\".\n\nChris Donnelly was alleged to have declared the proposals to be \"very impressive indeed\", according to emails obtained by the news website.\n\nTo stay up to date with all the latest news, make sure you sign up to one of our newsletters here .\n\nThe attack on October 8 was initiated by the explosion of a truck that set two oil tankers ablaze, causing two Crimea-bound spans of the roadway to collapse into the sea below as well as killing three people.\n\nThe bridge has been heavily defended since February 24 due to its purpose as serving as an important route for military equipment to be transported to Russian soldiers on the frontlines in Ukraine.\n\nREAD NEXT:\n\nMI5 launches recruitment drive for 'overweight' spies on starting salary of £38k a year\n\nTerrifying ex-KGB spy 'who killed in Britain' set to take over Russia if Putin ousted\n\nPutin's notorious Wagner Group doubles pay to bolster ranks amid Russian losses", "source": {"uri": "dailystar.co.uk", "dataType": "news", "title": "Daily Star"}, "authors": [{"uri": "fasika_zelealem@dailystar.co.uk", "name": "Fasika Zelealem", "type": "author", "isAgency": false}], "image": "https://i2-prod.dailystar.co.uk/incoming/article28215251.ece/ALTERNATES/s1200/0_JS279875644.jpg", "eventUri": "eng-8094546", "sentiment": 0.0980392156862746, "wgt": 171, "relevance": 1, "stanza_neg": 2, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7221218758", "lang": "eng", "isDuplicate": false, "date": "2022-10-11", "time": "19:33:00", "dateTime": "2022-10-11T19:33:00Z", "dateTimePub": "2022-10-11T19:20:00Z", "dataType": "news", "sim": 0.6274510025978088, "url": "https://www.sgtreport.com/2022/10/brit-military-intelligence-planned-to-take-out-kerch-bridge/", "title": "Brit Military Intelligence Planned to Take Out Kerch Bridge", "body": "The Greyzone has documents revealing how British intelligence worked with the neo-Nazi-infested SBU to take out the Kerch Bridge between Russia and Crimea.\n\nThe Grayzone has obtained an April 2022 presentation drawn up for senior British intelligence officers hashing out an elaborate scheme to blow up Crimea's Kerch Bridge with the involvement of specially trained Ukrainian soldiers. Almost six months after the plan was circulated, Kerch Bridge was attacked in an October 8th suicide bombing apparently overseen by Ukraine's SBU intelligence services.\n\nKit Klarenberg writes complex proposals were \"drafted at the request of Chris Donnelly, a senior British Army intelligence operative and veteran high ranking NATO advisor... Documents and correspondence plotting the operation were provided to The Grayzone by an anonymous source.\"\n\nBritish military intelligence, the CIA, NATO, and undoubtedly a number of intelligence and military agencies in Europe, are involved in the planning and possibly execution of military targeting and operations inside the Ukraine.\n\nIn military planning, several scenarios are usually proposed.\n\nThe truck bombing of the Kerch Bridge differed operationally from the plot sketched therein. Yet, Britain's evident interest in planning such an attack underscores the deep involvement of NATO powers in the Ukraine proxy war. At almost precisely the time that London reportedly sabotaged peace talks between Kiev and Moscow in April this year, British military intelligence operatives were drawing up blueprints to destroy a major Russian bridge crossed by thousands of civilians per day.\n\nNot a problem. Direct bombardment of civilians to \"break the will of the aggressor\" is a key component of modern warfare since at least the Second World War and former British Principal Secretary of the Air Ministry, J.M. Spaight's \"Bombing Vindicated,\" a book written in defense of the saturation bombing of civilians, then and now considered participants in war. Never mind the Geneva Convention or internationally accepted (and often violated) rules of war. Humanitarianism is merely a transparent facade, a new phase and different approach to neoliberal wars, the current one to save the dollar-dominated financial system.\n\nBut saturation bombing and incendiary attacks (Tokyo, Dresden), that's old school. The new way to win a war is through terrorism -- the deliberate targeting and destruction of civilians and their life-sustaining infrastructure. This was field tested in Iraq when the water system was intentionally destroyed by the US war machine and a decade of punitive sanctions killed a half million children -- not soldiers and \"bad actors,\" but children.\n\nThis is how war is fought now. Our government targets civilian infrastructure, the same as the Wahhabi terrorists targeting schools teaching girls how to read or random attacks on the streets of London by jihadists. In fact, we can document how the USG organized, funded, and trained the psychopathic religious fanatics who are said to have bombed the US embassies in Nairobi, Kenya, and Dar es Salaam, Tanzania. The FBI points a finger at the suspect of the day -- al Qaeda, the CIA Mujahideen spinoff in Afghanistan where a covert war was waged against the Soviets (the most expensive in CIA history).\n\nA direct assault to take back the Crimea is out of the question. It will be impossible for Ukraine to do this. Crimea is now part of the Russian Federation. If it is attacked, as promised by the green t-shirt leader of a soon-to-be rump state, the Russian government will consider it a direct attack on its country and will respond accordingly.\n\nBut what is not out of the question is a terror war of attrition, the kind of warfare the CIA is quite accomplished at initiating (but has often had problems following through). I ventured a guess a couple of months ago that this would end up as a \"guerrilla war\" plotted by the USG and Brit intelligence, an underground war designed to perpetually terrorize the people of Crimea and undermine the authority of the local government while challenging the Russian Federation.", "source": {"uri": "sgtreport.com", "dataType": "news", "title": "SGT Report"}, "authors": [], "image": null, "eventUri": "eng-8094546", "sentiment": 0.1686274509803922, "wgt": 160, "relevance": 1, "stanza_neg": 2, "stanza_neu": 24, "stanza_pos": 1, "swn_neg": 27, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7222356592", "lang": "eng", "isDuplicate": false, "date": "2022-10-12", "time": "15:26:00", "dateTime": "2022-10-12T15:26:00Z", "dateTimePub": "2022-10-12T15:14:00Z", "dataType": "news", "sim": 0.6274510025978088, "url": "https://english.pravda.ru/news/world/154399-grayzone/", "title": "British intelligence came up with a plan to destroy the Crimean bridge -- Grayzone", "body": "In the spring of this year, British intelligence drew up a plan to destroy the Crimean bridge, the Grayzone portal reports, citing documents provided by an anonymous source.\n\n\"Grayzone received a presentation dated April 2022, compiled for high-ranking British intelligence officials, detailing a plan to blow up the Kerch bridge ... with the participation of specially trained Ukrainian soldiers\", says the publication.\n\nThe plan was drawn up by the military Hugh Ward on behalf of British intelligence and Chris Donnelly, adviser to NATO Secretary General Jens Stoltenberg.\n\nAccording to Ward's plan, the structure could be destroyed by hitting the piers of the bridge's central arch with cruise missiles. Another option was also proposed: with the help of divers or underwater drones, install mines on supports and undermine them.\n\nAccording to the portal, Donelly forwarded Ward's draft to former Lithuanian Defense Minister Audrius Butkevičius', who could have passed it on to Kyiv. Grayzone published Butkevičius's correspondence with Donnelly, from which it follows that the Lithuanian minister owned a company that was involved in the supply of weapons to Ukraine, and also maintained contacts with British intelligence officer Guy Spindler.", "source": {"uri": "english.pravda.ru", "dataType": "news", "title": "PravdaReport"}, "authors": [{"uri": "petr_ernilin@english.pravda.ru", "name": "Petr Ernilin", "type": "author", "isAgency": false}], "image": "https://english.pravda.ru/image/preview/article/3/9/9/154399_five.jpeg", "eventUri": "eng-8094546", "sentiment": 0.1450980392156862, "wgt": 160, "relevance": 1, "stanza_neg": 1, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]