[{"uri": "6999623703", "lang": "eng", "isDuplicate": false, "date": "2022-04-11", "time": "13:15:00", "dateTime": "2022-04-11T13:15:00Z", "dateTimePub": "2022-04-11T13:11:00Z", "dataType": "news", "sim": 0.843137264251709, "url": "https://www.globalresearch.ca/railway-station-bombing-ukrainian-forces-usa-admits-fake-news-ukrainian-bodies-cant-keep-still/5777157", "title": "Railway Station Bombing by Ukrainian Forces. USA Admits Fake News. Ukrainian \"Bodies\" Can't Keep Still - Global Research", "body": "All Global Research articles can be read in 51 languages by activating the \"Translate Website\" drop down menu on the top banner of our home page (Desktop version).\n\nTo receive Global Research's Daily Newsletter (selected articles), click here.\n\nVisit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\n***\n\nIt appears there was a false flag attack by Ukrainian forces on their own people at the railway station in Kramatorsk. While a BBC report shows quite clearly that the missile was a Tochka used only by the Ukrainian side a BBC television report said the missile used \"was of a type used by the Russians\" - the exact opposite of the truth, as their own image showed.\n\nEven President Zelensky confirmed it was a Tochka missile which hit the Kramatorsk railway station killing some 50 people waiting to be evacuated. This BBC report confirms with this image in their report that this was the missile:\n\nIt is quite clear that it is NOT a Russian used Iskander missile - pictured below. Note the Russian used missile has no fins on the bottom end.\n\nThe Russian military said that it had pinpointed the location from which the missile had allegedly been launched.\n\nAccording to defence officials, it came from the town of Dobropole, which is located southwest of Kramatorsk and has been under the control of Ukrainian forces. The Russian forces have almost total control of the airspace and have tracked missiles and ground forces during this war so this tracking report is credible.\n\nThe attack on Kramatorsk also closely resembles another missile strike that killed 17 people in the city of Donetsk in mid-March. (see Freenations post about that missile attack)\n\nThe Russian Ministry of Defence said that the Tochka U missile, is a weapon system that \"only Ukrainian forces use.\"\n\nThe local Donetsk militia, which consider Kramatorsk as part of the Donetsk People's Republic, claimed the missile was a Tochka U of the Ukrainian forces. Its leadership said Ukraine has a long record of deploying the weapon system that neither Russia nor the DPR forces use.\n\nThe following numbered Tochka missiles were used on Donetsk and Luhansk by Ukrainian forces in February and now again in April:\n\nSH91565 strike on Alchevsk LNR, 2nd Feb. 2015 SH91566 -ii- Logvinovo DNR 13th Feb 2015 SH91579 -ii- Kramatorsk railway station 8th April 2022\n\nBelow are the images of the three missiles:\n\nNever has there been a more blatant \"virtual\" war for propaganda purposes with Ukraine employing actors to pose as wounded and dead.\n\nHere Ukrainian \"body bag actors\" just can't keep still for the propaganda shots.\n\n7 examples of fake news are given in this link including the use of images from video games and a Starwars film!\n\nRecently we have had American Governmental and press admitting using totally unverified incidents as propaganda. They refer to them as \"narratives\".\n\nAs Harley Schlanger quotes in this video the \"Russia going to use chemical weapons\" \"China weapons to Russia\", and \"Russia lied to by advisers to cover up losses\" claims were all totally without foundation but were deliberately used as propaganda weapons to win \"the media war\".\n\nThere have been no wars from which either side has escaped accusations of \"war crimes\". The Allies fought a just war against Nazi Germany and fascist Europe between 1939 and 1945 but many accused them of war crimes for disproportionately bombing cities. All soldiers are in danger of vicious responses in the heat of battle but there is a difference between that and conscious cruelty, targeting civilians, torturing or killing prisoners, using civilians as human shields and of course setting up false flag attacks on your own side to pretend the enemy was responsible. All these seem to be features of at least the Ukrainian side of this conflict.\n\nThe trouble with efficient lies and propaganda is that they whip up fanatical hatred and cause war crimes. They also give the Ukrainians in this case the false belief that they are \"winning the war\" and instead of coming to terms at the peace conferences, commit themselves to more bloodshed. There is no more sickening sight as the slaughter continues than Boris Johnson telling President Zelensky not to compromise with Russia. There is nothing more dangerous than believing your own propaganda and applying to the real war the dangerous myths of the virtual propaganda war.\n\n*\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nAll images in this article are from Freenations", "source": {"uri": "globalresearch.ca", "dataType": "news", "title": "Global Research"}, "authors": [], "image": "https://www.globalresearch.ca/wp-content/uploads/2022/04/image-5.png", "eventUri": "eng-7639490", "sentiment": 0.03529411764705892, "wgt": 215, "relevance": 1, "stanza_neg": 12, "stanza_neu": 29, "stanza_pos": 1, "swn_neg": 42, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7001592815", "lang": "eng", "isDuplicate": false, "date": "2022-04-12", "time": "23:07:00", "dateTime": "2022-04-12T23:07:00Z", "dateTimePub": "2022-04-12T22:51:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://therussophile.org/usa-admits-fake-news-railway-station-bombing-by-ukrainian-forces.html/", "title": "USA Admits Fake News: Railway Station Bombing by Ukrainian Forces. - Russia News Now", "body": "All Global Research articles can be read in 51 languages by activating the \"Translate Website\" drop down menu on the top banner of our home page (Desktop version).\n\nTo receive Global Research's Daily Newsletter (selected articles), click here.\n\nIt appears there was a false flag attack by Ukrainian forces on their own people at the railway station in Kramatorsk. While a BBC report shows quite clearly that the missile was a Tochka used only by the Ukrainian side a BBC television report said the missile used \"was of a type used by the Russians\" - the exact opposite of the truth, as their own image showed.\n\nEven President Zelensky confirmed it was a Tochka missile which hit the Kramatorsk railway station killing some 50 people waiting to be evacuated. This BBC report confirms with this image in their report that this was the missile:\n\nIt is quite clear that it is NOT a Russian used Iskander missile - pictured below. Note the Russian used missile has no fins on the bottom end.\n\nThe Russian military said that it had pinpointed the location from which the missile had allegedly been launched.\n\nAccording to defence officials, it came from the town of Dobropole, which is located southwest of Kramatorsk and has been under the control of Ukrainian forces. The Russian forces have almost total control of the airspace and have tracked missiles and ground forces during this war so this tracking report is credible.\n\nThe attack on Kramatorsk also closely resembles another missile strike that killed 17 people in the city of Donetsk in mid-March. (see Freenations post about that missile attack)\n\nThe Russian Ministry of Defence said that the Tochka U missile, is a weapon system that \"only Ukrainian forces use.\"\n\nThe local Donetsk militia, which consider Kramatorsk as part of the Donetsk People's Republic, claimed the missile was a Tochka U of the Ukrainian forces. Its leadership said Ukraine has a long record of deploying the weapon system that neither Russia nor the DPR forces use.\n\nThe following numbered Tochka missiles were used on Donetsk and Luhansk by Ukrainian forces in February and now again in April:\n\nNever has there been a more blatant \"virtual\" war for propaganda purposes. 7 examples of fake news are given in this link including the use of images from video games and a Star Wars film!\n\nRecently we have had American Governmental and press admitting using totally unverified incidents as propaganda. They refer to them as \"narratives\".\n\nAccording to an NBC News article, \"multiple US officials acknowledged that the US has used information as a weapon even when confidence in the accuracy of the information wasn't high. Sometimes it has used low-confidence intelligence for deterrent effect...\". No wonder only 7% of Americans have a high degree of confidence in their mass media: see this.\n\nAs Harley Schlanger quotes in this video the \"Russia going to use chemical weapons\" \"China weapons to Russia\", and \"Russia lied to by advisers to cover up losses\" claims were all totally without foundation but were deliberately used as propaganda weapons to win \"the media war\".\n\nThere have been no wars from which either side has escaped accusations of \"war crimes\". The Allies fought a just war against Nazi Germany and fascist Europe between 1939 and 1945 but many accused them of war crimes for disproportionately bombing cities. All soldiers are in danger of vicious responses in the heat of battle but there is a difference between that and conscious cruelty, targeting civilians, torturing or killing prisoners, using civilians as human shields and of course setting up false flag attacks on your own side to pretend the enemy was responsible. All these seem to be features of at least the Ukrainian side of this conflict.\n\nThe trouble with efficient lies and propaganda is that they whip up fanatical hatred and cause war crimes. They also give the Ukrainians in this case the false belief that they are \"winning the war\" and instead of coming to terms at the peace conferences, commit themselves to more bloodshed. There is no more sickening sight as the slaughter continues than Boris Johnson telling President Zelensky not to compromise with Russia. There is nothing more dangerous than believing your own propaganda and applying to the real war the dangerous myths of the virtual propaganda war.\n\n*\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nAll images in this article are from Freenations\n\nFascist elements in post war Europe and the development of the European Union\n\nBy Rodney Atkinson\n\nWith contributions from William Dorich and Edward Spalton\n\nPublisher: ‎ GM Books; 1st edition (July 25, 2013)\n\nPublication date: ‎ July 25, 2013\n\nPrint length: ‎ 164 pages\n\nClick here to view this and other titles by Rodney Atkinson.\n\nfrom: https://www.globalresearch.ca/railway-station-bombing-ukrainian-forces-usa-admits-fake-news-ukrainian-bodies-cant-keep-still/5777157", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/04/image-5-400x225-1.png?fit=400%2C225&ssl=1", "eventUri": "eng-7639490", "sentiment": -0.09019607843137256, "wgt": 211, "relevance": 1, "stanza_neg": 11, "stanza_neu": 36, "stanza_pos": 1, "swn_neg": 48, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7003670228", "lang": "eng", "isDuplicate": false, "date": "2022-04-14", "time": "11:37:00", "dateTime": "2022-04-14T11:37:00Z", "dateTimePub": "2022-04-14T11:36:00Z", "dataType": "news", "sim": 0.7450980544090271, "url": "https://apokalypsnu.nl/2022/04/14/kramatorsk-missile-attack-russias-slaughter-of-civilians-or-kievs-false-flag/", "title": "Kramatorsk missile attack - Russia's slaughter of civilians or Kiev's false flag?  ", "body": "Kramatorsk missile attack - Russia's slaughter of civilians or Kiev's false flag?\n\nUkraine claims the Russian military is targeting population in Donbass.\n\nDrago Bosnic, independent geopolitical and military analyst\n\nOn 8 April 2022, a \"Tochka-U\" short-range ballistic missile hit the railway station in the city of Kramatorsk. As of 10 April, Ukrainian officials reported that 57 people were killed and 109 wounded as a result of the attack. The Kiev regime claims the attack was conducted by Russia, while Moscow vehemently rejects these claims. The attack happened just as the troops of the Russian ground forces and the People's Militia of Donetsk People's Republic (NM DNR) were making progress in western areas of the Donetsk oblast.\n\nAt first, Ukrainian officials gave contradicting statements. While Kiev's top propagandist Aleksey Arestovich claimed that a Russian ground-based hypersonic quasi-ballistic missile \"Iskander-M\" was used in the attack, other Ukrainian sources confirmed the attack was conducted with the much older Soviet-era short-range ballistic missile known as the \"Tochka-U\". This fact alone immediately made claims by the Ukrainian side much more complicated.\n\nThe \"Tochka-U\" is a Soviet tactical short-range ballistic missile which entered service in 1976. After the dissolution of the Soviet Union, both Ukraine and Russia inherited large numbers of missiles and transporter-erector-launcher (TEL) vehicles. However, by 2006, Russia already started replacing these missiles with the much more capable \"Iskander\" hypersonic quasi-ballistic missiles. By the late 2010s, Russia's inventory was retired, as the last combat units to replace their \"Tochka-U\" missiles did so in 2019. The missile simply did not meet the standards of the Russian military. With a circular error probability (CEP) of 70-150 m, the missile is considered too inaccurate for precision strikes.\n\nThe Ukrainian military, on the other hand, still operates these missiles. Russian air and anti-missile defenses have shot down dozens of \"Tochka-U\" missiles fired by Ukrainian forces. Many of these missiles were armed with cluster munitions warheads. On the morning of March 14, around 11:20 AM local time, the Ukrainian military struck the center of Donetsk with one such \"Tochka-U\" equipped with cluster munitions warhead. At least 27 civilians were killed, with at least another 20 suffering wounds. Naturally, this went largely unreported in Western media, while some outlets even used images of the massacre and claimed it was perpetrated by Russian forces.\n\nCluster munitions are designed to inflict maximum damage to ground forces, specifically infantry, causing death and maiming soldiers. The usage of these weapons, even against soldiers, is considered inhumane. However, using them against civilians cannot be justified in any conceivable way and should automatically be considered a war crime. At the time of the missile strike, there were no large formations of infantry in Donetsk. They were all at the frontlines, so it's safe to say that targeting Donetsk was of no military value. And yet, the Ukrainian military still did it. Worse yet, the strike targeted the center of the city, where there is no military infrastructure or equipment. There can be no other explanation but that civilians were deliberately targeted.\n\nAnother important note which should be taken into account is that the Kiev regime's policies towards the people of eastern and southern Ukraine, particularly towards the people of Donbass, have alienated the inhabitants of the area. Worse yet, many top officials of the post-Maidan regime have called the locals \"subhuman\", going as far as to call for their removal and even extermination. Needless to say, this only implies that seeing the people of Donbass as cannon fodder is a \"natural\" state of affairs for the regime in Kiev. Which brings us back to the main issue of Ukrainian claims that Russia targeted civilians in Kramatorsk.\n\nAs we have already noted, the missile strike on the Kramatorsk train station was conducted in the same manner as the one which targeted the Donetsk city center. Cluster munitions warhead was used, just as in Donetsk nearly a month prior. With Russia retiring its last stockpile of \"Tochka-U\" missiles years ago, the question remains, who else could've fired the missile? The Ukrainian side is claiming that Russia reinstated the missile in February of this year. Western media are making the same argument, claiming that \"independent open-source\" media have reportedly seen the missiles in Belarus. The issue with this is that Belarus is some 900 km away from the area. \"Tochka-U\" has a maximum firing range of around 150-180 km. Also, the military of Belarus officially still uses these missiles, so seeing them there is hardly evidence that they've been reinstated in Russian service.\n\nIn addition to these facts, the Russian Ministry of Defense stated they have determined that the missile was fired from the area of Dobropolye, which is located approximately 45 km to the southwest of Kramatorsk. The area is under the control of the Ukrainian military. The Russian MoD has also determined the unit which operates in the area - the 19th missile brigade of the Ukrainian Armed Forces, the same one which has already fired numerous \"Tochka-U\" missiles at Donetsk in the last 8 years.\n\nAnother important note also has to do with the missile's serial number. The discarded rocket boosters of these missiles have the serial numbers written on the side, clearly showing the batch they belonged to. The missile used in the attack on Kramatorsk had the serial number which suggests it came from the same batch used in one of the previous missile strikes against Donetsk, perpetrated by the Ukrainian military.\n\nFor the Russian military to be able to conduct this strike, they would've had to infiltrate the Ukrainian 19th missile brigade located in the area of the Dobropolye, take the Ukrainian missile (so it would have the Ukrainian serial number), place it on one of their 9P129 TEL trucks (which they don't use anymore) and then fire it into a crowd of Russian-speaking Ukrainian citizens in Kramatorsk. If this makes any sense, then maybe the Russians did target the civilians at Kramatorsk. At least that's what the Ukrainian side is claiming, supported by the Western media and government officials. The same media and government officials which claimed that Saddam Hussein had biological and chemical weapons.", "source": {"uri": "apokalypsnu.nl", "dataType": "news", "title": "Apokalyps Nu!"}, "authors": [], "image": "https://apokalypsnu.nl/wp-content/uploads/2022/04/A-Kramatorsk.jpg", "eventUri": "eng-7639490", "sentiment": -0.3333333333333334, "wgt": 190, "relevance": 1, "stanza_neg": 25, "stanza_neu": 27, "stanza_pos": 0, "swn_neg": 52, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7004105520", "lang": "eng", "isDuplicate": false, "date": "2022-04-14", "time": "17:47:00", "dateTime": "2022-04-14T17:47:00Z", "dateTimePub": "2022-04-14T17:07:00Z", "dataType": "news", "sim": 0.7137255072593689, "url": "https://www.bellingcat.com/news/2022/04/14/russias-kramatorsk-facts-versus-the-evidence/", "title": "Russia's Kramatorsk 'Facts' Versus the Evidence - bellingcat", "body": "On April 8, 2022, a Tochka-U short-range ballistic missile struck the main railway station in Kramatorsk in the Donetsk region of government-controlled Ukraine. The missile killed at least 50 people, including five children. Civilians had gathered at the station to flee the approaching Russian offensive, which has pivoted to the country's east in recent weeks.\n\nA recent BBC report stated it had found \"clear evidence\" that the missile which struck the station had a cluster munitions warhead.\n\nRussian officials have blamed the strike on Ukraine, citing claims that the Russian military does not use the Tochka-U. Pro-Russian media cited other assertions relating to the missile's serial number, and a hypothesised flight path of the missile.\n\nBellingcat, and others in the open source community, have cross-referenced these claims with publicly available footage in an attempt to establish the origin of the Tochka-U missile that took dozens of lives at the Kramatorsk railway station on April 8.\n\nAt the time of writing, the available open source evidence remains insufficient to reveal all details about the strike, including the direction of origin of the missile. However, it does appear to debunk a central argument by the Russian state in its defence: that its military does not operate the Tochka-U missile system.\n\nSocial media images and videos as well as Russian news reports from 2021 show the country's forces displaying Tochka-U launchers, while satellite imagery from February 2022 seems to depict military vehicles consistent with the appearance and dimensions of the launchers at a base in south-western Russia. Experts Bellingcat spoke to also said that even though Russia has reportedly phased out the Tochka-U missile in recent years, that doesn't render Russia's stock of the weapons inoperable or mean they cannot still be deployed. Amnesty International, meanwhile, stated that a Tochka-U missile was used by Russia in Donetsk on 24 February 2022.\n\nOn April 7, the day prior to the strike on the Kramatorsk station, the chairman of the board of the Ukrainian railroads Oleksandr Kamyshin wrote on Telegram that a Russian airstrike at Barvinkove station in the neighbouring Kharkiv region had blocked trains evacuating civilians from Slovyansk and Kramatorsk. Later that night, Kamyshin reported that the obstacle had been cleared and that the affected trains were able to complete their journeys.\n\nThat same day, a popular Russian pro-war Telegram channel advised civilians evacuating the two cities against travelling by rail, likely in light of the air strike.\n\nOn the morning of April 8, at 10:13 am Kyiv time, the Russian Ministry of Defence claimed in a Telegram post that it had carried out \"air-based\" missile strikes against materiel for Ukrainian military reserves arriving at Pokrovsk, Slovyansk and Barvinkove railway stations. In the minutes that followed, local Telegram channels in non-government controlled areas of the Donetsk region were flooded with footage of missile launches.\n\nLess than 20 minutes later, reports emerged that Kramatorsk was under fire. By 10:44 am, Kamyshin announced on his Telegram channel that two missiles had struck the Kramatorsk railway station.\n\nAt 11:01 am Dmitry Steshin, a correspondent for the pro-Kremlin tabloid Komsomolskaya Pravda, posted a video to his Telegram channel adding that explosions had been heard 10 minutes prior at the Kramatorsk railway station, apparently targeted at a large group of Ukrainian soldiers. The fact that Steshin deleted the post shortly afterwards did not go unnoticed by journalists.\n\nIt seems implausible that Steshin, widely known for his strongly pro-Russian positions, could have filmed the video himself in a city then under Ukrainian control. Nevertheless, the video he uploaded and the caption he added were widely shared by pro-Kremlin Telegram channels. As Russian independent news outlet MediaZona noted, these posts can still be found online.\n\nAn hour later, the Russian Ministry of Defence (MoD) denied any culpability. Its statement emphasised that the missile found in Kramatorsk was a Tochka-U -- a type which it claimed Russia did not operate. Steshin also made this claim on his Twitter account, alleging that the Russian military had not used the Tochka-U for 30 years.\n\nIn an updated statement, the Russian MoD later claimed that the Ukrainian 19th Missile Brigade had fired the Tochka-U missiles at Kramatorsk from Dobropillya, a town to the southwest of Kramatorsk.\n\nThe statement also insisted that open source videos showing Russian-operated Tochka-Us in fact showed the same model of missile operated by the Belarusian military during joint Russian-Belarusian exercises leading up to Russia's invasion of Ukraine. However, other open source evidence appears to contradict this.\n\nThis is not the first time that Russia has denied operating the Tochka-U missile system. On March 16, two days after a missile struck the centre of Donetsk, Russia's mission to the UN also denied that its military used the weapon.\n\nThe Tochka-U missile plays a central role in the Russian authorities' insistence that their armed forces could not possibly have been behind the missile strike on Kramatorsk. Namely, they insist that the Russian military has phased out use of this ballistic missile.\n\nThese claims are seemingly in line with a recent modernisation drive for Russia's military. In June 2020, state media website Interfax reported that the entire Russian military had updated its missile systems, replacing the Tochka-U with the more modern Iskander.\n\nScott LaFoy, Director of Nuclear and Technology Security Programs at Exiger Government Solutions, who has spent his career as an open source analyst focusing on ballistic missiles and nuclear weapons systems, told Bellingcat that Russia \"didn't exactly throw them all in a river\" when describing what it may have done with the leftover Tochka series.\n\n\"We've seen legacy equipment deployed by Russia before, and Tochka-Us are valuable munitions that can offset expensive Iskander costs, allowing Russia to burn legacy inventory instead of purely new, expensive munitions\", he added.\n\nOpen source evidence also indicates that Tochka-U missiles have been spotted on several occasions during the invasion of Ukraine.\n\nAccording to the Conflict Intelligence Team (CIT), a reporting partner of Bellingcat, a train loaded with Tochka-U launchers and loader vehicles (based on the BAZ 5921 and 5922 chasses, respectively) moved from Homyel in Belarus to the Russian city of Belgorod in late March. CIT cited a March 30 video which was posted to Twitter by the prominent user GirkinGirkin, showing the launchers being transported by train.\n\nThis would be in line with the ongoing Russian retreat from the Kyiv front and consolidation in the east. The vehicles were marked with 'V' tactical marks, which are used by the Russian armed forces involved in the war against Ukraine. The Belarusian military, which has not formally entered the war, is not known to use these markings.\n\nThe Hajun Project, a group of anonymous Belarusian researchers, posted images of these same vehicles on Twitter on March 18. The team claimed that the launchers had arrived in Belarus' Minsk region on a Russian Air Force An-124 as an additional batch to supplement Russian Tochka-Us which had already arrived earlier in the month. Bellingcat was unable to independently verify this claim.\n\nIn the March 18 pictures, the vehicles did not yet have their 'V' tactical marks and still had their original numbers painted on. Judging by their similar wear and camouflage patterns, these vehicles appeared to be the same as those seen heading towards Belgorod by railway.\n\nIn addition to these images of Tochka-U launchers, further open source evidence indicates that the Russian military has by its own admission fielded this particular missile system as recently as last year.\n\nAs pointed out by CIT, the Russian 47th Missile Brigade still appears to operate the systems. In February 2021 they appeared in a broadcast by the Kuban 24 news station from an open house day at the 47th Missile Brigade's garrison.\n\nFurthermore Rob Lee, a Senior Fellow at the Foreign Policy Research Institute (FPRI) wrote that in April 2021, during a previous Russian military buildup on its border with Ukraine, vehicles which he believed resembled Tochka-Us could be seen moving through Rostov Oblast.\n\nTochka-Us could again be seen in May 2021 when they took part in a Victory Day parade in the southern city of Krasnodar. The narrator of this video, once again broadcast by Kuban 24, clearly names the missile systems as a Tochka-U.\n\nThe 47th Missile Brigade falls under the 8th Combined Arms Army, which is reportedly currently fighting in the Donbas. In a 2020 presentation to the Organisation for Security Cooperation in Europe (OCSE), the 8th Combined Arms Army was accused by Ukrainian military representatives of having command over the \"separatist\" 1st and 2nd Army Corps of the self-proclaimed \"Donetsk and Luhansk People's Republics,\" respectively.\n\nAn image uploaded on October 3, 2021, to the Russian social media network VK showed two soldiers atop what appeared to be a Tochka-U loader vehicle. The user's profile indicates that he has recently served in the Russian armed forces. The image was geotagged to the 47th Missile Brigade's garrison.\n\nOn January 21, 2022, TASS reported that Iskander-M missiles were delivered to the 47th Missile Brigade ahead of schedule. Given how recently the delivery apparently occurred, it is unclear whether the brigade has completed training and adoption of the Iskander-M systems from Tochka-U, as pointed out by CIT.\n\nSatellite imagery of the 47th Missile Brigade's garrison (45.5207962801, 39.3634004539) also shows that vehicles with measurements (six wheels, approximately 9.5 metres in length) consistent with Tochka-U launchers and loaders as recently as February 2022. However, more detailed imagery would be required to be absolutely conclusive about the Tochka-U's presence there at this time.\n\nMore recently, according to Amnesty International, Russia deployed Tochka-U missiles during the first days of the invasion. Amnesty's weapons investigator found that remains of the weapon that hit a hospital in Vuhledar in Eastern Ukraine bore the hallmarks of a Tochka-U missile.\n\nIn addition to the spot where the missile body of the missile landed, about 50 metres north-west of the main station building in Kramatorsk, five impact points were clearly identifiable.\n\nIn footage showing the aftermath of the strike, the roof of a building to the northernmost part of the affected area suffered damage, likely due to impact from a submunition.\n\nFurther south, a crater appeared on the ground, at the base of another south-southeast facing wall. Several casualties were also observed at this location.\n\nOn the western side of the station building, a line of parked cars were seen burning, and human remains were visible in later open source imagery from this area.\n\nIt is likely one of the vehicles was hit directly with a submunition. A clear splash mark indicating cluster munition use was visible to the south of the station building. A large number of casualties were initially observed at this location.\n\nNearby, the east-southeast facing wall of a building appeared to have been hit directly by a submunition, damaging a car. This could potentially be read as indicating a launch direction. However, when asked by Bellingcat, Markus Schiller of ST Analytics, a Munich-based consultancy that specialises in space technology and rocketry, stated that it is far more likely that the submunition detonated on the car given the angle at which the submunitions from the Tochka-U would have been released .\n\n\"The missile probably triggered the cluster explosion at 2,250 m(etres) at an angle of around 80 degrees, so the cassettes with their stabilisers will be falling down at very close to 90 degrees. With that, it seems more plausible to me that the car was hit by the cassette, not the wall. The wall just broke due to the shockwave\", Schiller said. This would mean it would likely not be possible to assess a launch direction from damage seen on the wall.\n\nInformation shared on pro-Russian Telegram channels, meanwhile, compared the area where the missile's missile body landed with the general impact zone of the cluster munitions. Several versions exist of these graphics, but the general trend has them pointing in a south-westerly direction, back into government-held territory.\n\nHowever, the experts contacted by Bellingcat again suggested that the direction of the submunitions and missile fragments are not in themselves useful evidence of its precise origin.\n\nAccording to Schiller, once the submunitions are deployed (at around two kilometres from impact), the remaining body of the missile likely becomes far less stable due to the change in weight dispersal. After this, it will not behave like a traditional projectile when falling down, Schiller said. \"With that, I would not interpret anything into the impact position of the missile body,\" he added.\n\nLaFoy broadly agreed. \"The orientation of the booster on the ground will have basically no indication of the trajectory,\" he said.\n\n\"While the orientation points to a generally eastern point of origin, it is not clearly determinable because the booster has a lot of room to tumble off-trajectory\", La Foy stated. \"So if it is laying north-south, east, west, backwards, doesn't really matter\".\n\nAnother claim circulating on pro-Russian Telegram groups and Twitter was that the serial number visible on the missile wreckage southwest of the station building was allegedly in the same range as missiles used by the Ukrainian military.\n\nWhile serial number ranges might be useful to determine ownership of other weapons, this does not appear to be the case for Tochka-U missiles. The Ukrainian Ministry of Defence told Bellingcat in email correspondence that the missiles were manufactured within Soviet Russia and delivered to storage bases, arsenals, and missile brigades across the USSR.\n\nTo prove this point, they added that a Tochka-U missile with the number VG910840 was used by Ukraine in 2014, landing in the town of Snizhne, while also pointing out that another was documented four years later in Syria (where Russia has militarily backed President Bashar al Assad) with a serial number just 25 digits higher (VG910865).\n\nThis appears to match open source evidence from both Snizhne and Syria.\n\nLarge amounts of footage emerged from the towns of separatist held towns of Khartsyzk, Zuhres, Shakhtyorsk, and Torez on 8 April showing several missile launches in the minutes preceding the Kramatorsk hit from areas south of the towns. Due to limited visibility, it was not possible to determine which missiles were used, or what they targeted.\n\nHowever, no footage has emerged of a launch site located south-west of Kramatorsk, whether in Ukraine-held or in Russia-held territory. This still leaves the biggest question regarding the April 8 strike on Kramatorsk station open, exactly where the missile originated.\n\nStill, efforts to spread disinformation about the tragedy continue. Most recently, a clip distributed on social media bearing the BBC's logo claimed Ukrainian responsibility for the missile strike on Kramatorsk airport. The news network has clarified that it did not create the clip, which it noted was broadcast on Russian state media.", "source": {"uri": "bellingcat.com", "dataType": "news", "title": "bellingcat"}, "authors": [], "image": "https://www.bellingcat.com/app/uploads/2022/04/2022-04-08T142348Z_1331471589_RC21JT9L1UFP_RTRMADP_3_UKRAINE-CRISIS-scaled.jpg", "eventUri": "eng-7639490", "sentiment": -0.1843137254901961, "wgt": 182, "relevance": 1, "stanza_neg": 30, "stanza_neu": 70, "stanza_pos": 2, "swn_neg": 102, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "6999451192", "lang": "eng", "isDuplicate": false, "date": "2022-04-11", "time": "10:54:00", "dateTime": "2022-04-11T10:54:00Z", "dateTimePub": "2022-04-11T10:20:00Z", "dataType": "news", "sim": 0.7019608020782471, "url": "https://www.sgtreport.com/2022/04/russia-states-obvious-ukies-blew-up-the-train-station/", "title": "Russia States Obvious: Ukies Blew Up the Train Station", "body": "Instead of doing a chemical weapons false flag, the West has decided to do random traditional weapons attacks against civilians in the Ukraine.\n\nI don't think anyone who isn't a totally brainwashed American believes this garbage.\n\nRT:\n\nA Tochka U ballistic missile, which reportedly killed dozens of civilians in the Ukrainian city of Kramatorsk on Friday, came from a town under the control of Ukrainian forces, the Russian Defense Ministry has claimed.\n\nThe missile was fired from Dobropole, around 45km southwest of the city, Moscow stated.\n\nThe deadly strike hit the main train station in Kramatorsk when an estimated 4,000 people were waiting for evacuation trains there. The latest casualty count by the city administration said 39 people were killed in the incident and 87 were injured.\n\nKramatorsk is a city in the northern part of the Donetsk region, and is claimed by the Donetsk People's Republic as part of its territory. When hostilities broke out in eastern Ukraine in the wake of the 2014 Maidan, the city remained under Kiev's control.\n\nKiev accused Russia of hitting the station, claiming civilians were targeted deliberately with the intent to kill. President Volodymyr Zelensky said it serves as the latest example that Russia is \"evil that knows no boundaries.\"\n\nInitial claims from Ukrainian officials said an Iskander missile was used, but images of a Tochka U tail part taken at the scene later flooded social media. Kramatorsk Mayor Aleksandr Goncharenko said missile debris was found 40 meters from where most of the damage was done.\n\nThe Russian Defense Ministry denied any responsibility for the attack. It said that Ukrainian troops must have targeted the station to disrupt the evacuation and keep civilians in the city so that they could be used as human shields during an upcoming fight for it.\n\nThe ministry claimed that Kiev is the only party in the Ukraine conflict that uses outdated Soviet-made Tochka U missiles.\n\nIf Russia is using them, then why did they lie about it and claim it was an Iskander to begin with?\n\nAnd why - yet again - would Russia, who has been so careful thus far, just randomly start killing civilians?\n\nThe US government has recently been promoting the idea that Russia will do false flags. Now, we see obvious false flags being done by the Ukraine, but we are supposed to believe it is impossible for the Ukraine to do false flags, because they are too moral. The people using the human shields, the people with the satanic neo-Nazis torturing everyone - they are too moral to ever do a false flag, even when it is obvious that is what happened.\n\nThe people in Washington and Brussels who declared this war on Russia for literally no reason other than world conquest would never do anything wrong.", "source": {"uri": "sgtreport.com", "dataType": "news", "title": "SGT Report"}, "authors": [], "image": null, "eventUri": "eng-7639490", "sentiment": -0.5294117647058824, "wgt": 179, "relevance": 1, "stanza_neg": 12, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7004515277", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "03:34:00", "dateTime": "2022-04-15T03:34:00Z", "dateTimePub": "2022-04-15T03:34:00Z", "dataType": "news", "sim": 0.7019608020782471, "url": "https://www.newsradio1029.com/news/ukraine-train-station-attack-leaves-59-dead-including-7-children/", "title": "Ukraine Train Station Attack Leaves 59 Dead, Including 7 Children", "body": "Ukraine's defense ministry announced on Thursday through its Twitter account that the death toll from last Friday's missile strike in Kramatorsk is now estimated to be 59, including seven children.\n\n\"Two more children have died after being hit by a [Russian] missile at the railway station in #Kramatorsk. The total number of victims reached 59, including 7 children. A bloody children's toy will be sent by @NPU_GOV_UA to the @UN as proof of this barbaric crime,\" the ministry wrote.\n\nUkrainian officials accused Russia of conducting the rocket attack shortly after a mass casualty event at the train station, where many civilians were, was first reported.", "source": {"uri": "newsradio1029.com", "dataType": "news", "title": "Newsradio 102.9 | KARN-FM"}, "authors": [], "image": null, "eventUri": "eng-7639490", "sentiment": -0.5215686274509803, "wgt": 179, "relevance": 1, "stanza_neg": 2, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004419860", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "00:50:00", "dateTime": "2022-04-15T00:50:00Z", "dateTimePub": "2022-04-15T00:50:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.democraticunderground.com/10142904085", "title": "Death toll in Ukraine train station bombing reaches 59, including 7 children", "body": "Source: The Hill\n\nUkrainian officials put the death toll of a missile strike in the eastern Ukrainian city of Kramatorsk at 59 on Thursday, including seven children.\n\n\"Two more children have died after being hit by a [Russian] missile at the railway station in #Kramatorsk. The total number of victims reached 59, including 7 children. A bloody children's toy will be sent by @NPU_GOV_UA to the @UN as proof of this barbaric crime,\" Ukraine's Defense Ministry tweeted.\n\nLast week, Ukrainian officials accused Russia of conducting a rocket attack against the train station in Kramatorsk that was being used to assist civilian evacuations.\n\nThe death toll climbed steadily during the day and the attack was immediately condemned by the international community.\n\nRead more: https://www.msn.com/en-us/news/world/death-toll-in-ukraine-train-station-bombing-reaches-59-including-7-children/ar-AAWet10?li=BBnbcA1", "source": {"uri": "democraticunderground.com", "dataType": "news", "title": "Democratic Underground"}, "authors": [], "image": null, "eventUri": "eng-7639490", "sentiment": -0.4666666666666667, "wgt": 170, "relevance": 1, "stanza_neg": 3, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004574828", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "05:02:00", "dateTime": "2022-04-15T05:02:00Z", "dateTimePub": "2022-04-15T05:01:00Z", "dataType": "news", "sim": 0.6549019813537598, "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/russian-shelling-leads-to-massive-fire-at-factory-in-kramatorsk-as-war-enters-day-51-articleshow.html", "title": "Russian shelling leads to massive fire at factory in Kramatorsk as war enters day 51", "body": "Kramatorsk factory was struck by Russian artillery shelling in the wee hours of Thursday. Blast from the explosion damaged at least one building on the premises\n\nAs the Russian war against Kyiv escalated to day 51, Ukrainian firefighters worked to douse a massive fire in a factory in the Kramatorsk region. The factory was struck by Russian artillery shelling in the wee hours of Thursday. The blast from the explosion damaged at least one building on the factory premises. A video footage accessed by Republic TV shows thick black smoke covering the interiors of the factory. There were no immediate reports of casualties or injuries.\n\nThe Russian strike comes days after Moscow was announced to restrategise its war in Ukraine after failing to topple the pro-Western Ukrainian government. In what the Kremlin calls \"phase two\" of the invasion, Russia has pulled back troops from key Ukrainian cities like Kyiv and Chernihiv and concentrated on \"liberation\" of the pro-Russian separatist-held regions of Donetsk and Luhansk, collectively known as Donbass. The main aim of this is to expand the territories administered by anti-Kyiv rebels. The move is expected to lead to an imminent protracted conflict, according to experts cited by BBC.\n\nThe reinvigorated onslaught in Kramatorsk city of Donetsk comes days after a missile hit a railway station last Friday, killing at least 57, including five children, and injuring 100. Calling it a \"Russian war crime,\" Ukraine President Volodymyr Zelenskyy appealed that the incident must be added as evidence against Russia at any future tribunals over the invasion. \"A firm, global response ... Like the massacre in Bucha, like many other Russian war crimes, the missile strike on Kramatorsk must be one of the charges at the tribunal, which is bound to happen,\" Zelenskyy said. The US also blamed Russia for what was believed to be a short-range Tochka-U ballistic missile attack on the railway station. However, Russia denied involvement in the attack on the crowded station, which reportedly sheltered 4,000 people waiting to be evacuated.\n\nRussia, in turn, accused Ukraine of carrying out the Tochka-U ballistic missile attack. Some initial reports by the Russian media outlets also claimed that the strike hit a military transport target in Kramatorsk. Later, a mock-up video of the missile attack branded under BBC also surfaced on social media, which gave a false impression that Ukrainian authorities claimed responsibility for the Friday attack. The video was taken down shortly after.", "source": {"uri": "republicworld.com", "dataType": "news", "title": "Republic World"}, "authors": [], "image": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/uaa2zuo3oom0ybgp_1649995047.jpeg", "eventUri": "eng-7639490", "sentiment": -0.2705882352941177, "wgt": 167, "relevance": 1, "stanza_neg": 9, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004263437", "lang": "eng", "isDuplicate": false, "date": "2022-04-14", "time": "20:52:00", "dateTime": "2022-04-14T20:52:00Z", "dateTimePub": "2022-04-14T19:56:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://www.dailymail.co.uk/news/article-10719919/Two-children-die-Ukraine-rail-station-bombing.html", "title": "Two more children die after Ukraine rail station bombing", "body": "Ukraine said it would send a blood-covered soft toy to the UN as evidence\n\nTwo more children have succumbed to injuries sustained in an alleged Russian air strike on Kramatorsk train station last week, taking the death toll to 59 - including seven children - Ukraine's defence ministry has said.\n\nThe ministry announced the deaths on Twitter today, along with a picture of a child's cuddly horse toy - covered in blood - that was found at the station after the attack.\n\n'A bloody children's toy will be sent by (Ukraine's national police) to the UN as proof of this barbaric crime,' the ministry said in its statement.\n\nThe strike by two missiles, believed to be Russian, was carried out on April 8 when thousands of people were at the station in eastern Ukraine trying to flee west away from Russian forces preparing an assault on the region.\n\nAround 4,000 civilians were thought to be in and around the railway station when the missiles hit. Hundreds were injured, and while the initial death toll was reported to be around 30, the figure has since risen to 59.\n\nTwo more children have succumbed to injuries sustained in an alleged Russian air strike on Kramatorsk train station last week, taking the death toll to 59 - including seven children - Ukraine's defence ministry has said\n\nUkraine's defence ministry announced the deaths on Twitter today, along with a picture of a child's stuffed horse - covered in blood - that was found at the station after the attack\n\nPictured: An injured child, who survived the missile attack on the Kramatorsk station on April 8th, get treatment at paediatric intensive care in a hospital in the city of Dnipro, April 14, 2022\n\nIn the days prior, Ukrainian officials had urged people living in the eastern regions of Ukraine to evacuate as Moscow refocused its military efforts on the Donbas region.\n\nGraphic pictures of the aftermath of the strike showed bodies strewn across the floor, lying amongst luggage and children's prams outside the busy station.\n\nAlthough Moscow denied the attack, claiming it was launched by Ukraine, analysts said the wreckage of one of the two missiles that hit the station was Russian.\n\nThe attack sparked international outrage against Russia and led to Western countries imposing even harsher sanctions on the Kremlin.\n\nNews of the two children's deaths came after a a fake BBC News report making out Ukraine was behind a deadly missile attack on its own people was spread online by pro-Russian sources.\n\nThe broadcaster on Wednesday urged people to ignore the video, which uses the corporation's logo and same red and white coloured graphics.\n\nInjured children, who survived the missile attack on the Kramatorsk station on April 8th, get treatment at paediatric intensive care in a hospital in the city of Dnipro, Ukraine on April 14\n\nTwo children died on Thursday, bringing the total number of children killed in the air strike to seven and the overall death toll to 59\n\nA fragment of a Tochka-U missile lies on the ground following an attack at the railway station in Kramatorsk, Ukraine, Friday, April 8, 2022\n\nA man lays flowers as volunteers look for traces to help identify the corpses at Kramatorsk railway station after the missile attack in Ukraine on April 09, 2022\n\nThe clip gave the false impression that Ukrainian armed forces were responsible for the missile attack on refugees in Kramatorsk.\n\nMeanwhile, Ukraine said Thursday it was reopening humanitarian corridors allowing for the evacuation of civilians from war-scarred regions after a day-long pause that Kyiv attributed to Russian violations.\n\nDeputy Prime Minister Iryna Vereshchuk said in a statement on social media that nine routes in the east and south of the country would be operating a day after they were shut because routes, she had said, were 'too dangerous'.\n\n'Humanitarian corridors in the Lugansk region will be run under the condition of cessation of shelling by the occupying forces,' Vereshchuk said Thursday.\n\nA view of people's belongings and bloodstains on the ground after a missile strike on a railway station in Kramatorsk, Ukraine, in this picture uploaded on April 8, 2022\n\nUkrainian authorities have been urging people in the southeastern Donbas area to quickly move west in advance of a feared, large-scale Russian offensive to capture its composite regions, Donetsk and Lugansk.\n\nBritish military intelligence said on Thursday that the Ukrainian towns of Kramatorsk and Kostiantynivka are likely to be targeted by Russia for levels of violence seen in other urban centres since Moscow invaded Ukraine in late February.\n\nIn an update on the war, Britain's Ministry of Defence (MoD) said that 'widespread missile and artillery strikes and efforts to concentrate forces for an offensive' showed a reversion to traditional Russian military doctrine.\n\nThe MoD added that Ukraine's continued defence of Mariupol was currently tying down significant numbers of Russian troops and equipment.", "source": {"uri": "dailymail.co.uk", "dataType": "news", "title": "Daily Mail Online"}, "authors": [{"uri": "chris_jewers@dailymail.co.uk", "name": "Chris Jewers", "type": "author", "isAgency": false}], "image": "https://i.dailymail.co.uk/1s/2022/04/14/20/56627123-0-image-a-58_1649966199606.jpg", "eventUri": "eng-7639490", "sentiment": -0.5450980392156863, "wgt": 166, "relevance": 1, "stanza_neg": 14, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 30, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004375651", "lang": "eng", "isDuplicate": false, "date": "2022-04-14", "time": "23:32:00", "dateTime": "2022-04-14T23:32:00Z", "dateTimePub": "2022-04-14T23:32:00Z", "dataType": "news", "sim": 0.5647059082984924, "url": "https://thehill.com/policy/international/3269176-death-toll-in-ukraine-train-station-bombing-reaches-59-including-7-children/", "title": "Death toll in Ukraine train station bombing reaches 59, including 7 children", "body": "Ukrainian officials put the death toll of a missile strike in the eastern Ukrainian city of Kramatorsk at 59 on Thursday, including seven children.\n\n\"Two more children have died after being hit by a [Russian] missile at the railway station in #Kramatorsk. The total number of victims reached 59, including 7 children. A bloody children's toy will be sent by @NPU_GOV_UA to the @UN as proof of this barbaric crime,\" Ukraine's Defense Ministry tweeted.\n\nLast week, Ukrainian officials accused Russia of conducting a rocket attack against the train station in Kramatorsk that was being used to assist civilian evacuations.\n\nThe death toll climbed steadily during the day and the attack was immediately condemned by the international community.\n\nPhotos and video circulated on social media showing bodies lying on the ground and personal belongings left all over the area. Ukrainian Foreign Minister Dmytro Kuleba said it was a \"deliberate slaughter.\"\n\nThe development comes as the Ukrainian Parliament announced on Thursday that it had adopted a declaration that recognized actions committed by Russia's military as \"acts of genocide,\"\n\nAmong the acts recognized as genocide by Verkhovna Rada, Ukraine's parliament, are: \"mass atrocities in the temporary occupied terrorities,\" \"systematic instances of willful killing of civilians,\" \"forcible transfer of Ukrainian children to the russian terrority,\" \"impositions of life conditions causing grave suffering\" and \"widespread instances of physical and mental harm to the population of Ukraine.\"", "source": {"uri": "thehill.com", "dataType": "news", "title": "The Hill"}, "authors": [], "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/TrainStationUkraine_040822_AP-ZelenskyRelease.jpg?w=1280", "eventUri": "eng-7639490", "sentiment": -0.5137254901960784, "wgt": 144, "relevance": 1, "stanza_neg": 4, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004549760", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "04:26:00", "dateTime": "2022-04-15T04:26:00Z", "dateTimePub": "2022-04-15T03:55:00Z", "dataType": "news", "sim": 0.529411792755127, "url": "https://www.ukrinform.net/rubric-ato/3458064-monastyrskyy-hands-over-bloodied-toy-from-kramatorsk-railway-station-to-un-mission.html", "title": "Monastyrskyy hands over bloodied toy from Kramatorsk railway station to UN mission", "body": "\"Let this toy become a symbol of the grief of Ukrainian mothers and remind you of the fate of our children who are killed cynically and massively by Russia,\" Monastyskyy said, the Ministry's press service posted on Facebook.\n\nOn Thursday, the 50th day of Russia's full-scale war against Ukraine, Monastyrskyy held a meeting with UN Crisis Coordinator for Ukraine Amin Awad and told him that the Ukrainian people continued to heroically resist the Russian aggressor's offensive.\n\n\"Since the beginning of the war, investigators of the National Police of Ukraine have launched an investigation into more than 6,000 proceedings over crimes committed by the Russian military. As a result of the Russian aggression in the territory of Ukraine, more than 190 children have been killed and about 350 children have been injured,\" the minister said.\n\nMonastyrskyy underscored that on the morning of April 8 Russian troops had fired a Tochka-U missile marked \"For Children\" on the Kramatorsk railway station with about 4,000 civilians, mostly women, children, and the elderly waiting for the evacuation train.\n\n\"It was a deliberate, purposeful, planned attack on civilians. This crime of the Russian Federation took the lives of 59 civilians, including 7 children. In addition, 114 people were injured to varying degrees. A bloodied soft toy was found among the bodies of the wounded and killed,\" the Ukrainian minister said.\n\nA picture of this horse was published in many world media and has become a symbol of the destroyed fate of Ukrainian children.\n\nIt is noted that the bloodied toy will be delivered to the Independent International Commission of Inquiry on Ukraine as yet another piece of evidence of cynical war crimes against humanity committed by the Russian occupation forces in our country.\n\nPolice removed the toy from the scene, kept it in the condition it was after the tragedy, and then took it to Kyiv.\n\n\"The strike on Kramatorsk must be one of the charges brought against Russia at the tribunal which will undoubtedly take place,\" the Ministry stressed.\n\nRussia's invasion of Ukraine has been going on since February 24. Russia shells and destroys key infrastructure, residential areas of Ukrainian cities, towns, and villages using artillery, MLRS, and ballistic missiles.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_04/thumb_files/630_360_1649986401-541.jpg", "eventUri": "eng-7639490", "sentiment": -0.4745098039215686, "wgt": 135, "relevance": 1, "stanza_neg": 6, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]