[{"uri": "7257146418", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:13:00", "dateTime": "2022-11-09T15:13:00Z", "dateTimePub": "2022-11-09T15:13:00Z", "dataType": "news", "sim": 0.8509804010391235, "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/russia-appointed-deputy-governor-of-kherson-region-killed-in-car-accident-report-articleshow.html", "title": "Russia-appointed deputy governor of Kherson region killed in car accident: Report", "body": "The news of Kirill Stremousov's death comes amid a highly effective counteroffensive by the Ukrainian forces along the Dnipro River in the Kherson region.\n\nDeputy Governor of Ukraine's Kherson region Kirill Stremousov has reportedly died following a car accident. According to BBC, the regional governor's press service stated that Kirill Stremousov died in a car crash on Wednesday.\n\nAs per reports, Stremousov died in an accident on the highway between Armyansk in Crimea and Kherson. According to the Russian state media company Vesti, Stremousov was 45 years old.\n\nThe report regarding Stremousov's death was confirmed by the head of a nonprofit organization Good Peace-Crimean Volunteers, Valeria Petrusevich, who wrote on her Telegram channel that \"Kirill Stremousov, deputy governor of the Kherson region, died. The information is accurate, I know personally. It was an accident. Details later.\"\n\nKirill Stremousov was one of the most prominent proponents of Russia's occupation of the Ukrainian region and was known for aggressive statements on social media. He was quick to side with Russia despite his Ukrainian nationality when the Kherson region fell early during the Russian invasion.\n\nMoreover, he was appointed as the deputy head of the Kherson region military administration and was prominent in organizing and supporting Russia's referendum to legitimize Kherson's annexation by Russia.\n\nMore recently, Stremousov had been the driving force in the evacuation of civilians from Kerson's west bank amid Ukraine's counteroffensive against the Russian forces along the Dnipro River. For his actions supporting Russia's war efforts against Ukraine, Stremousov was wanted for treason by the Ukrainian police.\n\nMeanwhile, Kherson remains the only Ukrainian regional centre captured by Russian troops after the onset of the invasion on February 24 and is being targeted by a Ukrainian counteroffensive. As the counteroffensive continues, several indications have been made that Russian forces may abandon the city and retreat.", "source": {"uri": "republicworld.com", "dataType": "news", "title": "Republic World"}, "authors": [], "image": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/n5v3ozb2qpzx92hx_1668005186.jpeg", "eventUri": "eng-8166048", "sentiment": -0.3333333333333334, "wgt": 217, "relevance": 1, "stanza_neg": 4, "stanza_neu": 10, "stanza_pos": 2, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259042314", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "23:31:00", "dateTime": "2022-11-10T23:31:00Z", "dateTimePub": "2022-11-10T23:26:00Z", "dataType": "news", "sim": 0.843137264251709, "url": "https://www.b92.net/eng/news/world.php?yyyy=2022&mm=11&dd=09&nav_id=114828", "title": "Russian leader of Kherson was killed", "body": "The deputy head of the administration of the Kherson region, Kirill Stremousov, was killed, RT reports.\n\nDeputy Head of the Kherson Military-Civilian Administration, Kirill Stremousov, was killed in a traffic accident, Russian media report.\n\nStremousov, the deputy head of the region, often spoke on behalf of the regional administration, especially when it came to the situation in the city of Kherson. He gave regular updates on social networks and regularly talked to journalists about affairs in the region.\n\nJust this morning, the late official revealed an update on the situation on the battlefield, reporting that Russian soldiers had thwarted Ukrainian attempts to advance in a town about 50 km north of Kherson.\n\nActing head of the Kherson region, Vladimir Saldo, confirmed that Stremousov died in an accident.\n\n\"\"It is very difficult for me to say that Kirill Stremousov died today. He died in the territory of the Kherson region in a traffic accident,\" Saldo wrote on the Telegram social network.\n\nStremousov came to prominence in the national media after he had already escaped death once.\n\nIn September, his office in Kherson was hit by a Ukrainian missile, but he was not in the office at the time. Several administration workers were injured in the explosion.", "source": {"uri": "b92.net", "dataType": "news", "title": "B92"}, "authors": [], "image": "https://www.b92.net/news/pics/2022/11/09/1977549569636bcd31c6bcd516242277_640x360x002721.jpg", "eventUri": "eng-8166048", "sentiment": -0.4588235294117647, "wgt": 215, "relevance": 1, "stanza_neg": 6, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257317371", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:44:00", "dateTime": "2022-11-09T17:44:00Z", "dateTimePub": "2022-11-09T17:44:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://en.haberler.com/russian-appointed-kherson-deputy-governor-killed-1779857/?utm_source=facebook&utm_campaign=tavsiye_et", "title": "Russian-Appointed Kherson Deputy Governor Killed In Car Crash", "body": "Kirill Stremousov died in road accident in Kherson, says Russian installed regional governor.\n\nKirill Stremousov, the Russian-installed deputy governor of Ukraine's southern Kherson region, died in a car crash on Wednesday.\n\nThe 45-year-old's death was announced by Vladimir Saldo, the Russian-appointed governor of Kherson.\n\n\"It's very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region while riding in a car. There was a road accident,\" Saldo said in a Telegram post.\n\nStremousov's death comes as Russia pulls out its forces from the southern port city of Kherson to the east bank of the Dnieper River that it lies on.\n\nRussian Defense Minister Sergey Shoygu stressed that the decision for a retreat was made to save the lives of Russian soldiers.\n\nLast month, some 60,000 residents of the Kherson region, then under Russian control, were evacuated amid a Ukrainian counteroffensive. -", "source": {"uri": "en.haberler.com", "dataType": "news", "title": "Haberler.com"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.3647058823529412, "wgt": 211, "relevance": 1, "stanza_neg": 5, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257298348", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:26:00", "dateTime": "2022-11-09T17:26:00Z", "dateTimePub": "2022-11-09T17:11:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://www.mirror.co.uk/news/world-news/vladimir-putins-puppet-head-occupied-28450090", "title": "Putin's puppet head of occupied city 'killed in car crash' as Russia retreats", "body": "The Russian puppet head of occupied Ukrainian city Kherson has been killed in a car crash, pro-Moscow media has said.\n\nKirill Stremousov, the highly-visible deputy head of the occupying regime, has died as Russia retreats from the city and Ukraine is expected to launch a major counteroffensive in the region.\n\nThe death of the pro-Russian Ukrainian was confirmed by numerous sources, including TASS.\n\nStremousov was killed in an accident near Henichesk, his personal driver told the military project WarGonzo.\n\nEarlier today, he had accused the West of being behind the Ukrainian advance in Kherson.\n\nMany English and Polish speaking mercenaries were among the advancing forces, he alleged, offering no proof.\n\nHe told how there was an evacuation from Kherson.\n\n\"Many have left. About 80,000 people were evacuated. We help everyone who wants to leave Kherson. I am now in Kherson myself,\" he said.\n\nThe Russian with his family ( Image: social media/e2w)\n\nThe place he was killed is Russian controlled and 130 miles from Kherson city.\n\nUkrainian blogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe appeared to imply that Stremousov had many enemies for supporting the Russian occupation forces which are now pulling back.\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened, then it was no Ukrainian Army spies killing him.\"\n\n\" Russia is in Kherson forever,\" Stremousov - who had worked as a handyman in the US - had boasted, ahead of losses which mean Putin's forces are on the retreat.\n\nHe was wanted in Kyiv for treason ( Image: social media/e2w)\n\nBut the official also had enemies among Russians after blasting Putin's defence minister Sergei Shoigu for alleged incompetence in defending Kherson region.\n\n\"There is no need to cast a shadow over the entire Russian Defence Ministry at the moment because of some, I am not saying traitors,\" he said last month.\n\nShoigu's \"untalented military commanders\" have \"not really bothered to answer for all the processes and holes that now exist\".\n\nHe declared: \"Indeed many say, if I were the defence minister who allowed this state of affairs to happen, as an officer I could have just shot myself.\"\n\nHe then suggested that the word \"officer\" was \"incomprehensible\" to Shoigu.\n\nStremousov, a Ukrainian pro-Russian politician wanted in Kyiv for treason, lumped Shoigu and his generals together with \"corrupt marauders and other scum\" in the Russian defence ministry.\n\nIn his office, with a portrait of Russian President Vladimir Putin seen on the wall behind him ( Image: AFP via Getty Images)\n\nPolitical analyst Sergey Markov said: \"Kirill Stremousov, deputy head of the Kherson region, was killed. It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Genichesk\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"\n\nStremousov was wanted in Kyiv for treason.\n\nPutin's puppet governor of Kherson expressed distress and dismay over Stremousov's death, as the Kremlin placeman in Sevastopol Mikhail Razvozhaev called his demise \"an irreparable loss\".\n\nOn a video Kherson \"governor\" Vladimir Saldo, said: \"It is very hard for me to say that \"viceroy\" Kirill Stremousov died today.\n\nThe metadata on the video recorded by \"stooge governor\" Saldo suggests it was recorded two hours before the first announcement of Kherson \"viceroy\" Stremousov's death.\n\n\"He died in Kherson region, in a car that got into an accident...\n\n\"It will also be difficult to talk about the tragedy to his family and friends...\n\n\"He has five children and a sixth is due soon.\n\n\"Of course, we will take care of all of them, but unfortunately, Kirill will not be returned.\"\n\nHowever Ukrainian sources queried whether the announcement of his death could be a Kremlin trick.\n\nIndependent We Can Explain media reported: \"Against the backdrop of a lack of details about the accident and the circumstances of his death, Ukrainian officials started saying the accident could be staged, and rumours about it in pro-Kremlin channels could be disinformation.\"\n\nRead More Read More Read More Read More Read More", "source": {"uri": "mirror.co.uk", "dataType": "news", "title": "Mirror"}, "authors": [{"uri": "will_stewart@mirror.co.uk", "name": "Will Stewart", "type": "author", "isAgency": false}], "image": "https://i2-prod.mirror.co.uk/incoming/article28450518.ece/ALTERNATES/s1200/0_PAY-Kirill-Stremousov-dead-4-east2west-news.jpg", "eventUri": "eng-8166048", "sentiment": -0.3019607843137255, "wgt": 211, "relevance": 1, "stanza_neg": 13, "stanza_neu": 32, "stanza_pos": 0, "swn_neg": 45, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257745106", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "02:57:00", "dateTime": "2022-11-10T02:57:00Z", "dateTimePub": "2022-11-10T02:57:00Z", "dataType": "news", "sim": 0.8196078538894653, "url": "https://edition.cnn.com/2022/11/09/europe/kirill-stremousov-kherson-official-killed-intl/index.html", "title": "Senior Russian-appointed official in occupied Kherson 'killed in road accident' | CNN", "body": "Ukraine CNN --\n\nOne of the most senior Russian-appointed officials in occupied Ukrainian territory has been killed, Russian officials and state news agencies said Wednesday.\n\nThe Russian-appointed deputy head of the Kherson region in southern Ukraine, Kirill Stremousov, died in a road accident, the press secretary of the head of the region said, according to Russian news agency TASS.\n\nAlso on Wednesday, Russia ordered a retreat from the west bank of the Dnipro River across the Kherson region, a dramatic setback for Moscow in the face of recent Ukrainian advances.\n\nStremousov was killed in an accident on the highway between Kherson and Armyansk in Crimea, the Russian state media company Vesti (VGTRK) reported, citing the region's health minister. Stremousov was 45 years old, according to Vesti.\n\nHis death was also announced by the Russian-appointed \"head\" of Kherson, Vladimir Saldo, who wrote in a statement on Telegram: \"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, moving in a car that got into an accident.\"\n\nStremousov, a Ukrainian who was quick to side with the Russian occupation when Kherson fell early in the invasion, had become one of the most vocal and outspoken of Russian appointees.\n\nAs deputy head of the Kherson region military administration, Stremousov was prominent in organizing and supporting the referendum on Kherson's illegal annexation by Russia and more recently had been the driving force in the evacuation of civilians from the west bank in Kherson, as Ukrainian forces pushed toward the Dnipro.\n\nOn Tuesday, Stremousov said: \"Most residents who decided to stay in Kherson are only now beginning to realize the gravity of the situation and my warnings.\"\n\nStremousov frequently took to Telegram to describe Ukrainian officials and forces as \"Nazis\" and \"fascists.\" But he was also critical of missteps by the Russian military. He had blamed the military setbacks in Kherson on \"incompetent commanders\" who had not been held accountable for their mistakes.\n\nLater on Wednesday, Russian Defense Minister Sergey Shoigu ordered the withdrawal of Russian forces from the west bank of the Dnipro, Russian state media reported.\n\nThis would be the most significant military development in the war since Ukrainian forces swept through the northern Kharkiv region in September. Shoigu's order came as Ukrainian forces make advances toward the city of Kherson from two directions.\n\nRussian forces have also destroyed bridges across occupied parts of the Kherson region west of the Dnipro, a local Ukrainian official and Russian military analysts on Telegram reported earlier.\n\nSkepticism and murky circumstances\n\nA Ukrainian official expressed skepticism about the reports of Stremousov's death. Yuriy Sobolevskyi, first deputy head of the Ukrainian Kherson regional council, said on Telegram: \"Regarding the information spread by the occupiers and Russian sources regarding the death of collaborator Kirill Stremousov in an accident, so far we can neither confirm nor deny the information. It may be true, or it may be staged.\"\n\nStremousov had previously had a checkered career as a local politician in Kherson, and was involved in several fracas. He also dabbled in paganism and a peculiar form of yoga. Video from 2017 showed him swinging his baby daughter around his head by her feet.\n\nStremousov is not the first Russian-backed leader to die in murky circumstances. Alexander Zakharchenko, the leader of Russian-backed separatists, was killed in the bombing of a café in 2018. Several separatist commanders were also killed in a string of assassinations before Russia's full-scale invasion of Ukraine that went unsolved.\n\nRussian and separatist leaders blamed Ukraine for the killings. Ukrainian officials in turn claimed the Moscow was eliminating troublesome local leaders. Several prominent separatists had reputed links to organized crime and some observers suggested their deaths may have also been score-settling by criminal groups.", "source": {"uri": "edition.cnn.com", "dataType": "news", "title": "CNN International"}, "authors": [{"uri": "anna_chernova@edition.cnn.com", "name": "Anna Chernova", "type": "author", "isAgency": false}, {"uri": "darya_tarasova@edition.cnn.com", "name": "Darya Tarasova", "type": "author", "isAgency": false}, {"uri": "tim_lister@edition.cnn.com", "name": "Tim Lister", "type": "author", "isAgency": false}, {"uri": "uliana_pavlova@edition.cnn.com", "name": "Uliana Pavlova", "type": "author", "isAgency": false}, {"uri": "nathan_hodge@edition.cnn.com", "name": "Nathan Hodge", "type": "author", "isAgency": false}], "image": "https://media.cnn.com/api/v1/images/stellar/prod/221109135202-kirill-stremousov-file-072022.jpg?c=16x9&q=w_800,c_fill", "eventUri": "eng-8166048", "sentiment": -0.3647058823529412, "wgt": 209, "relevance": 1, "stanza_neg": 6, "stanza_neu": 24, "stanza_pos": 1, "swn_neg": 31, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257214677", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:11:00", "dateTime": "2022-11-09T16:11:00Z", "dateTimePub": "2022-11-09T16:11:00Z", "dataType": "news", "sim": 0.8078431487083435, "url": "https://www.cairnspost.com.au/news/world/deputy-governor-of-russianoccupied-kherson-dies-in-mysterious-car-crash/news-story/3624a07f7e61496442ad811cf766f6e0", "title": "Russian troops flee from key occupied city", "body": "Russia is reportedly removing its troops from the occupied Ukrainian city of Kherson.\n\nKherson, in the country's south, was the only regional capital Russia had captured since the start of the war in February.\n\nThe move comes just hours after it was announced the Moscow-installed deputy governor of the Kherson region had died in a mysterious car crash.\n\nAccording to the BBC, Russia's Ukraine commander General Sergei Surovikin had said supplying the city was no longer possible.\n\nThe bulk of the city is on the eastern bank of the Dnipro River, closer to Ukrainian forces. In recent months, Ukraine has successfully taken out most of the Dnipro crossing near Kherson forcing supplies and people to use vulnerable and slow moving ferries to get in and out of the city.\n\nRussian forces will move to the western bank of the Dnipro leaving a large chunk of the Kherson region now longer under Moscow's control.\n\n\"In these circumstances, the most sensible option is to organise the defence along a barrier line along the river Dnipro,\" Gen Surovikin is reported to have told a meeting of senior military leaders.\n\nOn 30 September, Russia declared that it had annexed the Kherson region along with the regions of Zaporizhzhia, Luhansk and Donetsk. None were - or are - fully under Moscow's yoke. Russia does control the entirety of the Ukrainian region of Crimea which it invaded in 2014.\n\nRegion's deputy gvernor dies in mysterious crash\n\nEarlier on Wednesday, Russian state media had reported Kirill Stremousov, 45, was killed in a supposed car accident.\n\nThe highly-visible deputy head of the occupying regime died as Ukraine is expected to launch a major counteroffensive in the region.\n\nRussia is evacuating Kherson ahead of the predicted attack, but is believed to be forcing Ukrainians fleeing to head east towards Russia.\n\nEarlier today, hours before his death, Stremousov had typically accused the West of being behind the Ukrainian advance in Kherson.\n\nMany English and Polish-speaking mercenaries are among the advancing forces, he alleged, offering no proof.\n\nStremousov had claimed he was in the city helping people flee. The place he was killed is Russian controlled and 200km miles from Kherson city.\n\nUkrainian blogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe appeared to imply that Stremousov had many enemies for supporting the Russian occupation forces, which are now pulling back.\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened, then it was no Ukrainian Army spies killing him.\"\n\n\"Russia is in Kherson forever,\" Stremousov - who had worked as a handyman in the US - had boasted, ahead of losses which mean Putin's forces are on the retreat.\n\nBut the official also had enemies among Russians after blasting Putin's defence minister Sergei Shoigu for alleged incompetence in defending Kherson.\n\n\"There is no need to cast a shadow over the entire Russian Defence Ministry at the moment because of some, I am not saying traitors,\" he said last month.\n\nShoigu's \"untalented military commanders\" have \"not really bothered to answer for all the processes and holes that now exist\", he said.\n\nHe declared: \"Indeed many say, if I were the defence minister who allowed this state of affairs to happen, as an officer I could have just shot myself.\"\n\nHe then suggested that the word \"officer\" was \"incomprehensible\" to Shoigu.\n\nStremousov, a Ukrainian pro-Russian politician wanted in Kyiv for treason, lumped Shoigu and his generals together with \"corrupt marauders and other scum\" in the Russian defence ministry.\n\nPolitical analyst Sergey Markov said: \"Kirill Stremousov, deputy head of the Kherson region, was killed. It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Genichesk\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"", "source": {"uri": "cairnspost.com.au", "dataType": "news", "title": "The Cairns Post"}, "authors": [], "image": "https://content.api.news/v3/images/bin/5a64f66a24771a375a32cc97daccba32", "eventUri": "eng-8166048", "sentiment": -0.1372549019607843, "wgt": 206, "relevance": 1, "stanza_neg": 14, "stanza_neu": 22, "stanza_pos": 2, "swn_neg": 38, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257680093", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "01:12:00", "dateTime": "2022-11-10T01:12:00Z", "dateTimePub": "2022-11-10T00:52:00Z", "dataType": "news", "sim": 0.8078431487083435, "url": "https://www.walesonline.co.uk/news/world-news/putin-appointed-deputy-head-kherson-25478890", "title": "Putin appointed deputy head of Kherson killed in car crash", "body": "The Russian-installed deputy head of occupied Ukrainian city Kherson has been killed in a car crash, local officials have reported.\n\nThe death of pro-Moscow Kirill Stremousov, 45, who was appointed two months after the Russian invasion, has been confirmed by numerous sources. Wanted for treason by the Ukrainian police, he lost his life in an accident near the port city of Henichesk in the south of the country, just over 100 miles from Kherson.\n\nEarlier today, he had accused the West of being behind the Ukrainian advance in Kherson. Many English and Polish-speaking mercenaries were among the advancing forces, he alleged, while also telling how there was an evacuation from Kherson, reports the Mirror.\n\n\"Many have left,\" he said. \"About 80,000 people were evacuated.\n\n\"We help everyone who wants to leave Kherson. I am now in Kherson myself.\"\n\nUkrainian blogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov. If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe appeared to imply that Stremousov had many enemies for supporting the Russian occupation forces which are now pulling back.\n\n\"And the main thing - if he was killed, and exactly in the way I was told it happened, then it was no Ukrainian Army spies killing him,\" he added.\n\nVladimir Rogov, a Moscow-installed official in the Zaporizhzhia region, said Stremousov died when his vehicle tried to avoid a lorry driver who made \"a dangerous manoeuvre\".\n\nStremousov had enemies among Russians after blasting Vladimir Putin's defence minister Sergei Shoigu for alleged incompetence in defending Kherson region. He said last month: \"There is no need to cast a shadow over the entire Russian Defence Ministry at the moment because of some, I am not saying traitors.\n\n\"Indeed many say, if I were the defence minister who allowed this state of affairs to happen, as an officer I could have just shot myself.\"\n\nHe then suggested that the word \"officer\" was \"incomprehensible\" to Shoigu. Stremousov lumped Shoigu and his generals together with \"corrupt marauders and other scum\" in the Russian defence ministry.\n\nPolitical analyst Sergey Markov said: \"Kirill Stremousov, deputy head of the Kherson region, was killed. It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over. He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Henichesk. With him in the car was a military commander Kotz, he did not die.\"\n\nPutin's puppet governor of Kherson expressed distress and dismay over Stremousov's death, as the Kremlin placeman in Sevastopol Mikhail Razvozhaev called his demise \"an irreparable loss\". On a video, Kherson \"governor\" Volodymyr Saldo, said: \"It is very hard for me to say that \"viceroy\" Kirill Stremousov died today.\"\n\nThe metadata on the video recorded by Saldo suggests it was recorded two hours before the first announcement of Stremousov's death. However Ukrainian sources queried whether the announcement of his death could be a Kremlin trick.\n\nIndependent We Can Explain media reported: \"Against the backdrop of a lack of details about the accident and the circumstances of his death, Ukrainian officials started saying the accident could be staged, and rumours about it in pro-Kremlin channels could be disinformation.\"\n\nFor more stories from where you live, visit InYourArea.\n\nFind recommendations for eating out, attractions and events near you here on our sister website 2Chill\n\nFind recommendations for dog owners and more doggy stories on our sister site Teamdogs", "source": {"uri": "walesonline.co.uk", "dataType": "news", "title": "WalesOnline"}, "authors": [{"uri": "dominic_picksley@walesonline.co.uk", "name": "Dominic Picksley", "type": "author", "isAgency": false}], "image": "https://i2-prod.walesonline.co.uk/incoming/article25478832.ece/ALTERNATES/s1200/0_PA-69686837.jpg", "eventUri": "eng-8166048", "sentiment": -0.2705882352941177, "wgt": 206, "relevance": 1, "stanza_neg": 10, "stanza_neu": 24, "stanza_pos": 0, "swn_neg": 34, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257055571", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "13:59:00", "dateTime": "2022-11-09T13:59:00Z", "dateTimePub": "2022-11-09T13:39:00Z", "dataType": "news", "sim": 0.8039215803146362, "url": "https://english.pravda.ru/news/hotspots/154738-krill_stremousov/", "title": "Kirill Stremousov, deputy head of the Kherson region, killed", "body": "Zelensky names conditions for which Ukraine would be willing to talk to Russia\n\nKirill Stremousov, deputy head of the Kherson region, was killed, WarGonzo Telegram channel said.\n\nAccording to military correspondents, Stremousov was killed in a car accident at Genichesk in the Kherson region. This was reported by his personal driver.\n\nAn RT source in law enforcement agencies confirmed reports about Stremousov's death. Circumstances of the accident are yet to be reported.\n\nRepresentatives for the regional administration also told journalists that the information about his death was true to fact. No other details were reported.", "source": {"uri": "english.pravda.ru", "dataType": "news", "title": "PravdaReport"}, "authors": [{"uri": "editorial_team@english.pravda.ru", "name": "Editorial Team", "type": "author", "isAgency": false}], "image": "https://english.pravda.ru/image/preview/article/7/3/8/154738_five.jpeg", "eventUri": "eng-8166048", "sentiment": -0.4509803921568627, "wgt": 205, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257279789", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:10:00", "dateTime": "2022-11-09T17:10:00Z", "dateTimePub": "2022-11-09T17:07:00Z", "dataType": "news", "sim": 0.800000011920929, "url": "https://nypost.com/2022/11/09/russian-official-in-ukraines-kherson-region-dies-in-crash/", "title": "Russian official in Ukraine's Kherson region dies in car crash", "body": "Kirill Stremousov, the Russian-appointed deputy head of Ukraine's Kherson region, was killed in a car crash Wednesday -- the same day Russian troops were ordered to retreat out of the region.\n\nStremousov, 45, is the most senior Russian-appointed official in occupied Ukraine to die since the start of the invasion in February.\n\nHis death was confirmed by his boss Vladimir Saldo, who is the Russia-backed acting governor of Kherson.\n\n\"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\" Saldo said.\n\nIn a video posted to his Telegram channel, Saldo said Stremousov was \"one of the brightest\" who \"was able to speak and deliver to people the truth about what is happening in the Kherson region.\"\n\nBefore becoming second in command of the occupied Kherson, Stremousov was a vocal blogger and local politician with an aggressive social media presence.\n\nShortly before his death on Wednesday, Stremousov denounced the so-called Ukrainian \"Nazis\" and claimed the Russian military was in \"full control\" of the south.\n\nHe had been sanctioned by both the US and the European Union and was wanted for treason by the Ukrainian police. He was a father of five children, with a sixth on the way.\n\nFew details about the fatal accident have been made available, but there have been several assassinations and attempted killings of top Russian-appointed leaders in occupied Ukraine since the start of the war, according to The Moscow Times.\n\nHis death comes as Ukrainian forces advance on Kherson -- forcing Russia to evacuate hundreds of thousands of people and send troops retreating to the east of the Dnipro River in a major victory for Ukraine.", "source": {"uri": "nypost.com", "dataType": "news", "title": "New York Post"}, "authors": [], "image": "https://nypost.com/wp-content/uploads/sites/2/2022/11/kirill-stremousov-kherson-deputy-russian-installed-comp.jpg?quality=75&strip=all&w=1024", "eventUri": "eng-8166048", "sentiment": -0.3568627450980392, "wgt": 204, "relevance": 1, "stanza_neg": 3, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257197567", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:57:00", "dateTime": "2022-11-09T15:57:00Z", "dateTimePub": "2022-11-09T15:56:00Z", "dataType": "news", "sim": 0.7921568751335144, "url": "https://www.geelongadvertiser.com.au/news/world/deputy-governor-of-russianoccupied-kherson-dies-in-mysterious-car-crash/news-story/3624a07f7e61496442ad811cf766f6e0", "title": "Key Putin ally mysteriously dies in car crash", "body": "The Moscow-installed deputy governor of Kherson - a disputed part of Ukraine which Russia is occupying - has died in a mysterious car crash.\n\nKirill Stremousov, 45, was killed in the supposed accident, according to Russian state media.\n\nThe highly-visible deputy head of the occupying regime died as Ukraine is expected to launch a major counteroffensive in the region.\n\nRussia is evacuating Kherson ahead of the predicted attack, but is believed to be forcing Ukrainians fleeing to head east towards Russia.\n\nEarlier today, hours before his death, Stremousov had typically accused the West of being behind the Ukrainian advance in Kherson.\n\nMany English and Polish-speaking mercenaries are among the advancing forces, he alleged, offering no proof.\n\nStremousov had claimed he was in the city helping people flee. The place he was killed is Russian controlled and 130 miles from Kherson city.\n\nUkrainian blogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe appeared to imply that Stremousov had many enemies for supporting the Russian occupation forces, which are now pulling back.\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened, then it was no Ukrainian Army spies killing him.\"\n\n\"Russia is in Kherson forever,\" Stremousov - who had worked as a handyman in the US - had boasted, ahead of losses which mean Putin's forces are on the retreat.\n\nBut the official also had enemies among Russians after blasting Putin's defence minister Sergei Shoigu for alleged incompetence in defending Kherson.\n\n\"There is no need to cast a shadow over the entire Russian Defence Ministry at the moment because of some, I am not saying traitors,\" he said last month.\n\nShoigu's \"untalented military commanders\" have \"not really bothered to answer for all the processes and holes that now exist\", he said.\n\nHe declared: \"Indeed many say, if I were the defence minister who allowed this state of affairs to happen, as an officer I could have just shot myself.\"\n\nHe then suggested that the word \"officer\" was \"incomprehensible\" to Shoigu.\n\nStremousov, a Ukrainian pro-Russian politician wanted in Kyiv for treason, lumped Shoigu and his generals together with \"corrupt marauders and other scum\" in the Russian defence ministry.\n\nPolitical analyst Sergey Markov said: \"Kirill Stremousov, deputy head of the Kherson region, was killed. It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Genichesk\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"", "source": {"uri": "geelongadvertiser.com.au", "dataType": "news", "title": "Geelong Advertiser"}, "authors": [], "image": "https://content.api.news/v3/images/bin/5a64f66a24771a375a32cc97daccba32", "eventUri": "eng-8166048", "sentiment": -0.4509803921568627, "wgt": 202, "relevance": 1, "stanza_neg": 10, "stanza_neu": 17, "stanza_pos": 0, "swn_neg": 27, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257285204", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:15:00", "dateTime": "2022-11-09T17:15:00Z", "dateTimePub": "2022-11-09T16:41:00Z", "dataType": "news", "sim": 0.7803921699523926, "url": "https://www.aol.com/news/russian-installed-official-ukraines-kherson-164056250.html", "title": "Russian-installed official in Ukraine's Kherson region dies in car crash", "body": "Russian-installed official in Ukraine's Kherson region dies in car crashNovember 10, 2022, 12:40 AM\n\n(Reuters) -One of Russia's most prominent officials in Ukraine was killed in a car crash on Wednesday, a blow to Moscow in the southern Kherson region amid growing talk it is poised to withdraw its forces from the city of the same name.\n\nThe death of Kirill Stremousov, deputy head of the Russian-installed local administration, was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nStremousov went from being an obscure blogger and local politician before the Russian invasion on Feb. 24 to become the number two figure in what Ukraine says is the illegal occupation of Kherson which it plans to overturn by force.\n\nHe was a highly visible face on social media, pumping out pro-Moscow statements. In the most recent, hours before his death, he denounced what he called Ukrainian \"Nazis\" and said the Russian military was in \"full control\" of the situation in the south.\n\nUkraine viewed him as a collaborator and a traitor.\n\n\"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\" Saldo, his boss, said.\n\nStremousov's death deepened the sense of disarray surrounding the defence of Kherson, from which Russia has evacuated thousands of residents in anticipation of a Ukrainian counter-offensive.\n\n(Reporting by Reuters, writing by Mark TrevelyanEditing by Andrew Osborn)\n\nTagsnews", "source": {"uri": "aol.com", "dataType": "news", "title": "Aol"}, "authors": [], "image": "https://media.zenfs.com/en/reuters.com/1f72d56f1fdaf06eacf275c416b2aba3", "eventUri": "eng-8166048", "sentiment": -0.3803921568627451, "wgt": 199, "relevance": 1, "stanza_neg": 5, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259085865", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:21:35", "dateTime": "2022-11-09T14:21:35Z", "dateTimePub": "2022-11-09T14:21:35Z", "dataType": "news", "sim": 0.7803921699523926, "url": "https://www.hindustantimes.com/world-news/russianinstalled-official-in-ukraine-s-kherson-region-dies-101668003513233.html", "title": "Russian-installed official in Ukraine's Kherson region dies in car crash", "body": "The death of Kirill Stremousov, deputy head of the Russian-installed local administration, was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nOne of Russia's most prominent officials in Ukraine was killed in a car crash on Wednesday, a blow to Moscow in the southern Kherson region amid growing talk it is poised to withdraw its forces from the city of the same name.\n\nThe death of Kirill Stremousov, deputy head of the Russian-installed local administration, was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nStremousov went from being an obscure blogger and local politician before the Russian invasion on Feb. 24 to become the number two figure in what Ukraine says is the illegal occupation of Kherson which it plans to overturn by force.\n\nHe was a highly visible face on social media, pumping out pro-Moscow statements. In the most recent, hours before his death, he denounced what he called Ukrainian \"Nazis\" and said the Russian military was in \"full control\" of the situation in the south.\n\nUkraine viewed him as a collaborator and a traitor.\n\n\"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\" Saldo, his boss, said.\n\nStremousov's death deepened the sense of disarray surrounding the defence of Kherson, from which Russia has evacuated thousands of residents in anticipation of a Ukrainian counter-offensive.", "source": {"uri": "hindustantimes.com", "dataType": "news", "title": "Hindustan Times"}, "authors": [{"uri": "reuters@hindustantimes.com", "name": "Reuters", "type": "author", "isAgency": false}], "image": "https://images.hindustantimes.com/img/2022/11/09/1600x900/UKRAINE-CRISIS-KHERSON-STREMOUSOV-0_1668003546012_1668003546012_1668003554723_1668003554723.JPG", "eventUri": "eng-8166048", "sentiment": -0.4431372549019608, "wgt": 199, "relevance": 1, "stanza_neg": 4, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257122111", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:53:00", "dateTime": "2022-11-09T14:53:00Z", "dateTimePub": "2022-11-09T14:53:00Z", "dataType": "news", "sim": 0.7803921699523926, "url": "https://interfax.com/newsroom/top-stories/84767/", "title": "Discover more", "body": "ROSTOV-ON-DON. Nov 9 (Interfax) - Kirill Stremousov, deputy head of the Kherson regional administration, was killed in a road accident on Wednesday, Valeria Petrusevich, head of the non-commercial organization Dobro Mira - Volontery Kryma (World's Good - Crimean Volunteers), said on social media.\n\n\"Kirill Stremousov, Kherson region deputy governor, has died. This information is accurate, I know for sure. Circumstances later,\" Petrusevich wrote on Telegram on Wednesday.\n\nThe regional administration confirmed to journalists that the report on Stremousov's death was true.\n\nKherson regional Health Minister Vadim Ilmiyev told journalists the accident took place on the road between Kherson and Armyansk.\n\n\"Indeed, I can confirm that Kirill was in a car crash. I haven't yet received reports on his death from medics. An ambulance rushed to the accident site,\" he said.\n\nActing Kherson Governor Vladimir Saldo said on Telegram that support would be provided to Stremousov's family. \"He was the father of five children, and a sixth child is expected to be born soon. Certainly, we will take care of them all, but unfortunately, this can't bring back Kirill,\" he said.\n\nSevastopol Governor Mikhail Razvozhayev offered his condolences on Stremousov's death.\n\n\"I have just learned about Kirill Stremousov's death. I personally met him just recently. He was a true patriot of Russia, brave and courageous, he remained in touch in any situation and considered it his duty to inform the Kherson region's residents of the ongoing events. The same was this morning. This is an irreparable loss,\" Razvozhayev wrote on Telegram.\n\nStremousov became deputy head of the Kherson region after Russian forces took it under control.", "source": {"uri": "interfax.com", "dataType": "news", "title": "interfax.com"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.3176470588235294, "wgt": 199, "relevance": 1, "stanza_neg": 4, "stanza_neu": 15, "stanza_pos": 1, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257134849", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:04:00", "dateTime": "2022-11-09T15:04:00Z", "dateTimePub": "2022-11-09T15:03:00Z", "dataType": "news", "sim": 0.772549033164978, "url": "https://www.thesun.co.uk/news/20373463/putin-installed-leader-kherson-killed-bizarre-propaganda/", "title": "Putin-installed Kherson leader killed in mystery crash in Ukraine", "body": "VLADIMIR Putin's puppet leader in occupied Kherson was killed in a mystery \"car crash\" today.\n\nFormer YouTuber Kirill Stremousov - reviled for a sick stunt swinging a baby round his head - had urged civilians to flee their homes while pumping out twisted pro-regime propaganda.\n\nThe exact circumstances of his death were unclear, but it came as Russian troops retreat in disarray from Kherson city.\n\nDeputy governor Stremousov, 45, had posted videos from speeding vehicles on the road.\n\nAnd earlier today he made unsubstantiated claims British and Polish mercenaries were driving the Ukrainian advance, offering no proof.\n\n\"Many have left. About 80,000 people were evacuated. We help everyone who wants to leave Kherson. I am now in Kherson myself,\" he said in one of his final social media posts.\n\nHe also insisted Russia was in \"full control\" of the situation despite the chaotic forced deportation of tens of thousands of civilians.\n\nStremousov was killed today near Henichesk, 130 miles from Kherson city on the border with Crimea, his personal driver told the War Gonzo project.\n\nVladimir Saldo, the Kremlin-installed acting governor of Kherson region, confirmed his deputy was dead.\n\nHe said: \"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\"\n\nUkrainian sources hinted the turncoat Putin mouthpiece might have been deliberately killed by the Russians.\n\nBlogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened - then it was no Ukrainian Army spies killing him.\"\n\nPolitical analyst Sergey Markov claimed a Russian commander was in the car with Stremousov and survived.\n\nHe said: \"It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Henichesk.\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"\n\nFormer fish food tycoon Stremousov was wanted for treason in Kyiv for siding with Russia after the invasion.\n\nHe reportedly once worked as a handyman and motivational speaker in the US and was a high-profile backer of pro-Putin Ukraine president Viktor Yanukovich who was overthrown in 2014.\n\nHe has also once beat a policeman in a brawl at a city council meeting, shot up a newspaper office and was involved in an attack on a police convoy.\n\nThe blogger and YouTuber sparked outrage worldwide after a video of him swinging his four-month-old daughter round his head.\n\nHe had virtually no political experience and was mostly known for spreading Covid conspiracies when he was appointed deputy governor in May.", "source": {"uri": "thesun.co.uk", "dataType": "news", "title": "The Sun"}, "authors": [{"uri": "felix_allen@thesun.co.uk", "name": "Felix Allen", "type": "author", "isAgency": false}], "image": "https://www.thesun.co.uk/wp-content/uploads/2022/11/newspress-collage-20373463-1668003014073.jpg?1668003028&strip=all&quality=100&w=1920&h=1080&crop=1", "eventUri": "eng-8166048", "sentiment": -0.0980392156862745, "wgt": 197, "relevance": 1, "stanza_neg": 14, "stanza_neu": 17, "stanza_pos": 1, "swn_neg": 32, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257179139", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:42:00", "dateTime": "2022-11-09T15:42:00Z", "dateTimePub": "2022-11-09T14:35:00Z", "dataType": "news", "sim": 0.7686274647712708, "url": "https://www.the-sun.com/news/6637178/putin-installed-leader-kherson-killed-bizarre-propaganda/", "title": "Putin-installed Kherson leader killed in mystery crash in Ukraine", "body": "VLADIMIR Putin's puppet leader in occupied Kherson was killed in a mystery \"car crash\" today.\n\nFormer YouTuber Kirill Stremousov - reviled for a sick stunt swinging a baby round his head - had urged civilians to flee their homes while pumping out twisted pro-regime propaganda.\n\nThe exact circumstances of his death were unclear, but it came as Russian troops retreat in disarray from Kherson city.\n\nDeputy governor Stremousov, 45, had posted videos from speeding vehicles on the road.\n\nAnd earlier today he made unsubstantiated claims British and Polish mercenaries were driving the Ukrainian advance, offering no proof.\n\n\"Many have left. About 80,000 people were evacuated. We help everyone who wants to leave Kherson. I am now in Kherson myself,\" he said in one of his final social media posts.\n\nHe also insisted Russia was in \"full control\" of the situation despite the chaotic forced deportation of tens of thousands of civilians.\n\nStremousov was killed today near Henichesk, 130 miles from Kherson city on the border with Crimea, his personal driver told the War Gonzo project.\n\nVladimir Saldo, the Kremlin-installed acting governor of Kherson region, confirmed his deputy was dead.\n\nHe said: \"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\"\n\nUkrainian sources hinted the turncoat Putin mouthpiece might have been deliberately killed by the Russians.\n\nBlogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened - then it was no Ukrainian Army spies killing him.\"\n\nPolitical analyst Sergey Markov claimed a Russian commander was in the car with Stremousov and survived.\n\nHe said: \"It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Henichesk.\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"\n\nFormer fish food tycoon Stremousov was wanted for treason in Kyiv for siding with Russia after the invasion.\n\nHe reportedly once worked as a handyman and motivational speaker in the US and was a high-profile backer of pro-Putin Ukraine president Viktor Yanukovich who was overthrown in 2014.\n\nHe has also once beat a policeman in a brawl at a city council meeting, shot up a newspaper office and was involved in an attack on a police convoy.\n\nThe convicted hooligan was also thrown out of Ukraine's socialist party and failed to get elected to parliament.\n\nIn 2017 he sparked outrage worldwide after a YouTube video of him swinging his four-month-old daughter round his head.\n\nHe said he could hear \"her bones are popping\" and claimed it promoted health.\n\nHe had virtually no political experience and was mostly known for spreading Covid conspiracies when he was appointed deputy governor in May.\n\nSince then he has become an outspoken figurehead for Putin's occupation and illegal annexation of four regions.\n\nHe also reportedly made enemies in the Russian armed forces after blaming battlefield setbacks on \"untalented military commanders\".\n\nAnd he suggested Putin's close pal, bumbling defence minister Sergei Shoigu, should \"shoot himself\".\n\nIn August Stremousov's boss, acting governor Vladimir Saldo, mysteriously vanished from public view amid claims he survived two assassination attempts.\n\nThe former mayor of Kherson was rushed to hospital after allegedly being poisoned by a chef, less than a month after a foiled car bomb plot.\n\nIt follows a string of mystery deaths of people linked to Putin this year.\n\nLast week the judge who sentenced captured Brits to death was shot and critically wounded in eastern Ukraine.", "source": {"uri": "the-sun.com", "dataType": "news", "title": "The US Sun"}, "authors": [{"uri": "felix_allen@the-sun.com", "name": "Felix Allen", "type": "author", "isAgency": false}], "image": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/11/newspress-collage-20373463-1668003014073.jpg?1667986646&strip=all&quality=100&w=1920&h=1080&crop=1", "eventUri": "eng-8166048", "sentiment": -0.0980392156862745, "wgt": 196, "relevance": 1, "stanza_neg": 19, "stanza_neu": 21, "stanza_pos": 1, "swn_neg": 41, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257065509", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:08:00", "dateTime": "2022-11-09T14:08:00Z", "dateTimePub": "2022-11-09T14:07:00Z", "dataType": "news", "sim": 0.7647058963775635, "url": "https://interfax.com/newsroom/top-stories/84762/", "title": "Discover more", "body": "ROSTOV-ON-DON. Nov 9 (Interfax) - Kirill Stremousov, deputy head of the Kherson regional administration, was killed in a road accident on Wednesday, Valeria Petrusevich, head of the non-commercial organization Dobro Mira - Volontery Kryma (World's Good - Crimean Volunteers), said on social media.\n\n\"Kirill Stremousov, Kherson region deputy governor, has died. This information is accurate, I know for sure. Circumstances later,\" Petrusevich wrote on Telegram on Wednesday.\n\nThe regional administration confirmed to journalists that the report on Stremousov's death was true.", "source": {"uri": "interfax.com", "dataType": "news", "title": "interfax.com"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.2, "wgt": 195, "relevance": 1, "stanza_neg": 2, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257140847", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:09:00", "dateTime": "2022-11-09T15:09:00Z", "dateTimePub": "2022-11-09T15:09:00Z", "dataType": "news", "sim": 0.7607843279838562, "url": "https://www.euronews.com/2022/11/09/ukraine-war-moscow-installed-deputy-governor-of-kherson-died-in-car-crash", "title": "Moscow-installed deputy governor of Kherson died in 'car crash'", "body": "The Moscow-installed senior official of the occupied region of Kherson in Ukraine, Kirill Stremousov, died on Wednesday, according to Russian media and the regional governor.\n\nStremousov, who acted as the deputy governor in Kherson, was killed in \"a car crash\", the governor's office stated.\n\nStremousov was one of the most vocal proponents of Russia's full-scale invasion of Ukraine in late February. He has been wanted for treason by the Ukrainian authorities since his appointment two months into the invasion.\n\n\"Kirill Stremousov perished. This is a huge tragedy, an irreparable loss,\" Sergei Aksionov, the Kremlin-installed leader of Crimea, said on Telegram.\n\nKherson is one of the four regions -- together with Donetsk, Luhansk and Zaporizhzhia -- illegally annexed by Moscow on 30 September after sham referendums were held on their independence from Ukraine.\n\nStremousov's death came as Russia-backed authorities in Kherson are said to be likely beginning a new phase of \"evacuations\" from the city, according to the US-based Institute for the Study of War. Kyiv has called them \"forced deportations\".\n\nStremousov has been active on social media in recent days, imploring the residents of the region to leave for Moscow-held territories. He said earlier that 7 November would be the last day of centrally-organised evacuations from Kherson city.\n\nMeanwhile, Russian soldiers continue to dig in around the city, with Ukrainian forces inching closer as their offensive in the region moves forward.\n\nKherson is the only regional capital of Ukraine that Moscow captured since the February invasion.", "source": {"uri": "euronews.com", "dataType": "news", "title": "Euronews English"}, "authors": [], "image": "https://static.euronews.com/articles/stories/07/18/30/42/1000x563_cmsv2_11e31cb7-140c-529e-ac15-f0f1a711c3fb-7183042.jpg", "eventUri": "eng-8166048", "sentiment": -0.3098039215686275, "wgt": 194, "relevance": 1, "stanza_neg": 3, "stanza_neu": 9, "stanza_pos": 1, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257134541", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:03:00", "dateTime": "2022-11-09T15:03:00Z", "dateTimePub": "2022-11-09T14:35:00Z", "dataType": "news", "sim": 0.7568627595901489, "url": "https://www.thescottishsun.co.uk/news/9737815/putin-installed-leader-kherson-killed-bizarre-propaganda/", "title": "Putin-installed leader killed in Kherson after warning civilians to flee city", "body": "VLADIMIR Putin's puppet leader in occupied Kherson was killed in a mystery \"car crash\" today.\n\nFormer YouTuber Kirill Stremousov - famed for a sick stunt swinging a baby round his head - had urged civilians to flee their homes while pumping out twisted pro-regime propaganda.\n\nThe exact circumstances of his death were unclear, but it came as Russian troops retreat from Kherson city.\n\nDeputy governor Stremousov, 45, had posted videos from speeding vehicles on the road.\n\nAnd earlier today he made unsubstantiated claims British and Polish mercenaries were driving the Ukrainian advance, offering no proof.\n\n\"Many have left. About 80,000 people were evacuated. We help everyone who wants to leave Kherson. I am now in Kherson myself,\" he said in one of his final social media posts.\n\nHe also insisted Russia was in \"full control\" of the situation despite the chaotic forced deportation of tens of thousands of civilians.\n\nStremousov was killed today near Henichesk, 130 miles from Kherson city on the border with Crimea, his personal driver told the War Gonzo project.\n\nVladimir Saldo, the Kremlin-installed acting governor of Kherson region, confirmed his deputy was dead.\n\nHe said: \"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\"\n\nUkrainian sources hinted the turncoat Putin mouthpiece might have been deliberately killed by the Russians.\n\nBlogger and politician Anatoly Shariy said: \"Several sources confirmed the death of Stremousov.\n\n\"If this is true, then I understand what kind of 'traffic accident' this was right now when the surrender of Kherson is obvious.\"\n\nHe added: \"And the main thing - if he was killed, and exactly in the way I was told it happened - then it was no Ukrainian Army spies killing him.\"\n\nPolitical analyst Sergey Markov claimed a Russian commander was in the car with Stremousov and survived.\n\nHe said: \"It's all very strange.\n\n\"He kept saying that Kherson could not be handed over and it would not be handed over.\n\n\"He died on the day when they began to actively talk about the surrender of Kherson.\n\n\"He died not from a terrorist attack, but in an accident. Not in Kherson, but in Henichesk.\n\n\"With him in the car was a military commander Kotz, he did not die.\n\n\"All this is very strange.\"\n\nFormer fish food tycoon Stremousov was wanted for treason in Kyiv for siding with Russia after the invasion.", "source": {"uri": "thescottishsun.co.uk", "dataType": "news", "title": "The Scottish Sun"}, "authors": [], "image": "https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2022/11/newspress-collage-20373463-1668003014073.jpg?1668004619&strip=all&quality=100&w=1920&h=1080&crop=1", "eventUri": "eng-8166048", "sentiment": -0.0980392156862745, "wgt": 193, "relevance": 1, "stanza_neg": 11, "stanza_neu": 17, "stanza_pos": 0, "swn_neg": 28, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257063503", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:06:00", "dateTime": "2022-11-09T14:06:00Z", "dateTimePub": "2022-11-09T13:41:00Z", "dataType": "news", "sim": 0.7568627595901489, "url": "https://qtelegram.com/media-strange-death-of-collaborator-stremousov-became-known/38660/", "title": "Media: Strange death of collaborator Stremousov became known - The Quebec provincial newspaper", "body": "The so-called \"deputy head of the Kherson regional administration\", collaborator Kirill Stremousov, allegedly died as a result of an accident. This was stated by several Russian media at once.\n\nThe details are still unknown. But it sounds very interesting against the backdrop of reports from the Kherson region.\n\nLater, in the press service of the so-called \"regional administration\" ; confirmed that Stremousov died in an accident.\n\nIt should be noted that the SBU and the Office of the Prosecutor General told Stremousov about suspicion of collaborationism at the end of September.\n\narmed formations of the Russian Federation and representatives of the aggressor state took a number of measures to prepare and organize an illegal referendum.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.3019607843137255, "wgt": 193, "relevance": 1, "stanza_neg": 2, "stanza_neu": 4, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257098263", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:34:00", "dateTime": "2022-11-09T14:34:00Z", "dateTimePub": "2022-11-09T14:33:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://www.dailystar.co.uk/news/world-news/pro-russian-governor-putin-installed-28449229", "title": "Putin's Pro-Russian governor and 'face of occupied Ukraine' killed in car crash", "body": "The deputy head of Russia's puppet government, installed by Vladimir Putin, in the occupied Ukrainian province of Kherson has died in a car accident, according to Russian media reports.\n\nKirill Stremousov, 45, is believed to have died in the incident near Henichesk, a port city along the Sea of Azov in the Kherson Oblast of southern Ukraine.\n\nMikhail Razvozzhayev, governor of Sevastopol in Crimea, confirmed Stremousov's death via Telegram.\n\nREAD MORE: Fears Putin may 'escalate war' as Ukraine frontline is 'littered with Russian dead'\n\n\"I've just heard about the death of Kirill Stremousov,\" Razvozzhayev wrote. \"He was a true patriot of Russia, brave and courageous... So it was this morning,\" he wrote.\n\n\"This is an irreparable loss. Condolences to family and friends.\"\n\nThe BBC's Ukraine correspondent, James Waterhouse, said that Stremousov was \"hated\" by Kyiv and was the face of Russian occupation there.\n\nStremousov was listed as \"wanted\" by the Ukrainian security service (SBU) on charges of treason.\n\nHe was also sanctioned by the European Union for providing support and promoting policies that undermine the territorial integrity, sovereignty and independence of Ukraine.\n\nUKrainian MP Oleksiy Goncharenko commented after Stremousov's death was announced: \"Kherson collaborator Kirill Stremousov died in an accident. This is a traitor who went over to the side of Russia. He actively opposed the surrender of Kherson and said that Russia is here forever. And then he mysteriously dies.\"\n\nIn the 2019 Ukrainian parliamentary election Stremousov was a candidate for the People's Deputy of Ukraine. He receive just under 2% of the vote.\n\nDuring the Covid-19 pandemic, Stremousov promoted anti-vaxx conspiracy theories, claiming there were \"US biolabs in Ukraine\".\n\nHe also urged Ukrainians to throw away their masks and break lockdown restrictions.\n\nStremousov had more than once been arrested for attacking journalists, including a 2019 attack on a newspaper office in Kherson and a violent attack on Dmytro Bagnenko, who was writing an expose of Russian secret service operations in Ukraine.\n\nIn early October, as the Russian advance in Ukraine crumbled, and Ukrainian forces began to push into the Kherson region, Stremousov blamed the Russian army's \"incompetent commanders\" .\n\nHe controversially added that the Russian defence minister Sergei Shoigu had \"allowed this situation to happen\", suggesting that Shoigu should shoot himself.\n\nTo stay up to date with all the latest news, make sure you sign up to one of our newsletters here\n\nREAD NEXT:\n\nUkraine's elite 'Shaman' special forces 'always shoot Russians in the balls' Brit facing death sentence 'wants to see his children' as he's paraded on Russia TV US Army vet returning to Ukraine calls Russians 'clowns' over £40k bounty on his head Putin's 'dreadful mistake' realised as scared and hungry troops quit frontline", "source": {"uri": "dailystar.co.uk", "dataType": "news", "title": "Daily Star"}, "authors": [{"uri": "michael_moran@dailystar.co.uk", "name": "Michael Moran", "type": "author", "isAgency": false}], "image": "https://i2-prod.dailystar.co.uk/incoming/article28449272.ece/ALTERNATES/s1200/0_PAY-Kirill-Stremousov-dead-4-east2west-news.jpg", "eventUri": "eng-8166048", "sentiment": -0.2862745098039216, "wgt": 192, "relevance": 1, "stanza_neg": 6, "stanza_neu": 21, "stanza_pos": 1, "swn_neg": 28, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257111676", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:44:00", "dateTime": "2022-11-09T14:44:00Z", "dateTimePub": "2022-11-09T14:44:00Z", "dataType": "news", "sim": 0.7490196228027344, "url": "https://www.dw.com/en/senior-russia-installed-official-in-ukraines-kherson-dies/a-63699774", "title": "Senior Russia-installed official in Ukraine's Kherson dies", "body": "The Russian-installed deputy head of Ukraine's region of Kherson, Kirill Stremousov, has died, officials said on Wednesday.\n\n\"Kirill Sergeyevich Stremousov has died,\" the head of Russia-annexed Crimea, Sergei Aksyonov, said on messaging app Telegram, calling him a \"true fighter\" and a \"Russian patriot.\" Aksyonov did not specify the cause of the death.\n\nAnother Russian-installed official in Kherson said he was involved in a road traffic accident.\n\n\"It's very hard for me to say that Kirill Stremousov died today. He died in the Kherson region, moving in a car that got into an accident,\" said Acting Governor of the Kherson region Volodymyr Saldo.\n\nStremousov, 45, was one of the highest-profile officials in Ukraine supporting Russia's invasion.\n\nThe news coincides with images circulating online showing the Darivka bridge on the highway heading east out of the regional capital almost completely destroyed and lying in the River Dnipro. It was not immediately clear how the bridge had been destroyed or by whom.\n\nThe regional capital, also called Kherson, was the first major urban center Russia captured after its February 24 invasion. The southern region borders Crimea, which Russia illegally annexed in 2014.\n\nThis comes amid rumors of an impending Ukrainian counteroffensive in Kherson and also rumors of a preemptive Russian withdrawal from parts of the region. However, Kyiv had warned that some images of apparently deserted regional government buildings without Russian flags flying might be disinformation or a trap or both.\n\nUkraine's military is advancing on the city but has kept details of its operations vague.\n\nPrior to his death, Stremousov had called on residents to evacuate Kherson and head east saying it was for their own safety -- Ukraine described the appeal as a program of forced deportations.\n\nHere are the other main headlines from the war in Ukraine on Wednesday, November 9:\n\nThe European Commission unveiled an €18 billion (roughly $18 billion) economic support plan for Ukraine aimed at helping it through 2023.\n\nAccording to the plan, each month the EU will send €1.5 billion in the form of loans.\n\n\"We are presenting this new financial package for Ukraine at a time of acute needs for the country, as Russia's relentless attacks continue to batter key infrastructure,\" said Commission Vice President Valdis Dombrovskis.\n\nThe International Monetary Fund estimates Ukraine will need $3-4 billion a month in 2023.\n\nThe EU is hoping the US will match its contribution, while gap funding will come by way of other donors and financial institutions.\n\nThe financial aid package still needs to be approved by EU member states.\n\nUkrainian President Volodymyr Zelenskyy took to Twitter after the announcement, saying \"this shows the true solidarity of the EU,\" and also including an appeal for Ukraine to eventually join the bloc.", "source": {"uri": "dw.com", "dataType": "news", "title": "Deutsche Welle"}, "authors": [], "image": "https://static.dw.com/image/63696958_6.jpg", "eventUri": "eng-8166048", "sentiment": -0.4274509803921569, "wgt": 191, "relevance": 1, "stanza_neg": 5, "stanza_neu": 17, "stanza_pos": 1, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257593432", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "23:04:00", "dateTime": "2022-11-09T23:04:00Z", "dateTimePub": "2022-11-09T22:49:00Z", "dataType": "news", "sim": 0.7411764860153198, "url": "https://maps.southfront.org/deputy-head-of-kherson-regional-administration-kirill-stremousov-died-in-road-traffic-incident/", "title": "Deputy Head Of Kherson Regional Administration Kirill Stremousov Died In Road Traffic Incident", "body": "On november 9, the deputy head of the Kherson regional administration Kirill Stremousov died in a road traffic incident. The fatal accident took place near the town of Genichesk, where the Kherson regional administration was transferred amid the evacuation of civilians from the city of Kherson.\n\nThe head of the Ministry of Health of the Kherson region, official data on what happened to the deputy head of the region would be revealed later.\n\nThe real reason behind the incident is yet to be revealed. Presumably, the culprit of the accident was a truck driver who made a dangerous maneuver. The driver of Stremousov lost control, trying to avoid a collision.\n\nKirill Stremousov was 45 years old. He has five children left and the sixth will be born soon. The head of the region promised to take care of his relatives.\n\n\"Kirill was one of the brightest people who are able to speak and present the truth to people about what is happening in the Kherson region. He worked without a machine gun. He worked with his word and his ability to speak. He has been on the front line, he has been in the rear. He visited both the territory of the region and Kherson itself. Wherever he was, he spoke purely and sincerely about what was happening,\" said acting Governor of the Kherson region Vladimir Saldo.\n\nIn 2009, Stremousov entered politics and joined the ranks of the Socialist Party of Ukraine. At the same time, he created the local media TavriaNews. In 2021, he became a member of the pro-Russian party Derzhava.\n\nStremousov headed the Rescue Committee for Peace and Order in the Kherson region after the Russian military entered the city. After the civil-military administration was established in the region, he became deputy head of the region responsible for family, youth, sports and information policies.\n\nHe was very active in the social media and was one of those who covered the ongoing military and political developments in the region on a daily basis. He wrote the last message on the morning of November 9 in Telegram, stating that \"the situation in the region is under full control of the Russian military.\"\n\nOn November 9, he was in Kherson and was helping with the evacuation of civilians to the left bank of the Dnieper River. He stressed that the withdrawal of residents of the right-bank part is the main security issue in the Kherson region .", "source": {"uri": "maps.southfront.org", "dataType": "news", "title": "maps.southfront.org"}, "authors": [], "image": "https://s2.cdnstatic.space/wp-content/uploads/2022/11/Str-4.jpg", "eventUri": "eng-8166048", "sentiment": -0.1372549019607843, "wgt": 189, "relevance": 1, "stanza_neg": 3, "stanza_neu": 19, "stanza_pos": 2, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257458276", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "20:15:00", "dateTime": "2022-11-09T20:15:00Z", "dateTimePub": "2022-11-09T19:50:00Z", "dataType": "news", "sim": 0.7411764860153198, "url": "https://www.rocketnews.com/2022/11/a-russian-appointed-official-died-in-a-car-crash-in-ukraines-kherson/", "title": "A Russian-appointed official died in a car crash in Ukraine's Kherson - RocketNews", "body": "Kirill Stremousov, deputy head of the Russian-backed Kherson administration, in his office in Kherson on July 20. A portrait of Russian President Vladimir Putin is on the wall behind him.\n\nKirill Stremousov, the public face of the Russian occupation of Ukraine's Kherson region, has died in a car accident, according to the collaborationist government there. The region's Moscow-installed administration head, Vladimir Saldo, announced the death Wednesday on the Telegram social media app, calling Stremousov, his acting deputy governor and occupation spokesman, \"one of the brightest.\" There were no further details about the reported death. Stremousov, Ukrainian by birth, was a 45-year-old pro-Russian propagandist known for posting voluminous videos -- often from his car. \"The 'Ukronazis,' pushed by their American masters, are forced to face certain death,\" he said in one recent video, repeating Moscow's false claims that Ukraine is run by U.S.-backed Nazis. Stremousov insisted that Russia's victory was inevitable, but that has become more difficult to sell in recent weeks as Russia suffered more defeats in the region. On Wednesday, Moscow announced it was pulling troops out of Kherson city, but the Ukrainian government said it saw no signs Russian forces were leaving without a fight. Kherson is a strategically and symbolically important regional center that fell relatively easily to the Russians early in the war.\n\nStremousov had a colorful, eccentric past. In a video he posted on YouTube in 2017, he holds his infant daughter by the arm and leg and swings her around as a form of what he calls exercise, which sparked accusations online of child abuse. Stremousov ran unsuccessfully for mayor of Kherson and the Ukrainian parliament, and became a well-known opponent of vaccines during the COVID-19 pandemic. He initially served in the Kherson region as a Ukrainian government fisheries official. Later, he fashioned himself into a gadfly and political blogger who pressed the government to help ordinary citizens. Roman Tsviakh, a fellow civic activist, who now lives in Poland, recalled that Stremousov publicly confronted officials after some citizens fell and broke bones in an ice storm a few years back. The next day, the sidewalks were covered in salt, he recalled. \"He seemed to me to be an honest person who really wanted to work in the interest of people,\" said Volodymyr Marus, a journalist who helped train Stremousov how to work as a civic activist. But he has since changed his mind about the collaborator. Ukrainian intelligence officials and past associates told NPR that Stremousov had a thirst for wealth and began using his blog to extort money from local businesses in exchange for not publicizing their wrongdoing. Tsviakh says this behavior was not unusual, but part of Kherson's culture of corruption, which made the region an easy target for Russian infiltration in advance of the February invasion.\n\n\"People like Stremousov evolved because of a broken system,\"Tsviakh said. Stremousov allied himself with officials such as Saldo and others who publicly switched sides and backed the Russians in February. \"When the war began, all of them started to work as collaborators,\" said Marus. \"They were not pro-Russian. These were just people who wanted money. They had no sense of patriotism or purpose. They are simply traitors to Ukraine.\" Kateryna Malofieieva contributed to this story.\n\n...", "source": {"uri": "rocketnews.com", "dataType": "news", "title": "RocketNews | Top News Stories From Around the Globe"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.3411764705882353, "wgt": 189, "relevance": 1, "stanza_neg": 4, "stanza_neu": 24, "stanza_pos": 2, "swn_neg": 30, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257206653", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:05:00", "dateTime": "2022-11-09T16:05:00Z", "dateTimePub": "2022-11-09T16:05:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.abc.net.au/news/2022-11-10/russia-orders-withdrawal-of-troops-from-urkaines-kherson-region/101636834", "title": "Russia withdraws troops from west bank of Kherson's Dnipro River", "body": "Russian Defence Minister Sergei Shoigu has ordered his troops to withdraw from the west bank of the Dnipro River in the face of Ukrainian attacks near the southern city of Kherson.\n\nThe announcement marked one of Russia's most significant retreats and a potential turning point in the war, now nearing the end of its ninth month.\n\nIn televised comments, General Sergei Surovikin, in overall command of the war, said it was no longer possible to supply Kherson city.\n\nHe said he proposed to take up defensive lines on the eastern bank of the river.\n\nThe news followed weeks of Ukrainian advances towards the city and a race by Russia to relocate more than 100,000 of its residents.\n\nMr Shoigu responded: \"I agree with your conclusions and proposals. Proceed with the withdrawal of troops and take all measures to transfer forces across the river.\"\n\nIt comes as one of Moscow's most prominent officials in the Kherson region was reportedly killed in a car crash on Wednesday.\n\nThe death of Kirill Stremousov, deputy head of the Russian-installed local administration, was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nMr Stremousov went from being an obscure blogger and local politician before the Russian invasion on February 24 to become the number two figure in what Ukraine says is the illegal occupation of Kherson, which it plans to overturn by force.\n\nMr Stremousov was a highly visible face on social media, pumping out pro-Moscow statements.\n\nIn the most recent, hours before his death, he denounced what he called Ukrainian \"Nazis\" and said the Russian military was in \"full control\" of the situation in the south.\n\nUkraine viewed him as a collaborator and a traitor.\n\n\"It is very hard for me to say that Kirill Stremousov died today,\" Mr Saldo said.\n\nMr Stremousov, one of the highest profile occupation figures, had hinted in recent days that Moscow might pull its forces out of the Russian-controlled pocket on the west bank of the Dnipro, the most closely watched sector of the front line.", "source": {"uri": "abc.net.au", "dataType": "news", "title": "Australian Broadcasting Corporation"}, "authors": [], "image": "https://live-production.wcms.abc-cdn.net.au/bdf4e3f537085da76fd0ece26465e6bb?impolicy=wcms_crop_resize&cropH=2378&cropW=4228&xPos=0&yPos=0&width=862&height=485", "eventUri": "eng-8166048", "sentiment": -0.2862745098039216, "wgt": 188, "relevance": 1, "stanza_neg": 3, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257103189", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:38:00", "dateTime": "2022-11-09T14:38:00Z", "dateTimePub": "2022-11-09T14:37:00Z", "dataType": "news", "sim": 0.729411780834198, "url": "https://www.urdupoint.com/en/world/kherson-deputy-heads-state-being-clarified-1592039.html", "title": "Kherson Deputy Heads State Being Clarified, Reports About Death Unofficial - Authorities - UrduPoint", "body": "The Kherson Health Ministry confirmed on Wednesday only the fact of an accident involving Kirill Stremousov, the deputy head of the regional administration, and said that information about his death was not official\n\nKHERSON (UrduPoint News / Sputnik - 09th November, 2022) The Kherson Health Ministry confirmed on Wednesday only the fact of an accident involving Kirill Stremousov, the deputy head of the regional administration, and said that information about his death was not official.\n\n\"An ambulance team went to the scene of the accident. Information about his death is not official. As soon as doctors assess his condition, we will provide information,\" Kherson Health Minister Vadim Ilmiyev was quoted as saying by the health department.", "source": {"uri": "urdupoint.com", "dataType": "news", "title": "UrduPoint"}, "authors": [], "image": "https://photo-cdn.urdupoint.com/media/2022/11/_3/420x350/pic_1668004528.jpg", "eventUri": "eng-8166048", "sentiment": -0.5058823529411764, "wgt": 186, "relevance": 1, "stanza_neg": 1, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257178788", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:41:00", "dateTime": "2022-11-09T15:41:00Z", "dateTimePub": "2022-11-09T15:41:00Z", "dataType": "news", "sim": 0.7254902124404907, "url": "https://www.dw.com/en/ukraine-russia-orders-withdrawal-of-troops-from-kherson-in-a-major-retreat-updates/a-63699774", "title": "Russia orders troops fall back from Kherson city", "body": "Russian Defense Minister Sergei Shoigu ordered his troops to withdraw from the southern city of Kherson on Wednesday, marking a significant retreat for Russia.\n\nThe city of Kherson is situated to the north of the Dnipro River on the left bank.\n\nDefense Minister Shoigu and General Sergey Surovikin said that troops should regroup on the other side of the river, as Ukrainian forces advance.\n\n\"Having comprehensively assessed the current situation, it is proposed to take up defence along the left (eastern) bank of the Dnipro River,\" said Surovikin in a televised briefing.\n\nSurovikin said that it was no longer possible to deliver supplies to the city of Kherson and other areas on the left bank of the river; Shoigu agreed with his proposal to retreat and set up defenses on the other side.\n\n\"Proceed with the withdrawal of troops and take all measures to ensure the safe transfer of personnel, weapons and equipment across the Dnipro River,\" Shoigu told Surovikin.\n\nShoigu was on a visit to the region for briefings with military commanders.\n\nThe news coincided with images circulating online showing the Darivka bridge on the highway heading east out of the regional capital almost completely destroyed and lying in the River Dnipro. It was not immediately clear how the bridge had been destroyed or by whom.\n\nImages had also circulated earlier in the week of the regional government building in Kherson apparently without a security presence and without Russian flags visible. However, Kyiv had warned at the time that some of these images might be disinformation or a trap or both.\n\nSurovikin told Shoigu that some 115,000 people had been removed from the western bank of the Dnipro.\n\nUkraine defines the movement of these people towards Russian occupied territory as deportation.\n\nKherson is one of the regions Russia recently declared annexed following so-called referendums.The regional capital of the same name was also the first major city Russia seized following its February 24 invasion. Kherson borders Crimea, which Russia illegally annexed in 2014.\n\nHere are the other main headlines from the war in Ukraine on Wednesday, November 9:\n\nA senior advisor in Ukraine's presidency told Reuters news agency that it was still too soon to talk about a Russian withdrawal from the city of Kherson.\n\n\"Until the Ukrainian flag is flying over Kherson, it makes no sense to talk about a Russian withdrawal,\" Mykhailo Podolyak said in a statement to Reuters.\n\nPodolyak said that Russian forces remained in Kherson, so appeared to be adopting a cautious stance.\n\n\"Ukraine does not take these statements (by Russia) into consideration,\" he said.\n\n\"It is still too early to talk about the withdrawal of Russian troops from Kherson: a grouping of the Armed Forces of the Russian Federation is being maintained in the city, and additional manpower is being pulled into the region,\" Podolyak said.\n\nThis follows the Russian Defense Minister's earlier announcement that troops would be withdrawing from the west bank of the Dnipro River.\n\nMeanwhile, earlier on Wednesday, officials said the Russian-installed deputy head of Kherson region, Kirill Stremousov, had died.\n\n\"Kirill Sergeyevich Stremousov has died,\" the head of Russia-annexed Crimea, Sergei Aksyonov, said on messaging app Telegram, calling him a \"true fighter\" and a \"Russian patriot.\" Aksyonov did not specify the cause of the death.\n\nAnother Russian-installed official in Kherson said he was involved in a road traffic accident.\n\n\"It's very hard for me to say that Kirill Stremousov died today. He died in the Kherson region, moving in a car that got into an accident,\" said Acting Governor of the Kherson region Volodymyr Saldo.\n\nStremousov, 45, was one of the highest-profile officials in Ukraine supporting Russia's invasion.\n\nUkraine's military is advancing on the city but has kept details of its operations vague.\n\nPrior to his death, Stremousov had called on residents to evacuate Kherson and head east saying it was for their own safety -- Ukraine described the appeal as a program of forced deportations.\n\nThe European Commission unveiled an €18 billion (roughly $18 billion) economic support plan for Ukraine aimed at helping it through 2023.\n\nAccording to the plan, each month the EU will send €1.5 billion in the form of loans.\n\n\"We are presenting this new financial package for Ukraine at a time of acute needs for the country, as Russia's relentless attacks continue to batter key infrastructure,\" said Commission Vice President Valdis Dombrovskis.\n\nThe International Monetary Fund estimates Ukraine will need $3-4 billion a month in 2023.\n\nThe EU is hoping the US will match its contribution, while gap funding will come by way of other donors and financial institutions.\n\nThe financial aid package still needs to be approved by EU member states.\n\nUkrainian President Volodymyr Zelenskyy took to Twitter after the announcement, saying \"this shows the true solidarity of the EU,\" and also including an appeal for Ukraine to eventually join the bloc.", "source": {"uri": "dw.com", "dataType": "news", "title": "Deutsche Welle"}, "authors": [], "image": "https://static.dw.com/image/63696958_6.jpg", "eventUri": "eng-8166048", "sentiment": -0.2862745098039216, "wgt": 185, "relevance": 1, "stanza_neg": 10, "stanza_neu": 28, "stanza_pos": 1, "swn_neg": 39, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258454946", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "14:22:00", "dateTime": "2022-11-10T14:22:00Z", "dateTimePub": "2022-11-10T14:22:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.daily-sun.com/post/655363/Deputy-head-of-Kherson-killed-in-road-accident", "title": "Deputy head of Kherson killed in road accident     | Daily Sun |", "body": "The deputy head of Russia's Kherson Region, Kirill Stremousov, has been killed in a car accident, the top local official Vladimir Saldo confirmed on Wednesday. The region's health minister, Vadim Ilmiev, told the media that Stremousov had been involved in a traffic incident on a road connecting Kherson to the town of Armyansk in northern Crimea.\n\nStremousov often spoke on behalf of the regional administration, particularly when it came to the situation in the city of Kherson. He gave regular updates on social media and regularly talked to journalists about the region's affairs. Just this morning, the late official revealed the latest information about the battlefield situation, reporting that Ukrainian attempts to advance in a town some 50km to the north from Kherson had been thwarted by Russian troops.\n\nKherson is located on the right bank of the Dnieper River and is relatively close to Ukrainian positions. The regional administration urged civilians to leave the city due to the threat from Ukrainian forces and has moved its headquarters to the other side of the river.\n\nStremousov came to prominence in the national media after earlier having a brush with death. In September, his office in Kherson was hit by a Ukrainian rocket, but he was not there due to a scheduled appearance on a talk show. The blast injured several workers of the administration.", "source": {"uri": "daily-sun.com", "dataType": "news", "title": "Daily Sun"}, "authors": [{"uri": "daily_sun@daily-sun.com", "name": "Daily Sun", "type": "author", "isAgency": false}], "image": "https://www.daily-sun.com/assets/news_images/2022/11/10/Kirill-ds-1.jpg", "eventUri": "eng-8166048", "sentiment": -0.2705882352941177, "wgt": 184, "relevance": 1, "stanza_neg": 2, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258990519", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "22:58:00", "dateTime": "2022-11-10T22:58:00Z", "dateTimePub": "2022-11-10T22:49:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.newindianexpress.com/world/2022/nov/09/moscow-installed-official-in-ukraines-kherson-dies-in-car-crash-2516627.html", "title": "Moscow-installed official in Ukraine's Kherson dies in car crash  ", "body": "Stremousov, 45, was one of the highest-profile officials in Ukraine supporting Moscow's offensive.\n\nThe Moscow-installed deputy head of Ukraine's southern Kherson region, Kirill Stremousov, has died in a car crash, officials said Wednesday.\n\nStremousov, 45, was one of the highest-profile officials in Ukraine supporting Moscow's offensive.\n\nStremousov's aide, speaking to AFP, confirmed his death.\n\n\"I confirm the death of Kirill Sergeyevich,\" the aide said, referring to Stremousov by his first name and patronymic.\n\nKherson's Russian-appointed acting governor, Vladimir Saldo, called his passing \"tragic,\" saying his car got into an accident in the region.\n\nSaldo called Stremousov one of the \"brightest\" people he has known and said he leaves behind five children, with a sixth due soon.\n\nThe head of Russia-annexed Crimea, Sergei Aksyonov, called Stremousov a \"true fighter\" and a \"Russian patriot.\"\n\nThe region's main city, also called Kherson, was the first urban hub to be captured by Russia after President Vladimir Putin sent troops into Ukraine on February 24.\n\nUkrainian troops are now advancing towards the city and causing heavy losses among Russian troops.\n\nRussian forces have for weeks organised evacuation of Kherson residents to Russia and other Moscow-controlled regions, which Kyiv has condemned as a mass deportation.", "source": {"uri": "newindianexpress.com", "dataType": "news", "title": "The New Indian Express"}, "authors": [], "image": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/11/9/w600X390/Stremousov1.jpg", "eventUri": "eng-8166048", "sentiment": -0.2313725490196078, "wgt": 184, "relevance": 1, "stanza_neg": 3, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257269682", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:01:00", "dateTime": "2022-11-09T17:01:00Z", "dateTimePub": "2022-11-09T16:58:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://metro.co.uk/2022/11/09/russian-installed-deputy-head-of-kherson-region-killed-in-car-crash-17730777/", "title": "Russian-installed 'deputy head' of Kherson region 'killed in car crash'", "body": "One of Russia's top officials in Ukraine was killed in a car crash today, his boss said.\n\nKirill Stremousov, 45, was installed as 'deputy governor' of Kherson region, a port city on the Black Sea.\n\nThe death of a major official of the Russian-installed local administration comes amid a struggle to keep military control of the area for Vladimir Putin's forces.\n\nRussian troops were reportedly ordered to withdraw from the area today in a major humiliation for Putin as It is the only regional capital the Kremlin had seized during the eight-month war.\n\nStremousov's death was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nBefore the Russian invasion on February 24, Stremousov was an obscure blogger and local politician.\n\nBut he want on to become the number two figure in what Ukraine says is the illegal occupation of Kherson which it plans to overturn by force.\n\nHe was a highly visible face on social media, pumping out pro-Moscow statements.\n\nHours before his death, he had denounced what he called Ukrainian 'Nazis' and said the Russian military was in 'full control' of the situation in the south.\n\nUkraine viewed him as a collaborator and a traitor.\n\nSaldo, his boss, said, said: 'It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident.'\n\nRussia has evacuated thousands of residents in anticipation of a Ukrainian counter-offensive in the area.\n\nUkrainian authorities did not immediately confirm the retreat of Russian troops today, and President Volodymyr Zelensky has suggested it could be a ruse to lure his forces into an entrenched battle.", "source": {"uri": "metro.co.uk", "dataType": "news", "title": "Metro"}, "authors": [{"uri": "jen_mills@metro.co.uk", "name": "Jen Mills", "type": "author", "isAgency": false}], "image": "https://metro.co.uk/wp-content/uploads/2022/11/SEC_132922177-9b81.jpg?quality=90&strip=all&crop=0px%2C0px%2C2400px%2C1261px&resize=1200%2C630", "eventUri": "eng-8166048", "sentiment": -0.3960784313725491, "wgt": 184, "relevance": 1, "stanza_neg": 6, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257157630", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:23:00", "dateTime": "2022-11-09T15:23:00Z", "dateTimePub": "2022-11-09T15:05:00Z", "dataType": "news", "sim": 0.7176470756530762, "url": "https://www.aljazeera.com/news/2022/11/9/kirill-stremousov-top-russian-appointed-kherson-official-dies", "title": "Senior Moscow-appointed official in Kherson 'killed in car crash'", "body": "Russian state media reports Moscow-appointed official in occupied Ukrainian region killed in car crash under unclear circumstances.\n\nKirill Stremousov, the Moscow-installed deputy head of Ukraine's Kherson region, has died in a car crash, according to Russian state media.\n\nThe TASS news agency said the death on Wednesday had been confirmed by the press service for the head of the region, without giving details of the circumstances.\n\n\"It's true,\" TASS quoted the press service as saying.\n\nIn a post on the Telegram messaging app, Sergei Aksyonov, head of the Russia-annexed Crimea Peninsula, called Stremousov a \"true fighter\" and a \"Russian patriot\". Aksyonov did not specify the cause of the death.\n\nA Ukrainian and Russian national, Stremousov was one of the most prominent public faces of Russia's occupation of Ukraine's territory. He was regularly using social media to promote war propaganda, including video updates while being inside vehicles moving at speed.\n\nIn his latest Telegram update on Wednesday morning, Stremousov said the Ukrainian offensive in the region had unsuccessfully tried to break through the Russian forces' defence line.\n\n\"The situation is under the full control of the Russian military,\" he said.\n\nUkrainian legislator Oleksiy Goncharenko called Stremousov a \"traitor\".\n\n\"He actively opposed the surrender of Kherson and said that Russia is here forever. And then he mysteriously dies,\" he said on Twitter.\n\nLately, Stremousov had been urging civilians to evacuate the western bank of the Dnieper River in the face of a mounting Ukrainian counteroffensive to take the southern region, which Russia claimed to have annexed.\n\nUkrainian officials have been weary of such statements as well as blatant signs of a Russian defeat in Kherson, including photos circulated on social media of key buildings no longer flying Russian flags, saying they could be a trap.\n\nKherson, which sits just northwest of Crimea, was occupied during the first week of Russia's invasion of Ukraine in late February. Since then, it has seen regular civilian protests that were put down by Russian troops.\n\nIn July, another official of the Kherson military-civilian administration, Dmitry Savluchenko, was killed in a bomb blast.", "source": {"uri": "aljazeera.com", "dataType": "news", "title": "Al Jazeera Online"}, "authors": [], "image": "https://www.aljazeera.com/wp-content/uploads/2022/11/2022-11-09T140634Z_874256846_RC2EIX9XKPFU_RTRMADP_3_UKRAINE-CRISIS-KHERSON-STREMOUSOV.jpg?resize=1920%2C1394", "eventUri": "eng-8166048", "sentiment": -0.3176470588235294, "wgt": 183, "relevance": 1, "stanza_neg": 3, "stanza_neu": 14, "stanza_pos": 1, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257606550", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "23:21:00", "dateTime": "2022-11-09T23:21:00Z", "dateTimePub": "2022-11-09T22:56:00Z", "dataType": "news", "sim": 0.7176470756530762, "url": "https://www.sott.net/article/474111-Deputy-head-of-Kherson-killed-in-road-accident", "title": "Deputy head of Kherson killed in road accident -- Sott.net", "body": "The deputy head of Russia's Kherson Region, Kirill Stremousov, has been killed in a car accident, the top local official Vladimir Saldo confirmed on Wednesday. The region's health minister, Vadim Ilmiev, told the media that Stremousov had been involved in a traffic incident on a road connecting Kherson to the town of Armyansk in northern Crimea.\n\nStremousov often spoke on behalf of the regional administration, particularly when it came to the situation in the city of Kherson. He gave regular updates on social media and regularly talked to journalists about the region's affairs. Just this morning, the late official revealed the latest information about the battlefield situation, reporting that Ukrainian attempts to advance in a town some 50km to the north from Kherson had been thwarted by Russian troops.\n\nRussia incorporated Kherson Region last month, after residents there voted in a referendum to break away from Kiev and be accepted into Russia. Kiev dismissed the ballot as a \"sham\" and continued its military push toward the regional capital.\n\nKherson is located on the right bank of the Dnieper River and is relatively close to Ukrainian positions. The regional administration urged civilians to leave the city due to the threat from Ukrainian forces and has moved its headquarters to the other side of the river.\n\nStremousov came to prominence in the national media after earlier having a brush with death. In September, his office in Kherson was hit by a Ukrainian rocket, but he was not there due to a scheduled appearance on a talk show. The blast injured several workers of the administration.", "source": {"uri": "sott.net", "dataType": "news", "title": "Signs Of The TImes"}, "authors": [], "image": "https://www.sott.net/image/s33/662478/full/636baa972030277ab1086a3f.jpg", "eventUri": "eng-8166048", "sentiment": -0.207843137254902, "wgt": 183, "relevance": 1, "stanza_neg": 3, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257308377", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:35:00", "dateTime": "2022-11-09T17:35:00Z", "dateTimePub": "2022-11-09T17:35:00Z", "dataType": "news", "sim": 0.7098039388656616, "url": "https://www.rocketnews.com/2022/11/kirill-stremousov-top-russian-appointed-kherson-official-dies/", "title": "Kirill Stremousov, top Russian-appointed Kherson official, 'dies' - RocketNews", "body": "Russian state media reports Moscow-appointed official in occupied Ukrainian region killed in car crash under unclear circumstances.Kirill Stremousov, the Moscow-installed deputy head of Ukraine's Kherson region, has died in a car crash, according to Russian state media.\n\nThe TASS news agency said the death on Wednesday had been confirmed by the press service for the head of the region, without giving details of the circumstances.\n\n\"It's true,\" TASS quoted the press service as saying.\n\nIn a post on the Telegram messaging app, Sergei Aksyonov, head of the Russia-annexed Crimea Peninsula, called Stremousov a \"true fighter\" and a \"Russian patriot\". Aksyonov did not specify the cause of the death.\n\nA Ukrainian and Russian national, Stremousov was one of the most prominent public faces of Russia's occupation of Ukraine's territory. He was regularly using social media to promote war propaganda, including video updates while being inside vehicles moving at speed.\n\nIn his latest Telegram update on Wednesday morning, Stremousov said the Ukrainian offensive in the region had unsuccessfully tried to break through the Russian forces' defence line.\n\n\"The situation is under the full control of the Russian military,\" he said.\n\nUkrainian legislator Oleksiy Goncharenko called Stremousov a \"traitor\".\n\n\"He actively opposed the surrender of Kherson and said that Russia is here forever. And then he mysteriously dies,\" he said on Twitter.\n\nKherson collaborator Kirill Stremousov died in an accident. This is a traitor who went over to the side ...", "source": {"uri": "rocketnews.com", "dataType": "news", "title": "RocketNews | Top News Stories From Around the Globe"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.2470588235294118, "wgt": 181, "relevance": 1, "stanza_neg": 3, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257529339", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "21:41:00", "dateTime": "2022-11-09T21:41:00Z", "dateTimePub": "2022-11-09T19:50:00Z", "dataType": "news", "sim": 0.7098039388656616, "url": "https://www.kgou.org/2022-11-09/a-russian-appointed-official-died-in-a-car-crash-in-ukraines-kherson", "title": "A Russian-appointed official died in a car crash in Ukraine's Kherson", "body": "Kirill Stremousov, the public face of the Russian occupation of Ukraine's Kherson region, has died in a car accident, according to the collaborationist government there.\n\nThe region's Moscow-installed administration head, Vladimir Saldo, announced the death Wednesday on the Telegram social media app, calling Stremousov, his acting deputy governor and occupation spokesman, \"one of the brightest.\"\n\nThere were no further details about the reported death.\n\nStremousov, Ukrainian by birth, was a 45-year-old pro-Russian propagandist known for posting voluminous videos -- often from his car.\n\n\"The 'Ukronazis,' pushed by their American masters, are forced to face certain death,\" he said in one recent video, repeating Moscow's false claims that Ukraine is run by U.S.-backed Nazis.\n\nStremousov insisted that Russia's victory was inevitable, but that has become more difficult to sell in recent weeks as Russia suffered more defeats in the region. On Wednesday, Moscow announced it was pulling troops out of Kherson city, but the Ukrainian government said it saw no signs Russian forces were leaving without a fight. Kherson is a strategically and symbolically important regional center that fell relatively easily to the Russians early in the war.\n\nStremousov had a colorful, eccentric past. In a video he posted on YouTube in 2017, he holds his infant daughter by the arm and leg and swings her around as a form of what he calls exercise, which sparked accusations online of child abuse.\n\nStremousov ran unsuccessfully for mayor of Kherson and the Ukrainian parliament, and became a well-known opponent of vaccines during the COVID-19 pandemic.\n\nHe initially served in the Kherson region as a Ukrainian government fisheries official. Later, he fashioned himself into a gadfly and political blogger who pressed the government to help ordinary citizens.\n\nRoman Tsviakh, a fellow civic activist, who now lives in Poland, recalled that Stremousov publicly confronted officials after some citizens fell and broke bones in an ice storm a few years back. The next day, the sidewalks were covered in salt, he recalled.\n\n\"He seemed to me to be an honest person who really wanted to work in the interest of people,\" said Volodymyr Marus, a journalist who helped train Stremousov how to work as a civic activist. But he has since changed his mind about the collaborator.\n\nUkrainian intelligence officials and past associates told NPR that Stremousov had a thirst for wealth and began using his blog to extort money from local businesses in exchange for not publicizing their wrongdoing. Tsviakh says this behavior was not unusual, but part of Kherson's culture of corruption, which made the region an easy target for Russian infiltration in advance of the February invasion.\n\n\"People like Stremousov evolved because of a broken system,\"Tsviakh said.\n\nStremousov allied himself with officials such as Saldo and others who publicly switched sides and backed the Russians in February.\n\n\"When the war began, all of them started to work as collaborators,\" said Marus. \"They were not pro-Russian. These were just people who wanted money. They had no sense of patriotism or purpose. They are simply traitors to Ukraine.\"", "source": {"uri": "kgou.org", "dataType": "news", "title": "KGOU 106.3"}, "authors": [], "image": "https://npr.brightspotcdn.com/dims4/default/aadaadc/2147483647/strip/true/crop/3827x2009+0+216/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F11%2F09%2Fgettyimages-1242010244_custom-1d393e6b7f842a345bf4be3b2fd9b2e287d83bba.jpg", "eventUri": "eng-8166048", "sentiment": -0.4196078431372549, "wgt": 181, "relevance": 1, "stanza_neg": 4, "stanza_neu": 20, "stanza_pos": 2, "swn_neg": 26, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257143612", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:11:00", "dateTime": "2022-11-09T15:11:00Z", "dateTimePub": "2022-11-09T14:48:00Z", "dataType": "news", "sim": 0.7098039388656616, "url": "https://tass.com/emergencies/1534337", "title": "Acting Kherson Regional governor confirms death of his deputy in car crash", "body": "Vladimir Saldo added that Kirill Stremousov was one of the brightest personalities whom he described as \"an articulate speaker capable of telling people the truth about what is happening in the Kherson Region\"\n\nKHERSON, November 9. /TASS/. The Kherson Region's acting governor, Vladimir Saldo, has confirmed the death of his deputy, Kirill Stremousov, in a road accident.\n\n\"It's very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson Region while riding in a car. There was a road accident. He has repeatedly visited the frontline and inspected areas in the rear. It will be very hard to tell his near and dear ones about the tragedy. He is a father of five children. A sixth is to be born soon. Of course, we will take care of all of them. Deplorably, Kirill is no more,\" Saldo wrote on his Telegram channel.\n\nHe added that Kirill was one of the brightest personalities whom he described as \"an articulate speaker capable of telling people the truth about what is happening in the Kherson Region.\"\n\nAfter the liberation of the Kherson Region Stremousov became one of its senior officials. On September 28, he received a Russian passport.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "eventUri": "eng-8166048", "sentiment": -0.2156862745098039, "wgt": 181, "relevance": 1, "stanza_neg": 3, "stanza_neu": 10, "stanza_pos": 2, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257022246", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "13:32:00", "dateTime": "2022-11-09T13:32:00Z", "dateTimePub": "2022-11-09T13:32:00Z", "dataType": "news", "sim": 0.7058823704719543, "url": "https://censor.net/en/news/3379380/traitor_stremousov_is_dead_russian_media", "title": "Traitor Stremousov is dead, - Russian media", "body": "Information appeared on social networks that the traitor Kyrylo Stremousov allegedly died in a road accident.\n\nReadovka.news reports this with reference to its own sources, Censor.NET informs.\n\n\"Kyrylo Stremousov, the deputy head of the administration of the Kherson region, died in a road accident, the source of Readovka reported. It is not known exactly how it happened,\" the message reads.\n\nRT source confirms this information.\n\n\"Deputy governor of the Kherson region, Kyrylo Stremousov, died in a road accident near Henichesk, his personal driver informed the WarGonzo project,\" writes the Telegram channel \"Earlier than all\".\n\nCurrently, there is no official confirmation of the information.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/f/b/5/8/fb588c5482a9ae652ad191509b931b6d/censor_social.jpg", "eventUri": "eng-8166048", "sentiment": -0.3725490196078431, "wgt": 180, "relevance": 1, "stanza_neg": 0, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257186725", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:47:00", "dateTime": "2022-11-09T15:47:00Z", "dateTimePub": "2022-11-09T15:47:00Z", "dataType": "news", "sim": 0.7019608020782471, "url": "https://www.i24news.tv/en/news/ukraine-conflict/1668007117-russia-orders-military-to-withdraw-from-ukraine-s-kherson-city", "title": "Russia orders military to withdraw from Ukraine's Kherson city - I24NEWS", "body": "This comes shortly after the death of Moscow-installed deputy head of Ukraine's southern Kherson region\n\nRussian Defense Minister Sergei Shoigu ordered the military to withdraw from Ukraine's Kherson city, it was announced on Wednesday.\n\n\"Begin to pull out troops,\" Shoigu said during a televised meeting.\n\nThe commander of the Russian troops in Ukraine, Sergei Surovikin, proposed organizing defense along the left bank of the Dnipro river, with Shoigu agreeing.\n\nRussian troops will withdraw to the left bank of the river, including from Kherson.\n\nThis comes shortly after the Moscow-installed deputy head of Ukraine's southern Kherson region, Kirill Stremousov, died in a car crash.\n\nStremousov, 45, was one of the highest-profile officials in Ukraine supporting Moscow's offensive.\n\nStremousov's aide, speaking to AFP, confirmed his death.\n\n\"I confirm the death of Kirill Sergeyevich,\" the aide said, referring to Stremousov by his first name and patronymic.\n\nKherson's Russian-appointed acting governor, Vladimir Saldo, called his passing \"tragic,\" saying his car got into an accident in the region.\n\nSaldo called Stremousov one of the \"brightest\" people he has known and said he leaves behind five children, with a sixth due soon.\n\nRussian forces have for weeks organized evacuation of Kherson residents to Russia and other Moscow-controlled regions, which Kyiv has condemned as a mass deportation.", "source": {"uri": "i24news.tv", "dataType": "news", "title": "i24NEWS English"}, "authors": [], "image": "https://cdn.i24news.tv/uploads/2e/8d/97/f7/6b/32/01/35/29/24/43/2d/52/67/07/6e/2e8d97f76b3201352924432d5267076e.jpg", "eventUri": "eng-8166048", "sentiment": -0.2549019607843137, "wgt": 179, "relevance": 1, "stanza_neg": 2, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257342647", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "18:09:00", "dateTime": "2022-11-09T18:09:00Z", "dateTimePub": "2022-11-09T18:09:00Z", "dataType": "news", "sim": 0.6980392336845398, "url": "https://www.aninews.in/news/world/asia/russia-appointed-official-in-ukraines-kherson-dies-in-road-accident20221109233416/", "title": "Russia-appointed official in Ukraine's Kherson dies in road accident", "body": "Moscow [Russia], November 9 (ANI): The Russian-appointed official in occupied Ukrainian territory Kherson, Kirill Stremousov, was killed in a road accident, TASS Media Agency reported.\n\nKherson Region's acting governor, Vladimir Saldo has also confirmed the news on his Telegram channel and said, \"It's very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson Region while riding in a car. There was a road accident.\"\n\nHe further said, \"He has repeatedly visited the frontline and inspected areas in the rear. It will be very hard to tell his near and dear ones about the tragedy. He is the father of five children. A sixth is to be born soon. Of course, we will take care of all of them. Deplorably, Kirill is no more,\" according to TASS.\n\nAfter the liberation of the Kherson Region, Stremousov became one of its senior officials. On September 28, he received a Russian passport.\n\nMinister of Health of the Kherson Region Vadim Ilmiev said that Stremousov was killed in an accident on the highway between Kherson and Armyansk in Crimea, according to CNN citing Russian state media company Vesti (VGTRK) said that,.\n\nValeria Petrusevich, head of the nonprofit organization Good Peace-Crimean Volunteers, also wrote on her Telegram channel that \"Kirill Stremousov, deputy governor of the Kherson region, died. The information is accurate, I know personally. It was an accident. Details later.\"\n\nThis comes after several media reports that Russian forces have destroyed the bridges across the occupied parts of Ukraine's Kherson region west of the Dnipro River, CNN reported.\n\nSerhii Khlan, a member of the Ukrainian Kherson Regional Council, said that Russian forces appear to be staging a tactical retreat from some frontline villages to \"slow down the onslaught of the Armed Forces of Ukraine.\" CNN cannot independently confirm his claims.\n\n\"The occupiers blew up not only Dariivskyi and Tiahynskyi bridges, they also blew up the bridge at the exit from Snihurivka towards Kherson across the canal,\" Khlan said during a press conference. \"They blew up the bridge in Novokairy, blew up the bridge in My love.\"\n\n\"The occupiers are now blowing up absolutely all bridges\" in the occupied Kherson region west of the Dnipro River, according to CNN.\n\nImages and reports from Russian propagandists and military analysts on Telegram appear to corroborate those claims.\n\nA popular Russian military analysis channel said on Wednesday that \"the destruction of bridges across the Kherson Front began to slow down the advance of the AFU [Armed Forces of Ukraine].\"\n\nKhlan said that Russian forces were withdrawing \"en masse\" from frontline villages along the western bank of the Dnipro River. He said that though it was not yet possible to officially say that Russia had abandoned the settlements, Russian forces were no longer present in Kachkarivka, Mylove, Novokairy, Berezynske, Sukhanove, Chervonyi Yar, Piatykhatky and Sadok, reported CNN. (ANI)", "source": {"uri": "aninews.in", "dataType": "news", "title": "Asian News International (ANI)"}, "authors": [], "image": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221109175820.jpg", "eventUri": "eng-8166048", "sentiment": -0.2392156862745098, "wgt": 178, "relevance": 1, "stanza_neg": 6, "stanza_neu": 22, "stanza_pos": 0, "swn_neg": 28, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257178186", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:41:00", "dateTime": "2022-11-09T15:41:00Z", "dateTimePub": "2022-11-09T15:40:00Z", "dataType": "news", "sim": 0.6980392336845398, "url": "https://www.timesnownews.com/world/russia-appointed-deputy-guv-of-kherson-kirill-stremousov-killed-in-car-crash-reports-article-95408314", "title": "Russia appointed Deputy Guv of Kherson Kirill Stremousov killed in car crash - reports", "body": ": Russia-appointed deputy governor of the Ukrainian city of Kherson, Kirill Stremousov has been killed in a car crash, as per reports by Russian state media. 45-year-old Stremousov was appointed two months after the Russian invasion of Ukraine. Stremousov was a strong proponent of the Russian invasion and was wanted by the Ukrainian police for treason.", "source": {"uri": "timesnownews.com", "dataType": "news", "title": "TimesNow"}, "authors": [], "image": "https://static.tnn.in/thumb/msid-95408314,imgsize-100,width-1280,height-720,resizemode-75/95408314.jpg", "eventUri": "eng-8166048", "sentiment": -0.2313725490196078, "wgt": 178, "relevance": 1, "stanza_neg": 0, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 3, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259597496", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "10:06:00", "dateTime": "2022-11-11T10:06:00Z", "dateTimePub": "2022-11-11T09:50:00Z", "dataType": "news", "sim": 0.6980392336845398, "url": "https://tass.com/society/1535225", "title": "Final farewell ceremony for Kherson Region's deputy governor underway in Simferopol", "body": "Kirill Stremousov died in a car crash in the Kherson Region on November 9\n\nSIMFEROPOL, November 11. /TASS/. A final farewell ceremony for Deputy Governor of the Kherson Region Kirill Stremousov is underway at the St. Alexander Nevsky Cathedral in the Crimean capital of Simferopol, a TASS correspondent reports.\n\nWreaths on behalf of the Russian Presidential Administration, the head of the Donetsk People's Republic (DPR), where Stremousov was born, the chairman of the DPR State Council, the Kherson regional administration and the region's residents were placed in the cathedral ahead of the ceremony.\n\nStremousov died in a car crash in the Kherson Region on November 9. In 2018-2019, he was the chairman of the Kherson regional branch of the Ukrainian Socialist Party, which in 2022 became one of the so-called pro-Russian parties whose activities are banned in Ukraine. In October 2020, Stremousov ran for Kherson's city mayor as an independent candidate. In 2021, he joined the Derzhava party (its activities were banned in Ukraine in 2022). Russian troops took control of the Kherson Region in 2022 during Moscow's special military operation. In April 2022, Stremousov took the position of deputy head of the regional military-civilian administration. He obtained a Russian passport in September 2022.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20221111/1370845.jpg", "eventUri": "eng-8166048", "sentiment": -0.08235294117647063, "wgt": 178, "relevance": 1, "stanza_neg": 1, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257142182", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:10:00", "dateTime": "2022-11-09T15:10:00Z", "dateTimePub": "2022-11-09T14:58:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://www.theguardian.com/world/2022/nov/09/russians-destroy-dnieper-bridges-to-slow-ukraine-advance-on-kherson", "title": "Russians destroy Dnieper bridges to slow Ukraine advance on Kherson", "body": "'Intense fighting' in south of country as senior Russian-installed official reported to have died in car crash\n\nRussian forces have destroyed bridges on the west bank of the Dnieper River in Ukraine's southern Kherson region to slow a continuing Ukrainian advance, as it was reported that one of the most prominent Russian-installed officials had been killed in a car crash.\n\nAs the Ukrainian president, Volodomyr Zelenskiy, described \"intense fighting\" on the southern frontline, Ukrainian troops were reported to have retaken a number of settlements.\n\nA few hours after Kirill Stremousov, the Russian-appointed deputy head of the Kherson region, announced that Ukrainian forces had gained a foothold on the northern edge of Snihurivka amid heavy fighting, a town that lies on a highway 31km north of Kherson city, Stremousov himself was reported by Russian media to have died in unclear circumstances.\n\nStremousov - a former anti-vaccination blogger - had become the hated face of Russia's occupation of Kherson, posting videos online, including a bizarre poetry rendition and hosting press conferences for pro-Russian media.\n\nAccording to local media reports, the accident happened near Henichesk, on the Sea of Azov, the seaside town used as the headquarters of the Russian occupation administration since it fled Kherson.\n\nThe Tass news agency said the press service for the head of the region had confirmed Stremousov's death.\n\nAlexander Dugin, a far-right nationalist figure in Russia, whose daughter was killed earlier this year in a car bomb, said: \"Kirill Stremousov, deputy head of the administration of the Kherson region, has died. A true hero. Kherson must be defended at all costs. Kherson is what keeps Russia in power today.\"\n\nReports on pro-Russian social media channels painted a gloomy picture of situation in Kherson, with some suggesting Moscow may even be preparing to abandon the largest city it occupies in Ukraine.\n\nDespite sending substantial reinforcements to the region since the summer, Moscow's forces on the west bank of the river have become increasingly in danger of being trapped by the Ukrainian advance on a broad front.\n\nIn recent weeks, Russia been transporting civilians away from Kherson as the Ukrainian threat to the occupied city has drawn ever closer, amid reports this week that some private ferries used by civilians for evacuation have also been sunk.\n\nAleksandr Kots, a journalist with the pro-Kremlin Komsomolskaya Pravda tabloid, who is in Kherson, said there was \"no good news\" there, suggesting that the announcement of withdrawal could come soon.\n\n\"We are waiting for an official announcement,\" he wrote on his Telegram channel. Kots also posted several videos from Kherson that he said showed Russian flags removed from government buildings.\n\nAccording to some accounts, the occupation administration in Kherson has been relocated well to the south of the city.\n\nSergei Markov, a former Kremlin adviser and political commentator said that the decision to leave Kherson would have \"catastrophic consequences\".\n\n\"In Russia, many fear that the decision to leave Kherson has already been made. It is the wrong decision. It could have catastrophic consequences for Russia.\"\n\nUkrainian officials have warned in recent days that claims that Russian forces are preparing to withdraw may be a ruse, suggesting that some Russian troops were disguising themselves as civilians.\n\nVictory in Kherson, one of the key objectives of Kyiv's southern offensive, would be a devastating blow to the Russian president, Vladimir Putin, only weeks after a high-profile ceremony in Moscow in which he announced the annexation of Kherson oblast along with three other regions.\n\nThe destruction of the bridges, however, suggests that at the very least Russian forces may be preparing to abandon the positions that they occupy on western side of the Dnieper River.\n\nUkrainian officials and local residents said that at least four bridges had been blown up on Wednesday to slow the Ukrainian advance. Among therse was the Dariivka bridge, the only crossing across the Inhulets river in the Russian-occupied western-bank part of Kherson oblast.\n\nThe Inhulets divides the occupied area into two, with the city of Kherson in the western part and Beryslav in the east.\n\nImages posted on social media also showed two bridges over the canal in Snihurivka had collapsed. Snihurivika has been a key Russian position, anchoring its defences outside Kherson.", "source": {"uri": "theguardian.com", "dataType": "news", "title": "The Guardian"}, "authors": [{"uri": "peter_beaumont@theguardian.com", "name": "Peter Beaumont", "type": "author", "isAgency": false}, {"uri": "pjotr_sauer@theguardian.com", "name": "Pjotr Sauer", "type": "author", "isAgency": false}], "image": "https://i.guim.co.uk/img/media/8a3599f97ea2e7b7a7a403c10fb3fa47f047de20/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=3a1b0fe79d1393ed91b60995350adfc5", "eventUri": "eng-8166048", "sentiment": -0.5450980392156863, "wgt": 177, "relevance": 1, "stanza_neg": 8, "stanza_neu": 21, "stanza_pos": 1, "swn_neg": 30, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257374256", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "18:43:00", "dateTime": "2022-11-09T18:43:00Z", "dateTimePub": "2022-11-09T18:20:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://www.latestly.com/agency-news/world-news-russia-appointed-official-in-ukraines-kherson-dies-in-road-accident-4439803.html", "title": "World News | Russia-appointed Official in Ukraine's Kherson Dies in Road Accident | LatestLY", "body": "Moscow [Russia], November 9 (ANI): The Russian-appointed official in occupied Ukrainian territory Kherson, Kirill Stremousov, was killed in a road accident, TASS Media Agency reported.\n\nKherson Region's acting governor, Vladimir Saldo has also confirmed the news on his Telegram channel and said, \"It's very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson Region while riding in a car. There was a road accident.\"\n\nAlso Read | Microsoft Faces a New Antitrust Complaint over Its Cloud Computing Practices as Trade ... - Latest Tweet by Reuters.\n\nHe further said, \"He has repeatedly visited the frontline and inspected areas in the rear. It will be very hard to tell his near and dear ones about the tragedy. He is the father of five children. A sixth is to be born soon. Of course, we will take care of all of them. Deplorably, Kirill is no more,\" according to TASS.\n\nAfter the liberation of the Kherson Region, Stremousov became one of its senior officials. On September 28, he received a Russian passport.\n\nAlso Read | Meta Layoffs: Massive Sacking by Mark Zuckerberg Hits India Team Across Verticals.\n\nMinister of Health of the Kherson Region Vadim Ilmiev said that Stremousov was killed in an accident on the highway between Kherson and Armyansk in Crimea, according to CNN citing Russian state media company Vesti (VGTRK) said that,.\n\nValeria Petrusevich, head of the nonprofit organization Good Peace-Crimean Volunteers, also wrote on her Telegram channel that \"Kirill Stremousov, deputy governor of the Kherson region, died. The information is accurate, I know personally. It was an accident. Details later.\"\n\nThis comes after several media reports that Russian forces have destroyed the bridges across the occupied parts of Ukraine's Kherson region west of the Dnipro River, CNN reported.\n\nSerhii Khlan, a member of the Ukrainian Kherson Regional Council, said that Russian forces appear to be staging a tactical retreat from some frontline villages to \"slow down the onslaught of the Armed Forces of Ukraine.\" CNN cannot independently confirm his claims.\n\n\"The occupiers blew up not only Dariivskyi and Tiahynskyi bridges, they also blew up the bridge at the exit from Snihurivka towards Kherson across the canal,\" Khlan said during a press conference. \"They blew up the bridge in Novokairy, blew up the bridge in My love.\"\n\n\"The occupiers are now blowing up absolutely all bridges\" in the occupied Kherson region west of the Dnipro River, according to CNN.\n\nImages and reports from Russian propagandists and military analysts on Telegram appear to corroborate those claims.\n\nA popular Russian military analysis channel said on Wednesday that \"the destruction of bridges across the Kherson Front began to slow down the advance of the AFU [Armed Forces of Ukraine].\"\n\nKhlan said that Russian forces were withdrawing \"en masse\" from frontline villages along the western bank of the Dnipro River. He said that though it was not yet possible to officially say that Russia had abandoned the settlements, Russian forces were no longer present in Kachkarivka, Mylove, Novokairy, Berezynske, Sukhanove, Chervonyi Yar, Piatykhatky and Sadok, reported CNN. (ANI)", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2022/11/ANI-20221109175820-588x441.jpg", "eventUri": "eng-8166048", "sentiment": -0.2392156862745098, "wgt": 177, "relevance": 1, "stanza_neg": 6, "stanza_neu": 24, "stanza_pos": 0, "swn_neg": 30, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257133299", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:03:00", "dateTime": "2022-11-09T15:03:00Z", "dateTimePub": "2022-11-09T15:02:00Z", "dataType": "news", "sim": 0.6901960968971252, "url": "https://www.news18.com/news/world/moscow-installed-official-in-ukraines-kherson-dies-in-car-crash-6347779.html", "title": "Moscow-installed Official in Ukraine's Kherson Dies in Car Crash", "body": "Kherson's Russian-appointed acting governor, Vladimir Saldo, called his passing \"tragic,\" saying his car got into an accident in the region\n\nThe Moscow-installed deputy head of Ukraine's southern Kherson region, Kirill Stremousov, has died in a car crash, officials said Wednesday.\n\nStremousov, 45, was one of the highest-profile officials in Ukraine supporting Moscow's offensive.\n\nStremousov's aide, speaking to AFP, confirmed his death.\n\n\"I confirm the death of Kirill Sergeyevich,\" the aide said, referring to Stremousov by his first name and patronymic.\n\nKherson's Russian-appointed acting governor, Vladimir Saldo, called his passing \"tragic,\" saying his car got into an accident in the region.\n\nSaldo called Stremousov one of the \"brightest\" people he has known and said he leaves behind five children, with a sixth due soon.\n\nThe head of Russia-annexed Crimea, Sergei Aksyonov, called Stremousov a \"true fighter\" and a \"Russian patriot.\"\n\nThe region's main city, also called Kherson, was the first urban hub to be captured by Russia after President Vladimir Putin sent troops into Ukraine on February 24.\n\nUkrainian troops are now advancing towards the city and causing heavy losses among Russian troops.\n\nRussian forces have for weeks organised evacuation of Kherson residents to Russia and other Moscow-controlled regions, which Kyiv has condemned as a mass deportation.", "source": {"uri": "news18.com", "dataType": "news", "title": "News18"}, "authors": [], "image": "https://images.news18.com/ibnlive/uploads/2022/09/untitled1-166384253616x9.jpg", "eventUri": "eng-8166048", "sentiment": -0.2862745098039216, "wgt": 176, "relevance": 1, "stanza_neg": 2, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257431044", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "19:42:00", "dateTime": "2022-11-09T19:42:00Z", "dateTimePub": "2022-11-09T19:42:00Z", "dataType": "news", "sim": 0.6901960968971252, "url": "https://nationalinterest.org/blog/buzz/top-russian-installed-kherson-official-killed-car-crash-205817", "title": "Top Russian-Installed Kherson Official Killed in Car Crash", "body": "Kirill Stremousov, one of Russia's most prominent occupation officials in Ukraine, was killed in a car crash on Wednesday.\n\nKirill Stremousov, one of Russia's most prominent occupation officials in Ukraine, was killed in a car crash on Wednesday, according to local authorities and Russian state media.\n\nThe press service of the southern Russian-occupied Kherson region confirmed Stremousov's death to Russian media outlets. Authorities have not shared any further details surrounding the incident. There have been conflicting reports on where the fatal crash took place, with some sources alleging that he died near the port city of Henichesk along the Sea of Azov.\n\nUkrainian authorities have systematically targeted Ukrainians accused of collaborating with Russian forces in a string of high-profile assassinations. Oleg Boyko, deputy head of the Berdyansk military-civilian administration for housing and communal services, was killed near his garage along with his wife in September. Vladimir Saldo, the head of Russian-occupied Kherson, was previously hospitalized in Crimea as part of a purported poisoning plot. There is, however, currently no indication that Ukraine played any part in Stremousov's death. Saldo, who returned to Kherson shortly after the poisoning attempt, confirmed reports of Stremousov's death and said the official left behind five children, according to the BBC.\n\nStremousov, forty-five, was a blogger and local political activist associated with the Socialist Party of Ukraine, an organization banned by the Ukrainian government in June 2022. Stremousov espoused a stridently pro-Russian position during the invasion of Ukraine and was appointed by the Kremlin as deputy head of the Kherson Regional Administration in April. He was accused by Ukrainian authorities of treason for his role in aiding the Russian occupation forces. The occupation official posted regular updates on Telegram, denouncing Ukrainian forces as \"Nazis\" and \"fascists\" whilst also criticizing Russia's missteps in the war. Stremeousov lashed out at top Russian defense officials last month over Ukraine's battlefield successes, claiming that Russia's Defense Ministry consists of \"mediocre and corrupt generals and looters,\" according to Newsweek. \"Many people say that the Minister of Defense, who allowed this state of affairs to happen, could, as an officer, shoot himself,\" he added, referring to Russian Defense Minister Sergei Shoigu.\n\nStremeousov became a key local figure in Russia's recent efforts to evacuate the city of Kherson amid a Ukrainian offensive in the region. In his last Telegram post, dated to Wednesday morning, Stremousov expressed optimism in the continued ability of Russian forces to repel Ukrainian assaults on Kherson. \"At this stage, the situation is under full control of the Russian military,\" he wrote. Russia's overall commander in Ukraine, Gen. Sergei Surovikin, announced later that day the decision was made to withdraw Russian troops from the city.", "source": {"uri": "nationalinterest.org", "dataType": "news", "title": "The National Interest"}, "authors": [], "image": "https://nationalinterest.org/sites/default/files/main_images/Car%20Kherson.jpg", "eventUri": "eng-8166048", "sentiment": -0.6470588235294117, "wgt": 176, "relevance": 1, "stanza_neg": 6, "stanza_neu": 14, "stanza_pos": 0, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7258158779", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "10:27:00", "dateTime": "2022-11-10T10:27:00Z", "dateTimePub": "2022-11-10T09:32:00Z", "dataType": "news", "sim": 0.686274528503418, "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2022/11/ukraine-221109-rferl02.htm", "title": "Top Russian-Installed Official In Ukraine's Kherson Region Reportedly Dies In Car Crash", "body": "The Russian-installed deputy governor of Ukraine's Kherson region, one of the highest profile occupation figures, has reportedly died in a traffic accident.\n\nRussian pro-Kremlin military reporter Semyon Pegov, blogger Boris Rozhin, and the RIA-Novosti state news agency quoted the Russian-installed administration of the Kherson region as saying that the traffic accident on November 9 that killed Kirill Stremousov occurred near the city of Henichesk.\n\nMoscow and Russian-installed officials in Kherson have said for weeks that they are pushing residents of Kherson to move to \"other parts of the Russian Federation.\"\n\nAfter Russian troops took control of parts of the Kherson region and the regional capital, Kherson, in March, Stremousov had been the major spokesman of the Russian-installed authorities there.\n\nHe was the first person to announce Russia's decision to annex the region, along with three other Ukrainian regions, parts of which are under the control of Russian troops, via so-called \"referendums\" in September.\n\nBefore Russia launched its unprovoked invasion of Ukraine in late February, Stremousov was a Ukrainian politician. He was known for his pro-Russia stance and the pro-Moscow public events he organized in the region. He was an active member of pro-Russia movements and parties in the region for years.\n\nStremousov unsuccessfully tried to get elected to the Ukrainian parliament in 2019 and to the post of mayor of Kherson in 2020.\n\nSince Russia launched its attack on Ukraine, there have been several assassination attempts conducted against Moscow-appointed officials in Kherson and other territories occupied by Russian troops.\n\nSeveral officials are reported to have been killed, though in September, the Russian-appointed deputy mayor of the city of Nova Kakhovka in the Kherson region, Vitaliy Hura, and the city's de facto deputy police chief, Serhiy Tomko, turned out to be alive after their deaths were widely reported.\n\nThey said in televised interviews that their assassinations were faked by Russia's Federal Security Service to thwart potential attempts on their lives allegedly being planned by Ukrainian intelligence.\n\nReports about Stremousov's death come as Ukrainian armed forces continue their counteroffensive against Russian troops.\n\nKherson is considered by many military analysts as the most important of the four partially occupied Ukrainian regions that Russia announced as annexed in September.\n\nIt controls both the only land route to the Crimean Peninsula and the mouth of the Dnieper River that bisects Ukraine.\n\nSource: https://www.rferl.org/a/russia-kherson-stremousov- dies-car-crash-ukriane/32122726.html\n\nCopyright (c) 2022. RFE/RL, Inc. Reprinted with the permission of Radio Free Europe/Radio Liberty, 1201 Connecticut Ave., N.W. Washington DC 20036.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.1607843137254902, "wgt": 175, "relevance": 1, "stanza_neg": 4, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257103000", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:37:00", "dateTime": "2022-11-09T14:37:00Z", "dateTimePub": "2022-11-09T14:34:00Z", "dataType": "news", "sim": 0.686274528503418, "url": "https://nationalpost.com/pmn/news-pmn/russian-installed-official-in-ukraines-kherson-region-dies-in-car-crash", "title": "Russian-installed official in Ukraine's Kherson region dies in car crash", "body": "One of Russia's most prominent officials in Ukraine was killed in a car crash on Wednesday, a blow to Moscow in the southern Kherson region amid growing talk it is poised to withdraw its forces from the city of the same name.\n\nThe death of Kirill Stremousov, deputy head of the Russian-installed local administration, was confirmed by his boss Vladimir Saldo, the Russia-backed acting governor of Kherson.\n\nStremousov went from being an obscure blogger and local politician before the Russian invasion on Feb. 24 to become the number two figure in what Ukraine says is the illegal occupation of Kherson which it plans to overturn by force.", "source": {"uri": "nationalpost.com", "dataType": "news", "title": "National Post"}, "authors": [], "image": null, "eventUri": "eng-8166048", "sentiment": -0.5137254901960784, "wgt": 175, "relevance": 1, "stanza_neg": 1, "stanza_neu": 2, "stanza_pos": 0, "swn_neg": 3, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258551540", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "15:41:00", "dateTime": "2022-11-10T15:41:00Z", "dateTimePub": "2022-11-10T15:41:00Z", "dataType": "news", "sim": 0.6745098233222961, "url": "https://uk.news.yahoo.com/russian-leader-kherson-killed-160948043.html", "title": "Russian leader in Kherson 'killed'", "body": "Kirill Stremousov, the Russian-installed deputy head of Ukraine's southern Kherson region, died in unclear circumstances on Wednesday.\n\nRussian officials and the state-owned TASS news agency confirmed his death, but the claims could not immediately be confirmed and the exact circumstances of his death were unclear.\n\n\"Kirill Sergeyevich Stremousov has died,\" Sergei Aksyonov, the Russian-installed head of occupied Crimea, said on messaging app Telegram. Mr Askyonov called Stremousov a \"true fighter\" and a \"Russian patriot\" but did not specify the cause of the death.\n\nTASS said the press service for the head of the region had confirmed his death in a car crash. It later said there was \"no official\" confirmation of his death, but that doctors were attending the scene of the incident.\n\nVladimir Saldo, the head of the occupation administration in Kherson, later confirmed in a video address that Mr Stremousov died in a traffic accident.\n\nIt was not immediately clear whether the death was accidental. Ukrainian partisans have in the past attempted to assassinate collaborationist officials in occupied territory.\n\nStremousov, a native of Donetsk region who moved to Kherson in 2007, was locally famous before the war for eccentric beliefs and promotion of conspiracy theories.\n\nHe gained brief international notoriety in 2017 when he posted a video on Youtube of him spinning his four-month old daughter around his head until he could hear her \"bones popping.\" He claimed at the time he was demonstrating \"gymnastics from ancient times.\"\n\nHe immediately joined a pro-Russian collaborationist group after the city fell to Russian forces in early March and was appointed deputy head of the Kremlin-run regional civilian-military administration in April.\n\nHe went on to emerge as one of the most prominent figures in the Russian occupation of Ukraine, posting regular video updates of the situation on the frontline from speeding vehicles.\n\nLately he had been urging civilians to evacuate the western bank of the Dnipro river in the face of a mounting Ukrainian counteroffensive to take back territory captured by Russian forces in the first days of the war.\n\nHis last update, filmed against a white brick wall and posted on Wednesday morning, he said that \"the Nazis\" had tried to break through Russian defensive lines in the region \"but were repulsed everywhere.\"\n\nHis reported death comes as Ukraine closes in on Kherson city, the capital of the region.\n\nLocal media reported on Wednesday that retreating Russian troops had blown up several bridges in the region to slow the Ukrainian advance.", "source": {"uri": "uk.news.yahoo.com", "dataType": "news", "title": "Yahoo News UK"}, "authors": [], "image": "https://s.yimg.com/ny/api/res/1.2/sYNqhLJwW0g5KuBd0j0YLA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_telegraph_818/af3bf95175d96a5ab2a444458ac124b3", "eventUri": "eng-8166048", "sentiment": -0.5764705882352941, "wgt": 172, "relevance": 1, "stanza_neg": 4, "stanza_neu": 14, "stanza_pos": 0, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257173678", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:37:00", "dateTime": "2022-11-09T15:37:00Z", "dateTimePub": "2022-11-09T15:26:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://torontosun.com/news/world/russian-installed-official-kirill-stremousov-in-ukraines-kherson-region-dies-in-car-crash", "title": "Russian-installed official Kirill Stremousov in Ukraine's Kherson region dies in car crash", "body": "Stremousov went from being an obscure blogger and local politician before the Russian invasion on Feb. 24 to become the number two figure in what Ukraine says is the illegal occupation of Kherson which it plans to overturn by force.\n\nHe was a highly visible face on social media, pumping out pro-Moscow statements. In the most recent, hours before his death, he denounced what he called Ukrainian \"Nazis\" and said the Russian military was in \"full control\" of the situation in the south.\n\nUkraine viewed him as a collaborator and a traitor.\n\n\"It is very hard for me to say that Kirill Stremousov died today. He died on the territory of the Kherson region, travelling in a car that got into an accident,\" Saldo, his boss, said.\n\nStremousov's death deepened the sense of disarray surrounding the defence of Kherson, from which Russia has evacuated thousands of residents in anticipation of a Ukrainian counter-offensive.", "source": {"uri": "torontosun.com", "dataType": "news", "title": "Toronto Sun"}, "authors": [], "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/11/Kirill-Stremousov-e1668007409156.jpg?quality=100&strip=all", "eventUri": "eng-8166048", "sentiment": -0.3960784313725491, "wgt": 170, "relevance": 1, "stanza_neg": 3, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257660681", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "00:42:00", "dateTime": "2022-11-10T00:42:00Z", "dateTimePub": "2022-11-10T00:41:00Z", "dataType": "news", "sim": 0.6549019813537598, "url": "https://www.stuff.co.nz/world/europe/300735778/top-russian-official-in-ukraine-killed-in-crash", "title": "Top Russian official in Ukraine killed in crash", "body": "One of Russia's top officials in the illegally annexed region of Kherson has been killed in a car accident.\n\nKirill Stremousov, the deputy head of the region, died in a crash in Crimea. His death was confirmed by his boss, Vladimir Saldo, AP reported.\n\nIt was believed that he was killed while taking evasive action to avoid a truck.\n\nStremousov was a Ukrainian who had given his allegiance to Russia.\n\n* Russia announces withdrawal from Ukraine's Kherson, nearby areas\n\n* Neighbours go to war with each other in Ukrainian village after Russians leave\n\n* Russian soldier catches and throws away bomb dropped by Ukranian drone\n\n* US privately asks Ukraine to show it's open to negotiate with Russia\n\nMeanwhile, Russia earlier announced it would withdraw troops from Kherson, in a move that would mark one of Russia's worst setbacks in the 8-month-old war.\n\nThe top Russian military commander in Ukraine, General Sergei Surovikin, reported to Defence Minister Sergei Shoigu on Wednesday (local time) that it was impossible to deliver supplies to the city of Kherson and other areas on the western bank of the Dnieper River that it lies on.", "source": {"uri": "stuff.co.nz", "dataType": "news", "title": "Stuff"}, "authors": [], "image": "https://resources.stuff.co.nz/content/dam/images/4/z/1/h/p/4/image.related.StuffLandscapeSixteenByNine.1420x800.4z1t7m.png/1668040549132.jpg", "eventUri": "eng-8166048", "sentiment": -0.5686274509803921, "wgt": 167, "relevance": 1, "stanza_neg": 4, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257240483", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:34:00", "dateTime": "2022-11-09T16:34:00Z", "dateTimePub": "2022-11-09T16:14:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://www.opinionnigeria.com/breaking-news-kherson-russian-appointed-dep-gov-stremousov-dies-in-car-crash/", "title": "BREAKING NEWS: Kherson Russian-appointed dep gov, Stremousov, dies in car crash", "body": "In recent days, Mr Stremousov had been urging civilians to leave the eastern bank of the Dnipro river in the face of the Ukrainian advance, amid indications that Russian forces may be abandoning the city.\n\nThe Russian-installed deputy governor of Kherson, Kirill Stremousov, has been killed, according to Russian state media.\n\nThey quoted the regional governor's press service as saying he died in a car crash.\n\nMr Stremousov, 45, was appointed to his job two months after the Russian invasion of Ukraine.\n\nHe was one of the most prominent proponents of the Russian occupation and became known for aggressive statements on social media.\n\nHe was wanted for treason by the Ukrainian police.\n\nMany Russian-appointed officials in occupied Ukraine have been targeted in attacks.\n\nKherson, the only Ukrainian regional centre captured by Russian troops after the February invasion, is being targeted by a Ukrainian counter-offensive.\n\nIn recent days, Mr Stremousov had been urging civilians to leave the eastern bank of the Dnipro river in the face of the Ukrainian advance, amid indications that Russian forces may be abandoning the city.\n\nUkraine accuses Russia of forcibly deporting local residents. (BBC)", "source": {"uri": "opinionnigeria.com", "dataType": "news", "title": "Opinion Nigeria"}, "authors": [{"uri": "opinion_nigeria@opinionnigeria.com", "name": "Opinion Nigeria", "type": "author", "isAgency": false}], "image": "https://i0.wp.com/www.opinionnigeria.com/wp-content/uploads/2022/11/Put.webp?fit=600%2C338&ssl=1&w=640", "eventUri": "eng-8166048", "sentiment": -0.3254901960784313, "wgt": 166, "relevance": 1, "stanza_neg": 2, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257200541", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:00:00", "dateTime": "2022-11-09T16:00:00Z", "dateTimePub": "2022-11-09T15:41:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://www.axios.com/2022/11/09/russia-kherson-withdrawal-ukraine-invasion", "title": "Russia announces retreat from key Ukrainian city of Kherson", "body": "Russian Defense Minister Sergei Shoigu ordered troops to withdraw to the eastern bank of the Dnipro River on Wednesday, effectively surrendering the key southern city of Kherson.\n\nWhy it matters: Kherson was the only provincial capital captured by Russia since it invaded Ukraine in February.\n\nThe big picture: The announced withdrawal comes after Russian state media reported that Moscow's appointed occupation official in Ukraine's Kherson region, Kirill Stremousov, \"died in a road accident\" on Wednesday.", "source": {"uri": "axios.com", "dataType": "news", "title": "Axios"}, "authors": [{"uri": "jacob_knutson@axios.com", "name": "Jacob Knutson", "type": "author", "isAgency": false}], "image": "https://images.axios.com/u2pO08e56FcRLVNQsblkUdQYD6I=/0x115:8256x4759/1366x768/2022/11/09/1668008241555.jpg", "eventUri": "eng-8166048", "sentiment": -0.07450980392156858, "wgt": 165, "relevance": 1, "stanza_neg": 1, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 4, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257238529", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:33:00", "dateTime": "2022-11-09T16:33:00Z", "dateTimePub": "2022-11-09T16:32:00Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://www.thedailybeast.com/russian-military-suffers-new-humiliation-with-retreat-from-kherson", "title": "Putin Hit With Humiliating Retreat -- and Mystery Death of Crony", "body": "Russian troops have begun to retreat from Ukraine's Kherson region, just the latest humiliating pullout to leave pro-Kremlin military bloggers and propagandists fuming.\n\nRussian Defense Minister Sergei Shoigu handed down the order on Wednesday afternoon to pull out to the other side of the Dnipro River. The move came after Russian troops reportedly began blowing up bridges as they pulled out, with Russian flags being removed from buildings in the center of Kherson -- the only regional capital captured by Russian forces in the full-scale invasion.\n\n\"For us, life and health of the military personnel is always the priority,\" Shoigu said in announcing the decision.\n\nBizarrely, the order came after Sergei Surovikin, Russia's top commander in Ukraine, boasted of Russian troops supposedly suffering seven times fewer losses than the Ukrainian military in Kherson.\n\nIt also came just six weeks after Vladimir Putin taunted Kyiv with the declaration that residents of Kherson and other occupied Ukrainian regions \"are becoming our citizens forever.\"\n\nPro-Kremlin bloggers had been expecting the pullout -- and raging against the decision as yet another \"abandonment\" by the Russian military.\n\nBut in the midst of the humiliating retreat, Kremlin-controlled proxy authorities on Wednesday announced the sudden death of one of the most high-profile leaders in the occupied Kherson region.\n\nKirill Stremousov, the deputy head of the region, was said to have been killed in a car accident. Vladimir Saldo, the Russian-installed governor of the region, took to Telegram to announce the news after it was first reported in Russian media.\n\nAnd just like that, pro-Kremlin military bloggers who'd been busy venting about Russia's \"shocking\" retreat from the region suddenly shifted to writing condolences for Stremousov, with his death apparently taking over as the top news of the day.\n\nFew details were given on the crash, and Russian-backed health officials in the region where it is said to have occurred refused to confirm that he'd died, saying only that they could confirm there was a traffic accident. Though Saldo said Stremousov had been killed in the Kherson region, some independent Russian media outlets noted that he'd confirmed in late August he had evacuated to Russia.\n\nThe murky nature of his reported death -- and the speed with which a slew of pro-Kremlin social media channels simultaneously posted condolences -- led some Ukrainian authorities to suggest the tragedy had been a deliberate hoax. Yuri Sobolevksy, the first deputy chair of the Kherson regional council, suggested Stremousov's death may have been \"staged\" in a statement on Facebook, though he did not elaborate.\n\nIt was not clear why he believed it may have been staged, but reports of Stremousov's death came amid mounting outrage among Russian hardliners about the retreat from Kherson.\n\nAnd as soon as his death was announced, they briefly shifted from publicly venting frustrations about military failures to penning tributes to Stremousov.\n\nShoigu's announcement, however, reignited the wrath of the Russian hardliners fed up with a string of recent retreats.\n\n\"The main thing is not victory, but participation,\" one popular Russian military channel quipped on Telegram.\n\n\"The surrender of Kherson is the biggest geopolitical defeat of Russia since the fall of the U.S.S.R.,\" wrote pro-Kremlin political analyst Sergei Markov. \"The political consequences of this huge defeat will be really big. The main reason for the defeat is the refusal [to carry out] a real war and the catastrophic delay in making necessary decisions.\"", "source": {"uri": "thedailybeast.com", "dataType": "news", "title": "The Daily Beast"}, "authors": [], "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1969,w_3500,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1668008363/GettyImages-1242220187_mzsqtd", "eventUri": "eng-8166048", "sentiment": -0.3098039215686275, "wgt": 164, "relevance": 1, "stanza_neg": 8, "stanza_neu": 14, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257103998", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:38:00", "dateTime": "2022-11-09T14:38:00Z", "dateTimePub": "2022-11-09T14:38:00Z", "dataType": "news", "sim": 0.6352941393852234, "url": "https://www.myjoyonline.com/kherson-russian-appointed-deputy-governor-stremousov-killed-in-car-crash/", "title": "Kherson Russian-appointed deputy governor Stremousov 'killed in car crash' - MyJoyOnline.com", "body": "The Russian-installed deputy governor of Kherson, Kirill Stremousov, has been killed, Russian state media say.\n\nThey quoted the regional governor's press service as saying he died in a car crash.\n\nMr Stremousov, 45, was appointed to his job two months after the Russian invasion of Ukraine.\n\nHe was one of the most prominent proponents of the Russian occupation and became known for aggressive statements on social media.\n\nHe was wanted for treason by the Ukrainian police.\n\nMany Russian-appointed officials in occupied Ukraine have been targeted in attacks.\n\nKherson, the only Ukrainian regional centre captured by Russian troops after the February invasion, is being targeted by a Ukrainian counter-offensive.\n\nIn recent days, Mr Stremousov had been urging civilians to leave the eastern bank of the Dnipro river in the face of the Ukrainian advance, amid indications that Russian forces may be abandoning the city.\n\nUkraine accuses Russia of forcibly deporting local residents.", "source": {"uri": "myjoyonline.com", "dataType": "news", "title": "MyJoyOnline.com"}, "authors": [], "image": "https://www.myjoyonline.com/wp-content/uploads/2022/11/image-121.png", "eventUri": "eng-8166048", "sentiment": -0.3098039215686275, "wgt": 162, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 1, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257172911", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:36:00", "dateTime": "2022-11-09T15:36:00Z", "dateTimePub": "2022-11-09T14:23:00Z", "dataType": "news", "sim": 0.6274510025978088, "url": "https://www.pravda.com.ua/eng/news/2022/11/9/7375642/", "title": "\"He's gone\": source of Ukrainska Pravda confirms death of Kherson Oblast occupation administration \"deputy head\"", "body": "The source of Ukrainska Pravda has confirmed the death of Kirill Stremousov, a so-called \"deputy head\" of the Russian occupation \"administration\" of Kherson Oblast.\n\nSource: The source of Ukrainska Pravda in law enforcement agencies\n\nQuote: \"The Russian-appointed deputy head of Kherson Oblast, Stremousov, has 'left' for a Kobzon's concert [The Ukrainian phrase \"to go to a Kobzon concert\", which means to die, refers to the late Iosif Kobzon, a popular Russian singer who supported Putin's regime - ed.].\"\n\nPreviously: On 9 November, Russian propagandists reported the death of Kirill Stremousov.\n\nSome Russian Telegram channels reported that he died in a car accident near the city of Henichesk, Kherson Oblast.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/6/e/6e76513-stremousov--1-.jpg", "eventUri": "eng-8166048", "sentiment": -0.4823529411764705, "wgt": 160, "relevance": 1, "stanza_neg": 1, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257534043", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "21:47:00", "dateTime": "2022-11-09T21:47:00Z", "dateTimePub": "2022-11-09T21:40:00Z", "dataType": "news", "sim": 0.6196078658103943, "url": "https://qtelegram.com/ministry-of-health-of-the-kherson-region-confirmed-the-death-of-deputy-governor-stremousov/38720/", "title": "\"Ministry of Health\" of the Kherson region confirmed the death of \"deputy governor\" Stremousov - The Quebec provincial newspaper", "body": "\"Ministry of Health\" Kherson region confirmed that the \"deputy governor\" Kirill Stremousov died in an accident in the region.\n\nThe ministry said that three cars had collided. Two people were also injured in the accident.\n\n\"Unfortunately, the doctors pronounced Kirill Stremousov dead. The Ministry of Health of the Kherson region expresses condolences to his family and friends. We wish the injured a speedy recovery, the doctors will provide them with all the necessary treatment,\" said the \"Minister of Health\". Kherson region Vadim Ilmiev.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.2313725490196078, "wgt": 158, "relevance": 1, "stanza_neg": 3, "stanza_neu": 3, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257295066", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "17:24:00", "dateTime": "2022-11-09T17:24:00Z", "dateTimePub": "2022-11-09T17:08:00Z", "dataType": "news", "sim": 0.6078431606292725, "url": "https://www.pehalnews.in/putin-hit-with-humiliating-retreat-and-mystery-death-of-crony/2625778/", "title": "Putin Hit With Humiliating Retreat -- and Mystery Death of Crony - Pehal News", "body": "Russian troops have begun to retreat from Ukraine's Kherson region, simply the most recent humiliating pullout to go away pro-Kremlin military bloggers and propagandists fuming.\n\nRussian Defense Minister Sergei Shoigu handed down the order on Wednesday afternoon to drag out to the opposite aspect of the Dnipro River. The transfer got here after Russian troops reportedly started blowing up bridges as they pulled out, with Russian flags being faraway from buildings within the heart of Kherson -- the one regional capital captured by Russian forces within the full-scale invasion.\n\n\"For us, life and health of the military personnel is always the priority,\" Shoigu mentioned in asserting the choice.\n\nBizarrely, the order got here after Sergei Surovikin, Russia's prime commander in Ukraine, boasted of Russian troops supposedly struggling seven instances fewer losses than the Ukrainian army in Kherson.\n\nIt additionally got here simply six weeks after Vladimir Putin taunted Kyiv with the declaration that residents of Kherson and different occupied Ukrainian areas \"are becoming our citizens forever.\"\n\nPro-Kremlin bloggers had been anticipating the pullout -- and raging in opposition to the choice as one more \"abandonment\" by the Russian army.\n\nBut within the midst of the humiliating retreat, Kremlin-controlled proxy authorities on Wednesday introduced the sudden dying of one of essentially the most high-profile leaders within the occupied Kherson area.\n\nRussia Ratchets Up Panic as Civilians Told to Leave Kherson\n\nKirill Stremousov, the deputy head of the area, was mentioned to have been killed in a automobile accident. Vladimir Saldo, the Russian-installed governor of the area, took to Telegram to announce the information after it was first reported in Russian media.\n\nAnd similar to that, pro-Kremlin army bloggers who'd been busy venting about Russia's \"shocking\" retreat from the area instantly shifted to writing condolences for Stremousov, together with his dying apparently taking on as the highest information of the day.\n\nFew particulars got on the crash, and Russian-backed well being officers within the area the place it's mentioned to have occurred refused to verify that he'd died, saying solely that they may verify there was a site visitors accident. Though Saldo mentioned Stremousov had been killed within the Kherson area, some impartial Russian media retailers famous that he'd confirmed in late August he had evacuated to Russia.\n\nThe murky nature of his reported dying -- and the velocity with which a slew of pro-Kremlin social media channels concurrently posted condolences -- led some Ukrainian authorities to recommend the tragedy had been a deliberate hoax. Yuri Sobolevksy, the primary deputy chair of the Kherson regional council, advised Stremousov's dying might have been \"staged\" in an announcement on Facebook, although he didn't elaborate.\n\nIt was not clear why he believed it might have been staged, however experiences of Stremousov's dying got here amid mounting outrage amongst Russian hardliners concerning the retreat from Kherson.\n\nAnd as quickly as his dying was introduced, they briefly shifted from publicly venting frustrations about army failures to penning tributes to Stremousov.\n\nShoigu's announcement, nonetheless, reignited the wrath of the Russian hardliners fed up with a string of latest retreats.\n\n\"The main thing is not victory, but participation,\" one common Russian army channel quipped on Telegram.\n\n\"The surrender of Kherson is the biggest geopolitical defeat of Russia since the fall of the U.S.S.R.,\" wrote pro-Kremlin political analyst Sergei Markov. \"The political consequences of this huge defeat will be really big. The main reason for the defeat is the refusal [to carry out] a real war and the catastrophic delay in making necessary decisions.\"\n\nRead more at The Daily Beast.\n\nGet the Daily Beast's biggest scoops and scandals delivered right to your inbox. Sign up now.", "source": {"uri": "pehalnews.in", "dataType": "news", "title": "Pehal News"}, "authors": [], "image": "https://s.yimg.com/ny/api/res/1.2/isKltLKFIn2SxugeLINVuw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5Ng--/https://media.zenfs.com/en/thedailybeast.com/f8f782f902e2bd88ef6e15f900c9ae3d", "eventUri": "eng-8166048", "sentiment": -0.2862745098039216, "wgt": 155, "relevance": 1, "stanza_neg": 6, "stanza_neu": 20, "stanza_pos": 0, "swn_neg": 26, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257614715", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "23:33:00", "dateTime": "2022-11-09T23:33:00Z", "dateTimePub": "2022-11-09T23:32:00Z", "dataType": "news", "sim": 0.6000000238418579, "url": "https://www.stuff.co.nz/world/europe/300735778/top-russian-official-in-ukraine-killed-in-crash--reports", "title": "Top Russian official in Ukraine killed in crash - reports", "body": "One of Russia's top officials in the illegally annexed region of Kherson has been killed in a car accident, reports say.\n\nKirill Stremousov, the deputy head of the region, died in a crash in Crimea, CNN reported.\n\nIt was believed that he was killed while taking evasive action to avoid a truck.\n\nStremousov was a Ukrainian who had given his allegiance to Russia.\n\n* Russia announces withdrawal from Ukraine's Kherson, nearby areas\n\n* Neighbours go to war with each other in Ukrainian village after Russians leave\n\n* Russian soldier catches and throws away bomb dropped by Ukranian drone\n\n* US privately asks Ukraine to show it's open to negotiate with Russia\n\nMeanwhile, Russia earlier announced it would withdraw troops from Kherson, in a move that would mark one of Russia's worst setbacks in the 8-month-old war.", "source": {"uri": "stuff.co.nz", "dataType": "news", "title": "Stuff"}, "authors": [], "image": "https://resources.stuff.co.nz/content/dam/images/4/z/1/h/p/4/image.related.StuffLandscapeSixteenByNine.1420x800.4z1t7m.png/1668036696748.jpg", "eventUri": "eng-8166048", "sentiment": -0.6470588235294117, "wgt": 153, "relevance": 1, "stanza_neg": 4, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7259860989", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "13:39:00", "dateTime": "2022-11-11T13:39:00Z", "dateTimePub": "2022-11-11T13:22:00Z", "dataType": "news", "sim": 0.5960784554481506, "url": "https://www.themoscowtimes.com/2022/11/11/funeral-of-senior-russian-installed-kherson-official-held-in-crimea-a79354", "title": "Funeral of Senior Russian-Installed Kherson Official Held in Crimea", "body": "Kirill Stremousov, the deputy head of the Moscow-installed administration in the occupied Kherson region of Ukraine, was buried in the Crimean city of Sevastopol on Friday, state-run news agency RIA Novosti reported.\n\nStremousov, 45, died in an apparent car accident near the town of Henichesk on Wednesday, according to local officials.\n\nThe funeral ceremony was attended by the Kremlin's first deputy chief of staff, Sergei Kiriyenko; the Russian-appointed governors of the Kherson and Zaporizhzhia regions, Vladimir Saldo and Yevgeny Balitsky; and the head of Russian-annexed Crimea, Sergei Aksyonov.\n\nStremousov is the most senior Russian-appointed official in occupied Ukraine to die since the start of the invasion. Known for being an anti-vaxxer before the war, he enthusiastically welcomed the arrival of Russian forces in Kherson in March.", "source": {"uri": "themoscowtimes.com", "dataType": "news", "title": "The Moscow Times"}, "authors": [], "image": "https://static.themoscowtimes.com/image/og/ba/79354__baffbedecef216f48f2c41b21d49eff5.jpg", "eventUri": "eng-8166048", "sentiment": -0.2941176470588235, "wgt": 152, "relevance": 1, "stanza_neg": 0, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259758435", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "12:16:00", "dateTime": "2022-11-11T12:16:00Z", "dateTimePub": "2022-11-11T11:52:00Z", "dataType": "news", "sim": 0.5921568870544434, "url": "https://tass.com/society/1535341", "title": "Deputy Head of Kherson Region Kirill Stremousov buried in Simferopol", "body": "SIMFEROPOL, November 11. /TASS/. Deputy Governor of the Kherson Region Kirill Stremousov was buried on Friday in the central alley of Abdal cemetery in Simferopol, a TASS correspondent reported.\n\nThe ceremony was held at the St. Alexander Nevsky Cathedral in the Crimean capital of Simferopol. Family and friends, as well as representatives of government and the public, totaling in 200 people, came to bid farewell. The coffin was opened during the funeral.\n\nStremousov died in a car crash in the Kherson Region on November 9. In 2018-2019, he was the chairman of the Kherson regional branch of the Ukrainian Socialist Party, which in 2022 became one of the so-called pro-Russian parties whose activities are banned in Ukraine. In October 2020, Stremousov ran for Kherson's city mayor as an independent candidate. In 2021, he joined the Derzhava party (its activities were banned in Ukraine in 2022). Russian troops took control of the Kherson Region in 2022 during Moscow's special military operation. In April 2022, Stremousov took the position of deputy head of the regional military-civilian administration. He obtained a Russian passport in September 2022.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20221111/1370861.jpg", "eventUri": "eng-8166048", "sentiment": -0.01960784313725494, "wgt": 151, "relevance": 1, "stanza_neg": 2, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257168246", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "15:32:00", "dateTime": "2022-11-09T15:32:00Z", "dateTimePub": "2022-11-09T15:26:00Z", "dataType": "news", "sim": 0.5843137502670288, "url": "https://www.nbcnews.com/news/world/russia-ukraine-war-kherson-retreat-kirill-stremousov-rcna56362", "title": "Russia announces retreat from key city in southern Ukraine", "body": "Russia disputes heavy losses after 'incomprehensible' battle in Ukraine\n\nSenior Kremlin officials on Wednesday announced that Russian forces were withdrawing from Kherson, a key city in southern Ukraine -- the latest in a series of embarrassing military setbacks.\n\nIn televised comments, Defense Minister Sergei Shoigu said he was ordering the withdrawal of troops across the Dnieper River, according to Reuters. Gen. Sergei Surovikin, the overall commander of Russian forces in Ukraine, said he proposed to take up defensive lines on the eastern bank of the river.\n\nThe announcement came after Ukrainian officials said Russians forces were deliberately blowing up bridges around the city.\n\n\"The occupiers are currently undermining absolutely all the bridges on the right bank of the Kherson region,\" Serhii Khlan, the deputy head of Kherson's regional council, said in a Telegram post.\n\nUkrainian and Russian forces clashed overnight in the town Snihurivka, around 30 miles north of Kherson, Kirill Stremousov, the Russian-installed deputy civilian administrator of the Kherson region, said in a post on his Telegram channel.\n\nCiting the local administration, some Russian state media reported that Stremousov had died in a road accident on Wednesday, although some outlets later appeared to suggest it was too early to tell whether he had been killed.\n\nStremousov had posted regular video updates on social media -- including while in vehicles moving at speed -- about the situation on the frontline.\n\nNews of his death came as several pro-Kremlin bloggers criticized the decision to withdraw.\n\nRussia has fought for months to hang on to the pocket of land it holds on the west bank of the river that bisects Ukraine, as well as Kherson city, the only major Ukrainian city that Russian forces have captured intact since the invasion began Feb. 24.\n\nMoscow declared at the end of September that it had annexed Kherson, along with the Donetsk, Luhansk and Zaporizhzia regions after staging referendums that were denounced by Kyiv and the West as illegal and rigged.\n\nAnd it has poured in tens of thousands of troops as reinforcements in the region, which is also home to the huge Nova Kakhovka dam on the Dnieper. The dam holds back an enormous reservoir and controls the water supply to the Crimean Peninsula, which Russia annexed in 2014.\n\nHowever, late last month, Russian-installed authorities ordered residents to leave the city, saying in a statement on their Telegram channel that they should board boats across the Dnieper river. They added that all departments and ministries of the Kremlin-installed administration should also evacuate to escape advancing Ukrainian forces.\n\nThe Ukrainian military has targeted the main river crossings for months, making it difficult for Russia to supply its huge force on the river's west bank. Since bursting through the Russian front line at the start of October, they have advanced down the river.", "source": {"uri": "nbcnews.com", "dataType": "news", "title": "NBC News"}, "authors": [], "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/rockcms/2022-11/221109-kherson-mb-1337-597836.jpg", "eventUri": "eng-8166048", "sentiment": -0.2156862745098039, "wgt": 149, "relevance": 1, "stanza_neg": 2, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257452371", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "20:07:00", "dateTime": "2022-11-09T20:07:00Z", "dateTimePub": "2022-11-09T19:41:00Z", "dataType": "news", "sim": 0.5764706134796143, "url": "https://qtelegram.com/rossmi-published-photos-and-videos-from-the-place-of-death-of-stremousov/38704/", "title": "RosSMI published photos and videos from the place of death of Stremousov - The Quebec provincial newspaper", "body": "Russian media published a photo from the scene of an accident in which Kherson collaborator Kirill Stremousov allegedly died. , who made a dangerous maneuver, a source told RIA Novosti. According to him, Stremousov's driver lost control while trying to avoid a collision. Stremousov's off-road vehicle was severely damaged: the armored capsule was torn off the chassis,\" the report says.\n\nThe Kherson region refused to confirm Stremousov's death.\n\nRussian mass media were the first to write about Stremousov's death. They claim that he died in an accident near Genichesk, in the occupied part of the Kherson region.\n\nMeanwhile, a road sign got onto the footage from the place of Kirill Stremousov's death. According to him, the distance from the place of the accident to Kherson is 64 kilometers.\n\nThe occupying authorities of the Kherson region assure that Stremousov died near Genichesk. But there is a caveat - this city is located more than 200 km from Kherson.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.6235294117647059, "wgt": 147, "relevance": 1, "stanza_neg": 3, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258468537", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "14:33:00", "dateTime": "2022-11-10T14:33:00Z", "dateTimePub": "2022-11-10T14:33:00Z", "dataType": "news", "sim": 0.5607843399047852, "url": "https://www.news18.com/videos/world/russia-s-kherson-deputy-head-dies-mysteriously-just-before-putin-withdraws-troops-i-ukraine-war-6356089.html", "title": "Russia's Kherson Deputy Head Dies Mysteriously Just Before Putin Withdraws Troops I Ukraine War", "body": "Kirill Stremousov, a Russian-installed official in Kherson died in a car crash hours before Moscow ordered a troop withdrawal in the region. Moscow-installed officials said the crash happened on a road between Kherson city and Armyansk in Crimea. Kirill's armoured car reportedly exploded on impact while trying to avoid a lorry driver who made \"a dangerous manoeuvre.\" Kirill has been posthumously awarded the Order of Courage by Russian President Vladimir Putin. He was prominent in organising and supporting the region's annexation by Russia following a \"referendum.\" Stremousov was well known on social media for his anti-Ukraine rhetoric and his daily addresses about news from the frontline. In recent weeks, he gave updates on the \"evacuation\" of civilians from the right bank of the Dnipro river in anticipation. But Kirill notoriety exited even before his pro-Russian role during the Russian-Ukraine war. Who was Kirill Stremousov? Watch this video to find out.", "source": {"uri": "news18.com", "dataType": "news", "title": "News18"}, "authors": [], "image": "https://images.news18.com/ibnlive/uploads/2022/11/1668089976_285aee49-948e-4671-b5d3-4a33e6d2f33a-16680899763x2.jpeg", "eventUri": "eng-8166048", "sentiment": -0.06666666666666665, "wgt": 143, "relevance": 1, "stanza_neg": 1, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257113561", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "14:46:00", "dateTime": "2022-11-09T14:46:00Z", "dateTimePub": "2022-11-09T14:09:00Z", "dataType": "news", "sim": 0.545098066329956, "url": "https://www.latestly.com/socially/sports/cricket/kane-williamson-likely-to-be-released-by-sunrisers-hyderabad-ahead-of-ipl-2023-auction-4438776.html", "title": "Kane Williamson Likely to be Released by SunRisers Hyderabad Ahead of IPL 2023 Auction | 🏏 LatestLY", "body": "Kirill Stremousov, Russian-Installed Deputy Head of Ukraine's Kherson Region, Dies in Car Crash Nitin Patel, Former Deputy CM of Gujarat Says He Will Not Contest Upcoming Assembly Elections Kirill Stremousov, Russian-Installed Deputy Head of Ukraine's Kherson Region, Dies in Car Crash", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2022/11/13-3-784x441.jpg", "eventUri": "eng-8166048", "sentiment": -0.6627450980392157, "wgt": 139, "relevance": 1, "stanza_neg": 1, "stanza_neu": 0, "stanza_pos": 0, "swn_neg": 1, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257451413", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "20:06:00", "dateTime": "2022-11-09T20:06:00Z", "dateTimePub": "2022-11-09T19:58:00Z", "dataType": "news", "sim": 0.5215686559677124, "url": "https://tass.com/politics/1534513", "title": "Putin awards a posthumous Order of Courage on Kherson Region deputy governor  --  decree", "body": "Stremousov, the deputy chief of the civil and military administration of the Kherson Region, shall be awarded the Order of Courage posthumously\n\nMOSCOW, November 9. /TASS/. Russian President Vladimir Putin has awarded a posthumous Order of Courage to Kherson Region Deputy Governor Kirill Stremousov, who was killed in a car crash on Wednesday.\n\n\"For courage and valor displayed in the line of duty, Kirill Sergeyevich Stremousov, the deputy chief of the civil and military administration of the Kherson Region, shall be awarded the Order of Courage (posthumously),\" says the decree published on Wednesday.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "eventUri": "eng-8166048", "sentiment": 0.3098039215686275, "wgt": 133, "relevance": 1, "stanza_neg": 1, "stanza_neu": 0, "stanza_pos": 3, "swn_neg": 4, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258063080", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "09:06:00", "dateTime": "2022-11-10T09:06:00Z", "dateTimePub": "2022-11-10T08:40:00Z", "dataType": "news", "sim": 0.5137255191802979, "url": "https://qtelegram.com/ministry-of-health-of-the-kherson-region-does-not-confirm-the-death-of-stremousov/38758/", "title": "\"Ministry of Health\" of the Kherson region does not confirm the death of Stremousov - The Quebec provincial newspaper", "body": "The \"Ministry of Health\" appointed by the Russian forces Kherson region does not yet confirm the death of the \"deputy governor\" region, Kirill Stremousov, who, according to media reports, died in an accident.\n\nThe department confirmed the fact of an accident and stated that they were investigating Stremousov's condition. RIA Novosti writes about this.\n\n\"The information about his death is not official. As soon as the doctors assess his condition, we will provide information,\" the \"Ministry of Health\" said.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.3960784313725491, "wgt": 131, "relevance": 1, "stanza_neg": 1, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258863617", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "20:45:00", "dateTime": "2022-11-10T20:45:00Z", "dateTimePub": "2022-11-10T20:45:00Z", "dataType": "news", "sim": 0.4941176474094391, "url": "http://cominf.org/en/node/1166546658", "title": "Alan Gagloev expressed his condolences to the Acting Governor of the", "body": "President of South Ossetia Alan Gagloev sent a telegram of condolences to Acting Governor of the Kherson region Vladimir Saldo in connection with the tragic death of prominent political and public figure Kirill Stremousov, the press service of the head of state reports.\n\n\"I received the news of the tragic death of the prominent political and public figure, Deputy Governor of the Kherson region Kirill Sergeevich Stremousov with a feeling of deep sorrow,\" the telegram of condolences says.\n\nAccording to Gagloev, a patriot who devoted himself to serving the people and his native land has passed away.\n\n\"On behalf of the people of the Republic of South Ossetia and on my own behalf, I send you, all the relatives and friends of the deceased, sincere condolences,\" the head of state noted in the letter of condolence.\n\nIt should be reminded that the death of Kirill Stremousov became known last Thursday. A political and public figure died as a result of a traffic accident.", "source": {"uri": "cominf.org", "dataType": "news", "title": "Государственное информационное агентство \"Рес\""}, "authors": [], "image": "http://cominf.org/sites/default/files/brand/iares-logo-600x316.png", "eventUri": "eng-8166048", "sentiment": -0.2627450980392156, "wgt": 126, "relevance": 1, "stanza_neg": 1, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258063077", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "09:06:00", "dateTime": "2022-11-10T09:06:00Z", "dateTimePub": "2022-11-10T08:40:00Z", "dataType": "news", "sim": 0.4901960790157318, "url": "https://qtelegram.com/stremousovs-death-military-commander-kots-claims-he-was-not-in-the-car/38760/", "title": "Stremousov's \"death\": military commander Kots claims he was not in the car - The Quebec provincial newspaper", "body": "Around the death of the \"deputy governor\" More and more ambiguous details appear in the Kherson region of Kirill Stremousov.\n\nAccording to some sources, at the time of the accident, journalist and military commander Alexander Kots was allegedly in the car with Stremousov.\n\nKots himself hastened to refute this information.\n\n\"I was surprised to learn that at the time of the accident he was in a car with Stremousov and survived. I was not in the same car with him, and I do not know where he crashed. I actually saw him in person once a week ago,\" Kotz wrote.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8166048", "sentiment": -0.1372549019607843, "wgt": 125, "relevance": 1, "stanza_neg": 2, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257624557", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "23:48:00", "dateTime": "2022-11-09T23:48:00Z", "dateTimePub": "2022-11-09T23:48:00Z", "dataType": "news", "sim": 0.4823529422283173, "url": "https://www.pravda.com.ua/eng/news/2022/11/9/7375687/", "title": "Putin decorates Kherson Oblast collaborator Stremousov posthumously", "body": "Russian President Vladimir Putin has posthumously awarded the Order of Courage medal to Kirill Stremousov, one of the Russian-installed puppet leaders of the Kherson Oblast occupation authorities.\n\nSource: Putin's decree on the Kremlin website\n\nDetails: Following Russian media reports of Stremousov's death in a traffic accident, Putin signed a decree awarding this supporter of \"Russian world\" the Order of Courage on 9 November. [Russkiy mir, literally \"Russian world\" or \"Russian order\", is the concept of total domination of Russian culture over other cultures; it gives rise to and \"legitimises\" Russia's current expansionist, colonial politics - ed.]\n\nQuote from the decree: \"For the courage and bravery shown in the line of duty, to award the Order of Courage to Kirill Sergeevich Stremousov, Deputy Head of the Military-Civilian Administration of Kherson Oblast (posthumously).\"\n\nPreviously: Russian media reported on 9 November that Kirill Stremousov had died in a traffic accident. A lorry driver was allegedly responsible for the accident; the armoured car of the collaborator exploded on impact.\n\nA few days ago, Putin posthumously awarded the title of Hero of Russia to Mikhail Vasiliev, a clergyman of the Moscow diocese who died in the war in Ukraine on 6 November. This Russian priest was famous for stating that if women in Russia bore more children it would be easier for them to send their sons away to fight.\n\nJournalists fight on their own frontline. Support Ukrainska Pravda or become our patron!", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/7/3/7375687_fb_image_eng_2022_11_10_00_09_50.png", "eventUri": "eng-8166048", "sentiment": 0.03529411764705892, "wgt": 123, "relevance": 1, "stanza_neg": 0, "stanza_neu": 9, "stanza_pos": 2, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257211701", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "16:10:00", "dateTime": "2022-11-09T16:10:00Z", "dateTimePub": "2022-11-09T15:29:00Z", "dataType": "news", "sim": 0.4705882370471954, "url": "https://www.latestly.com/socially/entertainment/hollywood/i-wanna-dance-with-somebody-trailer-2-the-movies-promises-to-be-a-powerful-celebration-of-the-legendary-whitney-houston-4439151.html", "title": "I Wanna Dance With Somebody Trailer 2: The Movie Promises To Be a Powerful Celebration of the Legendary Whitney Houston (Watch Video) | 🎥 LatestLY", "body": "Kirill Stremousov, Russian-Installed Deputy Head of Ukraine's Kherson Region, Dies in Car Crash Russia Orders Military To Withdraw From Ukraine's Kherson City Rahul Gandhi Says Airbus Project Went From Maharashtra Because of Assembly Elections in Gujarat (Watch Video)", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2022/11/23-3-1-784x441.jpg", "eventUri": "eng-8166048", "sentiment": -0.403921568627451, "wgt": 120, "relevance": 1, "stanza_neg": 0, "stanza_neu": 1, "stanza_pos": 0, "swn_neg": 1, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257674562", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "01:04:00", "dateTime": "2022-11-10T01:04:00Z", "dateTimePub": "2022-11-10T01:04:00Z", "dataType": "news", "sim": 0.4666666686534882, "url": "https://www.theguardian.com/world/2022/nov/10/russia-ukraine-war-at-a-glance-what-we-know-on-day-260-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 260 of the invasion", "body": "The Nato secretary general, Jens Stoltenberg, said Russia's retreat was \"part of an overall pattern\" demonstrating that Moscow \"has absolutely lost the momentum\". \"But we should not underestimate Russia, they still have capabilities,\" he told Sky News. \"We have seen the drones, we have seen the missile attacks. It shows that Russia can still inflict a lot of damage.\"\n\nThe deputy head of the Russian-installed administration in the Kherson region died in a car crash, state news agencies reported, citing local Russian-backed officials. Kirill Stremousov, previously an anti-vaccine blogger and political marginal, emerged as one of the most prominent public faces of the Russian occupation of Ukraine. Putin posthumously decorated Stremousov with the Order of Courage, the Kremlin said on Wednesday.", "source": {"uri": "theguardian.com", "dataType": "news", "title": "The Guardian"}, "authors": [{"uri": "samantha_lock@theguardian.com", "name": "Samantha Lock", "type": "author", "isAgency": false}], "image": "https://i.guim.co.uk/img/media/712363a763cc2af19805a45844f9aa63bfa15330/0_321_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=5cbbdef41d41b19755ae43bdd761ed9e", "eventUri": "eng-8166048", "sentiment": -0.04313725490196074, "wgt": 119, "relevance": 1, "stanza_neg": 3, "stanza_neu": 3, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257520301", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "21:30:00", "dateTime": "2022-11-09T21:30:00Z", "dateTimePub": "2022-11-09T21:00:00Z", "dataType": "news", "sim": 0.4666666686534882, "url": "https://www.urdupoint.com/en/miscellaneous/moscow-installed-official-in-ukraines-kherso-1592264.html", "title": "Moscow-installed Official In Ukraines Kherson Dies In Car Crash - UrduPoint", "body": "Stremousov, 45, was one of the highest-profile officials in Ukraine supporting Moscow's offensive.\n\nRussian President Vladimir Putin posthumously awarded him the Order of Courage for \"the courage and bravery shown in the performance of his duties\", according to a decree on the presidential website.\n\nStremousov's aide, speaking to AFP, confirmed his death.\n\n\"I confirm the death of Kirill Sergeyevich,\" the aide said, referring to Stremousov by his first name and patronymic.\n\nSaldo called Stremousov one of the \"brightest\" people he has known and said he leaves behind five children, with a sixth due soon.", "source": {"uri": "urdupoint.com", "dataType": "news", "title": "UrduPoint"}, "authors": [], "image": "https://photo-cdn.urdupoint.com/images/UrduPoint-English-22.png", "eventUri": "eng-8166048", "sentiment": -0.06666666666666665, "wgt": 119, "relevance": 1, "stanza_neg": 1, "stanza_neu": 3, "stanza_pos": 1, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259495679", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "18:46:19", "dateTime": "2022-11-10T18:46:19Z", "dateTimePub": "2022-11-10T18:46:19Z", "dataType": "news", "sim": 0.4470588266849518, "url": "https://www.msn.com/en-us/news/world/vladimir-putin-mystery-deaths-mounting-as-presidents-former-ally-and-his-deputy-leader-both-pass-away/ar-AA13Y4xp", "title": "Vladimir Putin: Mystery deaths mounting as President's former ally and his deputy leader both pass away", "body": "Two additional mystery deaths join a long list of prominent Russians who have faded since the beginning of the Ukraine War.\n\nReplay Video SETTINGS OFF HD HQ SD LO Skip Ad\n\nViktor Chersekov, a former Vladimir Putin ally, and Kirill Stemousov, the pro-Russian installed deputy leader of the Kherson region in Ukraine, have perished.\n\nLoad Error\n\nThe former spy mentor\n\nViktor Chersekov, aged 72, has died reportedly from a 'serious illness' which has not been disclosed yet, Newsweek reports citing local Russian media.\n\nAccording to the Dail Mail, Chersekov has been described as a 'former spy mentor' of Vladimir Putin.\n\nFor most of his career, Chersekov served as a KGB officer, the infamous secret service of the Soviet Union. After that, he became the head of the FSB, the Russian successor agency of the KGB, for the St. Petersburg region a position he held from 1992 to 1998.\n\nIt is during this period that Chersekov aided Vladimir Putin's rise to power and the two became allies, BBC reports.\n\nAn alliance which lasted only a decade, as Chersekov fell from Putin's grace after starting to become critical of the high corruption levels among the Russian secret services.\n\nOne published article in 2007 by Chersekov brought to light a large corruption scandal, for which Putin was not happy and had commented saying there was 'no need to make such information public', Newsweek reports.\n\nThereafter, Chersekov had been demoted to a lesser important job within another state agency. He eventually joined the ranks of the Russian Communist Party, and as a lawmaker, he mostly backed Putin's government and its decisions.\n\n© Provided by Oh My Mag Vladimir Putin: Mystery deaths keep mounting Contributor / Contributeur The pro-Russian deputy leader in Kherson\n\nMeanwhile, according to CNN, in the illegally annexed territory of Kherson, Kirill Stemousov, the Pro-Russian installed deputy leader, has been reported to have died after a fatal car accident.\n\nHis death was announced Wednesday morning, while in the afternoon Russian Defense Minister Sergey Shoigu ordered the withdrawal of his forces from Kherson.\n\nReportedly, Stremousov was among the first to have become part of pro-Russian interests in the region, but he was also highly critical of the miscalculation on the side of the Russian military on his Telegram channel.\n\n'He had blamed the military setbacks in Kherson on incompetent commanders who had not been held accountable for their mistakes.'\n\nAccording to CNN, Stremousov is not the first separatist leader in Russian-held territories in Ukraine to die in murky circumstances.\n\nSources used:\n\n-Newsweek: 'Former Putin Ally Who Helped Russian Leader's Rise to Power Has Died\n\n-Daily Mail: 'Putin spy mentor who was demoted after daring to criticise the Russian leader dies from unexplained 'serious disease' - the latest in a number of top officials who have recently died in suspicious circumstances'\n\n-BBC: 'Victor Cherkesov, former director of the Federal Drug Control Service and a disgraced associate of Putin, dies'\n\n-CNN: 'Senior Russian-appointed official in occupied Kherson 'killed in road accident'\n\nContinue Reading Show full articles without \"Continue Reading\" button for {0} hours.", "source": {"uri": "msn.com", "dataType": "news", "title": "MSN International Edition"}, "authors": [{"uri": "luan_trimi@msn.com", "name": "Luan Trimi", "type": "author", "isAgency": false}], "image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA13YnsE.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "eventUri": "eng-8166048", "sentiment": -0.1215686274509804, "wgt": 114, "relevance": 1, "stanza_neg": 7, "stanza_neu": 20, "stanza_pos": 1, "swn_neg": 28, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259713006", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "11:40:00", "dateTime": "2022-11-11T11:40:00Z", "dateTimePub": "2022-11-11T11:38:00Z", "dataType": "news", "sim": 0.4392156898975372, "url": "https://www.pravda.com.ua/eng/news/2022/11/11/7375902/", "title": "Collaborator Stremousov has funeral service in Simferopol, coffin is opened", "body": "The deceased Kirill Stremousov, one of the Russian-installed puppet leaders of the Kherson Oblast occupation authorities, was buried in occupied Simferopol.\n\nSource: Kremlin-aligned news outlet RIA Novosti\n\nDetails: The funeral service for Stremousov was held in the Alexander Nevsky Cathedral in Simferopol at 11:00.\n\nThe ceremony was prepared in advance: funeral wreaths were put up in the church, and a photo of the deceased with a mourning ribbon was put on the memorial table. Stremousov will be buried on Friday at the central cemetery in Simferopol.\n\nThe propagandists have reported that the coffin with the body of Stremousov was taken to the cathedral; then, it was opened and put in the centre of the premises. The face of the deceased is covered with a veil.\n\nThey have also published a video of farewell to Stremousov by other collaborators Yevhen Balytskyi, Volodymyr Saldo, Mikhail Razvozhayev, and Sergei Aksyonov.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/1/3/139d465-clipboard01.jpg", "eventUri": "eng-8166048", "sentiment": -0.1294117647058823, "wgt": 112, "relevance": 1, "stanza_neg": 2, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]