[{"uri": "7002763692", "lang": "eng", "isDuplicate": false, "date": "2022-04-13", "time": "18:18:00", "dateTime": "2022-04-13T18:18:00Z", "dateTimePub": "2022-04-13T17:57:00Z", "dataType": "news", "sim": 0.8392156958580017, "url": "https://therussophile.org/evidence-that-the-missile-of-the-kramatorsk-station-massacre-is-not-russian-but-ukrainian-by-manlio-dinucci.html/", "title": "Evidence that the missile of the Kramatorsk station massacre is not Russian, but Ukrainian, by Manlio Dinucci - Russia News Now", "body": "The serial number of the Tochka-U missile that hit the Kramatorsk railway station on April 8, 2022 is (in Russian) Ш91579 or (in English) Sh91579. This serial number marks the stock of Tochka-U missiles in the possession of the Ukrainian military. Only the Ukrainian Armed Forces have Tochka-U missiles. Russia does not have any since 2019: they have all been deactivated. The Donetsk and Lugansk People's Republics do not have and have never had Tochka-Us.\n\nThe direction of the cone and tail section of the missile that landed on the field near the Kramatorsk railway station clearly shows that it was launched by the 19th Ukrainian Missile Brigade, based near Dobropolia, 45 km from Kramatorsk.\n\nPreviously the Ukrainian Armed Forces used Tochka-U missiles of the same series as Ш915611, launched at Berdyansk and a Ш915516, launched at Melitopol. The same missiles were used against Donetsk and Lugansk.", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/04/216416-0ea78.webp?fit=400%2C300&ssl=1", "eventUri": "eng-7637285", "sentiment": 0.1137254901960785, "wgt": 214, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7003018480", "lang": "eng", "isDuplicate": false, "date": "2022-04-13", "time": "23:34:00", "dateTime": "2022-04-13T23:34:00Z", "dateTimePub": "2022-04-13T23:34:00Z", "dataType": "news", "sim": 0.7921568751335144, "url": "https://www.freedomsphoenix.com/News/323827-2022-04-13-evidence-that-the-missile-that-caused-the-massacre-in-kramatorsk.htm", "title": "Evidence that the Missile that Caused the Massacre in Kramatorsk Is Not Russian but Ukrainian", "body": "Evidence that the Missile that Caused the Massacre in Kramatorsk Is Not Russian but Ukrainian\n\nhis serial number marks the stock of Tochka-U missiles in the possession of the Ukrainian Army. Only the Ukrainian Armed Forces have Tochka-U missiles. Russia has not had them since 2019: they have all been deactivated. The Donetsk and Lugansk People's Republics do not have and have never had Tochka-U.\n\nThe direction of the cone and the tail section of the missile that landed on the ground near the Kramatorsk train station clearly shows that it was fired from the 19th Ukrainian Missile Brigade, deployed near Dobropolie 45 km from Kramatorsk.\n\nPreviously the Ukrainian Armed Forces have used Tochka-U missiles of the same series as ?915611 fired at Berdyansk and ?915516 fired at Melitopol. The same missiles were used against Donetsk and Lugansk.", "source": {"uri": "freedomsphoenix.com", "dataType": "news", "title": "freedomsphoenix.com"}, "authors": [{"uri": "robert_lee@freedomsphoenix.com", "name": "Robert Lee", "type": "author", "isAgency": false}], "image": "https://www.freedomsphoenix.com/Uploads/Graphics/522-0413134802-index.jpg", "eventUri": "eng-7637285", "sentiment": -0.1294117647058823, "wgt": 202, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "6998880457", "lang": "eng", "isDuplicate": false, "date": "2022-04-10", "time": "23:10:00", "dateTime": "2022-04-10T23:10:00Z", "dateTimePub": "2022-04-10T22:50:00Z", "dataType": "news", "sim": 0.7686274647712708, "url": "https://therussophile.org/last-point-in-kievs-lies-about-bloody-attack-on-civilians-with-tochka-u-missile.html/", "title": "Last Point In Kiev's Lies About Bloody Attack On Civilians With Tochka-U Missile - Russia News Now", "body": "On April 8, a Ukrainian Tochka-U missile hit the railway station in the city of Kramatorsk. As a result, at least 57 civilians were killed, dozens more were injured.\n\nAccording to the traditional scenario, immediately after the incident, the Ukrainian authorities sent foreign reporters to the town. However, this time the plan went wrong. The journalists filmed the serial number of the Tochka-U missile which killed dozens of civilians. They left no doubts that the missile was launched by the AFU.\n\nThe Tochka-U missile in Kramatorsk has a series number Sh91579:\n\nThe Tochka-U missiles, including of the Sh915 series, are actively used by the AFU on the Donbass front lines. The following cases of the strikes with missiles of the same series have been recorded so far:\n\nThese are only cases confirmed by the footage from the area and which proved the use of the Tochka-U missiles of the SH-915 series only.\n\nAnother example was the Tochka-U missile that hit Avdiivka which is under the control of the AFU on March 11, 2022. The fact that the series number was blurred by the National Police of Ukraine confirms that this was not Russian but Ukrainian missile. There would be no need to hide the number if it was the Russian missile.\n\nThis is yet another evidence that on April 8, 2022, the AFU intentionally killed dozens of civilians who were trying to leave the town of Kramatorsk, amassing in the railway station. Moreover, the day before, the local authorities called on the citizens to leave Kramatorsk as soon as possible. Thus, this was a planned provocation by the Kiev regime. They called as many civilians to the station as possible right before the attack.\n\nThe same scenario of the bloody attack on civilians was used on the morning of March 14, when Ukrainian units struck the center of Donetsk with a Tochka-U tactical missile equipped with cluster munitions, killing dozens of civilians as well.\n\nToday, the Kiev regime continues to spread lies that the Tochka-U which hit the station in Kramatorsk was Russian, or Belorussian, or even that it was the only Russian Tochka-U brought to Ukraine by a special order to hit the train station. Kiev had to invent new stories, because the Russian military has not used Tochka-U missiles for many years.\n\nAnother mistake of the Kiev propaganda revealed the truth.\n\nfrom https://southfront.org/last-point-in-kievs-lies-about-bloody-attack-on-civilians-with-tochka-u-missile/", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2022/04/Kr-1-490x268-1.jpg?fit=490%2C268&ssl=1", "eventUri": "eng-7637285", "sentiment": -0.4196078431372549, "wgt": 196, "relevance": 1, "stanza_neg": 7, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7000915819", "lang": "eng", "isDuplicate": false, "date": "2022-04-12", "time": "12:33:00", "dateTime": "2022-04-12T12:33:00Z", "dateTimePub": "2022-04-12T12:16:00Z", "dataType": "news", "sim": 0.7254902124404907, "url": "https://www.globalresearch.ca/evidence-missile-caused-massacre-kramatorsk-not-russian-but-ukrainian/5777254", "title": "Evidence that the Missile that Caused the Massacre in Kramatorsk Is Not Russian but Ukrainian - Global Research", "body": "All Global Research articles can be read in 51 languages by activating the \"Translate Website\" drop down menu on the top banner of our home page (Desktop version).\n\nTo receive Global Research's Daily Newsletter (selected articles), click here.\n\nVisit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\n***\n\nThe serial number of the Tochka-U missile that hit the Kramatorsk railway station on 8 April 2022 is Ш91579 (in Russian) or Sh91579 (in English). This serial number marks the stock of Tochka-U missiles in the possession of the Ukrainian Army. Only the Ukrainian Armed Forces have Tochka-U missiles. Russia has not had them since 2019: they have all been deactivated. The Donetsk and Lugansk People's Republics do not have and have never had Tochka-U.\n\nThe direction of the cone and the tail section of the missile that landed on the ground near the Kramatorsk train station clearly shows that it was fired from the 19th Ukrainian Missile Brigade, deployed near Dobropolie 45 km from Kramatorsk.\n\nPreviously the Ukrainian Armed Forces have used Tochka-U missiles of the same series as Ш915611 fired at Berdyansk and Ш915516 fired at Melitopol. The same missiles were used against Donetsk and Lugansk.\n\n*\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nThis article was originally published in Italian on byoblu.\n\nManlio Dinucci, award winning author, geopolitical analyst and geographer, Pisa, Italy. He is a Research Associate of the Centre for Research on Globalization (CRG).\n\nFeatured image is from Freenations", "source": {"uri": "globalresearch.ca", "dataType": "news", "title": "Global Research"}, "authors": [], "image": "https://www.globalresearch.ca/wp-content/uploads/2022/04/image-5.png", "eventUri": "eng-7637285", "sentiment": 0.05098039215686279, "wgt": 185, "relevance": 1, "stanza_neg": 4, "stanza_neu": 18, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7000513883", "lang": "eng", "isDuplicate": false, "date": "2022-04-12", "time": "06:53:00", "dateTime": "2022-04-12T06:53:00Z", "dateTimePub": "2022-04-12T06:14:00Z", "dataType": "news", "sim": 0.7137255072593689, "url": "https://www.ukrinform.net/rubric-ato/3455256-ukraine-at-osce-exposes-russian-lies-about-tochkau-missile-attack-on-kramatorsk.html", "title": "Ukraine at OSCE exposes Russian lies about Tochka-U missile attack on Kramatorsk", "body": "Russia's Defence Ministry is lying when it claims that the Russian army does not use Tochka-U missile systems as such a missile was fired at the Russian-Belarusian bilateral military exercise in February.\n\n\"Russia's Ministry of Defence spokesperson claims that they do not use the kind of missile that hit Kramatorsk. However, even TV archives show he is a liar.\n\nTochka-U was fired in February 2022 during the Russian-Belarusian bilateral military exercise Allied Resolve 2022,\" Ambassador Yevhenii Tsymbaliuk, Permanent Representative of Ukraine to the International Organizations in Vienna, said at a special meeting of the OSCE Permanent Council dedicated to Russia's missile attack on the Kramatorsk railway station, an Ukrinform correspondent reported.\n\nUkraine's Ambassador added the use of these missiles by the Russian military had been already recorded earlier near the city of Sumy.\n\nAs Tsymbaliuk noted, if Russian diplomats at OSCE, who say that Russia does not use Tochka-U missile systems, are fooled by their military and the president, the Ukrainian delegation can share relevant evidence and objective information with them.\n\nThe Permanent Representative of Ukraine to the International Organizations in Vienna stressed that Russia had deliberately launched a missile strike on the Kramatorsk railway station.\n\n\"Russians knew very well that the train station in Kramatorsk was full of civilians waiting to be evacuated. This evacuation has been announced in advance since Russia has been concentrating its forces for a new bloody attack in the region. Yet they stroke the station with a ballistic missile. This was a deliberate slaughter,\" Tsymbaliuk said.\n\nHe added that all those involved in this war crime would be brought to justice.\n\nOn April 8, Russian troops launched a missile strike on the Kramatorsk railway station from which the population is evacuated daily.\n\nAccording to the latest reports, 59 civilians were killed and 109 more were injured.\n\nPresident Volodymyr Zelensky stated that the missile had been fired from Tochka-U system.\n\nRussian propaganda traditionally denied the involvement of the Russian Federation in the missile strike, and the Russian Defence Ministry said that the Russian army allegedly did not use the Tochka-U systems.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_04/thumb_files/630_360_1649744182-261.jpg", "eventUri": "eng-7637285", "sentiment": -0.1215686274509804, "wgt": 182, "relevance": 1, "stanza_neg": 6, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "6998068021", "lang": "eng", "isDuplicate": false, "date": "2022-04-10", "time": "04:06:00", "dateTime": "2022-04-10T04:06:00Z", "dateTimePub": "2022-04-10T03:47:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://therussophile.org/the-russians-commit-yet-another-atrocity-by-the-saker.html/", "title": "\"The Russians\" commit yet another \"atrocity\", by The Saker - Russia News Now", "body": "Never let facts get in the way of propaganda, especially when that's what people want to believe. From The Saker at thesaker.is:\n\nThe big news today is that those evil Russkies have fired a Tochka-U missile with a cluster warhead at the city of Kramatorsk, killing scores of innocent civilians. The \"entire civilized world\" is disgusted and immediately announced even MORE sanctions, MORE condemnation and MORE anti-Russian virtue signalling.\n\nMinor problem: Russia does not have Tochka-U missiles, which are 30 year old Soviet missiles which have been far surpassed by modern Russian missiles (of which Russia has plenty enough). How do we know that it was Tochka-U which was used?\n\nBecause of the tail section which separates from the warhеard during the flight. Here it is:\n\nNo Russian tactical missile in service with such a tail section, and only the Ukrainian Tochka-U have.", "source": {"uri": "therussophile.org", "dataType": "news", "title": "TheRussophiles"}, "authors": [], "image": "https://i0.wp.com/therussophile.org/wp-content/uploads/2018/08/Straight-Line-Logic.jpg?fit=984%2C507&ssl=1", "eventUri": "eng-7637285", "sentiment": -0.3568627450980392, "wgt": 177, "relevance": 1, "stanza_neg": 2, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7002759304", "lang": "eng", "isDuplicate": false, "date": "2022-04-13", "time": "18:14:00", "dateTime": "2022-04-13T18:14:00Z", "dateTimePub": "2022-04-13T18:12:00Z", "dataType": "news", "sim": 0.5843137502670288, "url": "https://www.thejakartapost.com/paper/2022/04/13/ukraine-the-western-led-massacre-of-truth.html", "title": "Ukraine: The Western-led massacre of truth ", "body": "It is unfortunate that The Jakarta Post, in its editorial on April 11, 2022, is following the latest Western trend when no evidence is needed to identify those responsible for crimes against civilians. Today, the West's \"highly likely\" is enough.\n\nIt may seem that the Post has already conducted an investigation into the tragedy in Kramatorsk in stating that it was \"last week's Russian missile strike\". But still, I wish to give readers a chance to reach their own conclusions.\n\nFirst, Tochka-U tactical missiles, the wreckage of which was found near Kramatorsk railway station, are used only by the Ukrainian armed forces. The Russian army doesn't possess them.", "source": {"uri": "thejakartapost.com", "dataType": "news", "title": "The Jakarta Post"}, "authors": [], "image": "https://img.jakpost.net/c/2022/04/13/2022_04_13_124667_1649865863._large.jpg", "eventUri": "eng-7637285", "sentiment": -0.08235294117647063, "wgt": 149, "relevance": 1, "stanza_neg": 1, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7000523067", "lang": "eng", "isDuplicate": false, "date": "2022-04-12", "time": "07:02:00", "dateTime": "2022-04-12T07:02:00Z", "dateTimePub": "2022-04-12T07:02:00Z", "dataType": "news", "sim": 0.5411764979362488, "url": "https://www.ukrinform.net/rubric-ato/3455274-us-at-osce-russia-will-be-held-accountable-for-kramatorsk-bucha-mariupol-kharkiv.html", "title": "US at OSCE: Russia will be held accountable for Kramatorsk, Bucha, Mariupol, Kharkiv ", "body": "The United States will make every effort to hold Russia accountable for all its war crimes committed in Ukraine.\n\n\"Let there be no doubt that Russia will be held accountable for the Kramatorsk missile strike, the civilian deaths in Bucha, and the continuing destruction of Mariupol and Kharkiv. We have already said that we assess that members of Russian armed forces have committed war crimes in Ukraine. The United States is committed to pursuing accountability for those responsible for such crimes,\" Ambassador Michael Carpenter, U.S. Permanent Representative to OSCE, said at a special meeting of the OSCE Permanent Council dedicated to Russia's missile attack on the Kramatorsk railway station.\n\nAccording to the diplomat, the United States assesses that Russians fired a short-range ballistic missile on the Kramatorsk railway station.\n\nAs noted, in addition to providing Ukraine with the largest amount of security assistance of any country in the world, the United States is also supporting a range of accountability mechanisms in Ukraine, including investigations by Ukraine's national authorities, international investigative mechanisms, and the important work of human rights documenters.\n\n\"Right now, at the request of the Prosecutor General of Ukraine, the United States is supporting a multi-national team of international prosecutors and other war crimes experts deployed to the region. This interdisciplinary team, which includes American experts, is directly supporting the efforts of Ukraine's Prosecutor General's War Crimes Units to collect, preserve, and analyze evidence of atrocities with a view toward pursuing criminal accountability processes,\" Carpenter said.\n\nHe also mentioned the Moscow Mechanism invoked at the OSCE by 45 participating States to investigate possible war crimes and violations of international humanitarian and human rights law resulting from Russia's war against Ukraine.\n\n\"We are committed to using every tool available to ensure those responsible are held accountable for atrocities,\" the U.S. Permanent Representative to OSCE stressed.\n\nOn April 8, Russian troops launched a missile strike on the Kramatorsk railway station from which the population is evacuated daily.\n\nAccording to the latest reports, 59 civilians were killed and 109 more were injured.\n\nPresident Volodymyr Zelensky stated that the missile had been fired from Tochka-U system.\n\nRussian propaganda traditionally denied the involvement of the Russian Federation in the missile strike, and the Russian Defence Ministry said that the Russian army allegedly did not use the Tochka-U systems.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2017_12/thumb_files/630_360_1512595866-1299.jpg", "eventUri": "eng-7637285", "sentiment": 0.1294117647058823, "wgt": 138, "relevance": 1, "stanza_neg": 3, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]