[{"uri": "7032980783", "lang": "eng", "isDuplicate": false, "date": "2022-05-08", "time": "16:24:00", "dateTime": "2022-05-08T16:24:00Z", "dateTimePub": "2022-05-08T16:24:00Z", "dataType": "news", "sim": 0.7843137383460999, "url": "https://news.yahoo.com/mariupol-defenders-tell-commander-marines-120905296.html", "title": "Mariupol defenders tell how the commander of marines fled the city", "body": "Illia Samoilenko, an intelligence officer, said that the commander of the 36th Brigade of Ukrainian Marines, Volodymyr Baraniuk, decided to flee the encircled city of Mariupol, taking with him people, tanks and ammunition.\n\nSource: Samoilenko during a briefing from Azovstal\n\nSamoilenko's Quote: One could run away like a coward, think only of one's own life, but not think about one's own duty, the oath that one took upon oneself. This is exactly what happened to the commander of the Marines of the 36th Brigade. He simply refused to carry out the order that was issued to him.\n\nAnd he tried to flee the city with a small group of working tanks, armoured combat vehicles, [and] ammunition...\n\n... here (from Mariupol - ed.) it is impossible to break through, but if you think only about your own life, you will grab every opportunity to prolong this life.\n\nIt's a big shame.\"\n\nDetails: Samoilenko noted that the Azov Regiment is now more than 100 kilometres from the original positions.\n\nDenys Prokopenko, commander of the Azov regiment, also spoke about this in an interview with Ukrayinska Pravda.\n\nProkopenko's Quote: \"Then, unexpectedly, [Volodymyr Baraniuk], the commander of the 36th Brigade decided, without warning anyone, to simply make a breakthrough in an unknown direction and thereby lost many people. Also, many people were left to their fate, and they were simply captured.\n\nIf this had not happened, with this brigade we would have been able to keep the defence on the right bank for a long time, but the flank was exposed, and after the completion of the clearing of the Ilyich plant, the enemy threw all their forces in our direction - this allowed them to attack us from the flank and rear.\"\n\nReminder: Russian media (RosSMI) has already shown Baraniuk in captivity.", "source": {"uri": "news.yahoo.com", "dataType": "news", "title": "Yahoo News"}, "authors": [], "image": "https://s.yimg.com/uu/api/res/1.2/ReZ8uSUeodkI11OFrQQ.ow--~B/aD0zODc7dz02OTA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ukrayinska_pravda_articles_451/b5858d688f7370f8a46d4157206fca93", "eventUri": "eng-7697627", "sentiment": 0.05882352941176472, "wgt": 200, "relevance": 1, "stanza_neg": 5, "stanza_neu": 9, "stanza_pos": 1, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7033263004", "lang": "eng", "isDuplicate": false, "date": "2022-05-09", "time": "00:10:00", "dateTime": "2022-05-09T00:10:00Z", "dateTimePub": "2022-05-09T00:04:00Z", "dataType": "news", "sim": 0.7411764860153198, "url": "https://www.pehalnews.in/mariupol-defenders-tell-how-the-commander-of-marines-fled-the-city/1934534/", "title": "Mariupol defenders tell how the commander of marines fled the city", "body": "Illia Samoilenko, an intelligence officer, mentioned that the commander of the thirty sixth Brigade of Ukrainian Marines, Volodymyr Baraniuk, determined to flee the encircled city of Mariupol, taking with him individuals, tanks and ammunition.\n\nSource: Samoilenko throughout a briefing from Azovstal\n\nSamoilenko's Quote: One might run away like a coward, assume solely of one's personal life, however not take into consideration one's personal responsibility, the oath that one took upon oneself. This is precisely what occurred to the commander of the Marines of the thirty sixth Brigade. He merely refused to hold out the order that was issued to him.\n\nAnd he tried to flee the city with a small group of working tanks, armoured fight automobiles, [and] ammunition...\n\n... right here (from Mariupol - ed.) it's inconceivable to interrupt by means of, however in case you assume solely about your personal life, you'll seize each alternative to lengthen this life.\n\nIt's an enormous disgrace.\"\n\nDetails: Samoilenko noted that the Azov Regiment is now more than 100 kilometres from the original positions.\n\nDenys Prokopenko, commander of the Azov regiment, also spoke about this in an interview with Ukrayinska Pravda.\n\nProkopenko's Quote: \"Then, unexpectedly, [Volodymyr Baraniuk], the commander of the thirty sixth Brigade determined, with out warning anybody, to easily make a breakthrough in an unknown path and thereby misplaced many individuals. Also, many individuals have been left to their destiny, they usually have been merely captured.\n\nIf this had not occurred, with this brigade we'd have been in a position to maintain the defence on the proper financial institution for a very long time, however the flank was uncovered, and after the completion of the clearing of the Ilyich plant, the enemy threw all their forces in our path - this allowed them to assault us from the flank and rear.\"\n\nReminder: Russian media (RosSMI) has already proven Baraniuk in captivity.", "source": {"uri": "pehalnews.in", "dataType": "news", "title": "Pehal News"}, "authors": [], "image": null, "eventUri": "eng-7697627", "sentiment": 0.01960784313725483, "wgt": 189, "relevance": 1, "stanza_neg": 6, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036049123", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "02:09:00", "dateTime": "2022-05-11T02:09:00Z", "dateTimePub": "2022-05-11T01:56:00Z", "dataType": "news", "sim": 0.7098039388656616, "url": "https://www.pehalnews.in/harrowing-photos-offer-rare-glimpse-of-wounded-soldiers-in-besieged-mariupol-steel-plant/1941810/", "title": "Harrowing photos offer rare glimpse of wounded soldiers in besieged Mariupol steel plant", "body": "Warning: The following comprises graphic photos.\n\nPhotos of badly wounded Ukrainian soldiers trapped in a steel plant in Mariupol give a rare take a look at the circumstances of these combating Russia's ongoing makes an attempt to take management of town.\n\nLt. Ilya Samoilenko, a 27-year-old workers officer for the elite Ukrainian Azov Regiment, has been trapped in the Azovstal steel plant in besieged Mariupol for greater than 70 days.\n\nSamoilenko shared photos with TODAY Parents to place a highlight on his injured comrades and the medical doctors making an attempt to maintain them alive contained in the steel plant's basement.\n\n\"I'm OK, relatively,\" Samoilenko informed TODAY Parents through the Telegram messaging app. \"Hungry, but not starving. Water is not enough. Health ... well, I did not lose any more limbs than before.\"\n\nSamoilenko stated he misplaced his left arm and proper eye 4 years in the past. \"It's a long story, from a previous life,\" he defined. He stated he additionally has some shrapnel in his leg.\n\n\"I'm still in a fight,\" he added. \"And there are hundreds of guys like me. We're standing tall on missing legs. We hold weapons in lost arms. We are in a fight, and we are going to fight until the end.\"\n\nWith restricted entry to meals, water, remedy and gear, medical doctors have been treating severed limbs, head wounds, severe lacerations, gunshot wounds and broken bones contained in the steel plant. Samoilenko described the doctors as \"living heroes\" and \"legends.\"\n\n\"Ninety percent of our servicemen are wounded,\" Samoilenko stated. \"A lot of people recovered from lighter injuries, and they are back in the fight. Through pain, through struggle, well, you know, you have no choice. When you must fight, you're rising up -- with pain, with physical damage, but you are fighting.\"\n\nRelated: Hope and defiance: A Ukrainian soldier shares what life is like inside Mariupol steel plant\n\nOver the weekend, all of the women, children and elderly Ukrainian civilians believed to be trapped in the Azovstal steel plant with the soldiers were safely evacuated.\n\nThere are not less than 2,000 Ukrainian soldiers still fighting in the port city of Mariupol.\n\nUkrainian President Volodymyr Zelenskyy said Russia's attacks in the east of Ukraine have increased. At least 60 people were feared dead after a Russian airstrike on a school in eastern Ukraine on Saturday afternoon.\n\nRelated: Jill Biden visits Ukraine border as Russia doubles down on attacks\n\nRussian forces also have increased their attacks on Odesa, another key port city located on the Black Sea in southern Ukraine. On Monday, Russian missiles hit a shopping center and a warehouse, killing one person and injuring five more.\n\nZelenskyy also has described the scenario in Mariupol as \"extremely severe.\"\n\nThe soldiers of the Azov Regiment demanded the \"immediate evacuation of wounded servicemen in Ukrainian-controlled territories\" in order that they could possibly be \"assisted and provided with proper care.\"\n\n\"The servicemen you see in the photos and hundreds more at the Azovstal plant defended Ukraine and the entire civilized world, with serious injuries at the cost of their own health,\" stated a Telegram put up made by a member of the Azov Regiment.\n\n\"Are Ukraine and the world community now unable to protect and take care of them?\"", "source": {"uri": "pehalnews.in", "dataType": "news", "title": "Pehal News"}, "authors": [], "image": "https://s.yimg.com/ny/api/res/1.2/b0ioUHCtzPZQU3tpp0sF0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ3MA--/https://s.yimg.com/uu/api/res/1.2/uMSuxZzOp0u1nT.UGxESjQ--~B/aD0xNjY2O3c9MjUwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/nbc_today_217/f80498433f6998f8f544bd6d27f18470", "eventUri": "eng-7697627", "sentiment": 0.06666666666666665, "wgt": 181, "relevance": 1, "stanza_neg": 8, "stanza_neu": 25, "stanza_pos": 2, "swn_neg": 35, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7032878835", "lang": "eng", "isDuplicate": false, "date": "2022-05-08", "time": "14:15:00", "dateTime": "2022-05-08T14:15:00Z", "dateTimePub": "2022-05-08T14:14:00Z", "dataType": "news", "sim": 0.6784313917160034, "url": "https://en.hromadske.ua/posts/defenders-of-mariupol-give-a-press-conference-at-besieged-azovstal-highlights", "title": "Defenders of Mariupol hold an online press conference at besieged Azovstal: highlights", "body": "Deputy Commander of Azov Regiment Sviatoslav Palamar (call sign Kalyna) and Illia Samoilenko, Officer of the Intelligence Department of the Azov Regiment, hold an online press conference at the Azovstal plant in Mariupol, which Ukrainian service members continue to defend.\n\nSituation at Azovstal now\n\nSviatoslav Palamar: Intense shellings continue. In just one night, we counted 25 attacks, including 3 from strategic bombers. Tanks, mortars, and snipers are working; infantry is trying to storm.\n\nOver three past days, civilians were evacuated. Was everyone evacuated? We can't say because we don't have special equipment to clean the rubbles.\n\nThere are many civilian and military casualties on the territory of the plant. Two days ago, three of our service members were killed: one died when an anti-tank missile system hit a car that was supposed to evacuate civilians, and two others died while dropping bombs from a drone. Six other service members were injured. This is the price of evacuating civilians from the factory.\n\nHere we are standing up not for words, we are defending the people of Ukraine. We are performing our military duty, we do not need praise. We will fight as long as we live, for justice, for the evacuation of civilians and wounded soldiers.\n\nNumber of civilians and service members at the plant\n\nIllia Samoilenko: [As for service members, ed.] this is a very sensitive question. I can't endanger my unit.\n\nBlockade of Mariupol\n\nIllia Samoilenko: The siege of Mariupol has been going on for the last 2.5 months. It lasted so long, that never happened before in history, with so many casualties among enemy personnel and significant losses among the civilian population. What breaks my heart the most is the evacuation of small groups. Politicians note small victories like the evacuation of dozens and hundreds of people, but at the same time, the Russian army killed more than 25,000 people.\n\nOn heroism\n\nIllia Samoilenko: The truth is that we are unique. Nobody expected us to withstand for so long. Many people say that we are heroes. Many call us heroes. We do our job.\n\nHeroism comes when planning and organization fail. Many people believe that we are living heroes. When the city's siege began, we decided to stand here under any conditions and defend it.\n\nWe had an order to defend Mariupol. But we did not have an order to take full command of the defense of Mariupol, but this decision was made because no one else was able to do it. Nobody expected us to withstand that long. I did not expect either. We thought that Russia would overcome everyone, but the Armed Forces of Ukraine resisted.\n\nEnemy losses\n\nIllia Samoilenko: Ukrainian fighters from Azov Regiment killed 2,500 Russian service members in Mariupol and injured 5,000, which is more than 15% of the military losses of their army [in the battle of Mariupol, ed.].\n\nWe also destroyed more than 60 tanks and damaged another 30, which is 10% of their losses. We also destroyed 10% of the enemy artillery systems.\n\nThere were days when more than 150 air bombs were dropped on Mariupol. And we got zero support: no air support, no ground support, no artillery support. We were abandoned to the mercy of fate.\n\nCivilians at Azovstal\n\nIllia Samoilenko: There were several thousand civilians inside the plant. People fled the city and found shelter at the plant. Civilians are a limiting factor for the military. If there were no civilians, the city would be just a battlefield. But we defended them because it is our duty. We placed them in bunkers away from our positions. We provided them with medical care, food, and water and shared all our resources.\n\nAccusations of using civilians as a 'human shield'\n\nIllia Samoilenko: All these accusations are normal if you think like a Russian soldier. But if you look from the point of view of a civilian who witnessed all the horrors the Russian army did, you will understand they found refuge here behind our line of defense, inside the Azovstal plant. Many people stayed in Mariupol while we kept the line of defense outside the city.\n\nChances for surviving in Mariupol\n\nThe first option: you can put down your weapons and wait for the end. It will be a slow death from starvation or a fast one from bombs.\n\nThe second option: you can try to escape like a coward. Think only of your own life, not of duty and oath. This is exactly what happened to the commander of the 36th Separate Marine Brigade [Colonel Volodymyr Baranyuk is now held captive by Russian occupiers, ed.]: he refused to obey the order, and he tried to escape from the city with a small group of tanks and armored vehicles. This option could lead to death -- one person [from the brigade, ed.] died.\n\nThe third option: you can surrender. The fourth option: the only way you will not be ashamed of and which guarantees your life is to withstand and fight.\n\nOption to surrender\n\nIllia Samoilenko: All this time, we knew that the Azov Regiment had no high chance of survival if Russian troops took us prisoners; surrendering is unacceptable for us. We cannot make such a gift to the enemy. Everyone who is a prisoner is a resource of political and military pressure to increase the level of negotiations and positions that we can leave on the political scene.\n\nOne of our soldiers was captured during the battle on the twentieth of April. He was unconscious. Russian propaganda then published a video of Ukrainian soldiers surrendering their weapons, and his mother was later informed of his death.\n\nWe have several captured Russian soldiers. We exchanged them later.\n\nEvacuation of service members\n\nIllia Samoilenko: The only option for us is evacuation because we have already spent all our resources that allowed an effective defense. We still have provisions, water and weapons, including artillery, but we can't use it because we are close to the city. But all our resources are limited, they haven't been renewed. We will fight until a better solution to the situation is discovered.\n\nEvacuation of wounded service members and medics\n\nEarlier, Zelensky announced preparations for the evacuation of wounded service members and medics.\n\nIllia Samoilenko: If politicians can guarantee their security, that's good. Medics are exhausted. They are heroes, they did impossible things. If medics are evacuated from the plant, the military will be restricted in receiving medical care.\n\nCommunication with the command and families\n\nIllia Samoilenko: We have a connection with the command and an order to keep the defense.\n\nMost of us have connections with our families. We admire their support and love them very much, they show their love to us. We will meet with our families, wives, and friends one day and celebrate the victory, but we still have to fight for our victory.\n\nWho can help Mariupol\n\nIllia Samoilenko: Many petitions and statements calling for our salvation emerged due to wide international publicity. Many people want to help, but they don't know how. Any country could intervene, except Russia and those that support Russia. Any country that has enough courage to intervene and stop Russia would be good for us.\n\nAbout fear\n\nIllia Samoilenko: We have no fear. It vanished. Every day, every minute can be the last, so there is no fear. It isn't so difficult to live without fear.\n\nAbout the wounded people\n\nIllia Samoilenko: We have several hundred wounded people. We have many wounded people whom we cannot leave here, they deserve proper support and treatment. We won't leave anyone. We are providing the necessary assistance, but we have many wounded service members who need to be evacuated.\n\nLatest updates on the situation at Azovstal\n\nRussian troops broke into Azovstal in besieged Mariupol on May 4, despite Russia's claims that it had been decided to lay siege to the plant instead of storming it. Heavy fighting continues between Ukrainian forces and Russian invaders.\n\nAt that time, Ukraine and Russia, with the support of the United Nations, agreed to evacuate civilians hiding in the plant's bomb shelters. The evacuation began on May 1. On May 7, Ukrainian authorities announced that all women, children, and the elderly had been evacuated from Azovstal.\n\nPresident Zelensky announced preparations for the next step -- evacuating the wounded and medics from Azovstal. On April 27, Acting Commander of the 36th Separate Marine Brigade Serhiy Volynskyi said that more than 600 wounded servicemen were at the plant.\n\nDefenders of Mariupol have repeatedly appealed to the Ukrainian authorities and the world community, emphasizing that the fighters have problems with supplies of food, water, medicine, and ammunition.\n\nActivists and many non-governmental organizations created a petition to the United Nations and world leaders to rescue Ukrainian soldiers and civilians from the Azovstal plant using the extraction procedure.", "source": {"uri": "en.hromadske.ua", "dataType": "news", "title": "en.hromadske.ua"}, "authors": [], "image": "https://s3-eu-central-1.amazonaws.com/hromadske-en/posts/image_socials/000/003/667/original/data?1652018878", "eventUri": "eng-7697627", "sentiment": -0.1058823529411764, "wgt": 173, "relevance": 1, "stanza_neg": 27, "stanza_neu": 93, "stanza_pos": 6, "swn_neg": 126, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7032940650", "lang": "eng", "isDuplicate": false, "date": "2022-05-08", "time": "15:34:00", "dateTime": "2022-05-08T15:34:00Z", "dateTimePub": "2022-05-08T15:04:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://www.theguardian.com/world/2022/may/08/surrender-is-not-an-option-azov-battalion-commander-in-plea-for-help-to-escape-mariupol", "title": "'Surrender is not an option': Azov battalion commander in plea for help to escape Mariupol", "body": "Two thousand Ukrainian troops thought to be trapped inside steelworks after civilian evacuation\n\nMembers of Ukraine's Azov battalion trapped inside Mariupol's Azovstal steel plant have said they fear they will be executed if captured by Russian forces, as they pleaded with Ukrainian authorities to help arrange their extraction.\n\nSpeaking to the media from inside the besieged steelworks, an Azov commander and lieutenant, looking gaunt and pale, said they had defended the city for the people of Ukraine and the rest of the world and needed a third party to negotiate their exit whether by land or sea.\n\nThere are believed to be 2,000 soldiers in the plant, 700 of whom are said to be injured.\n\nLieut Illya Samoilenko vowed to fight on, saying his comrades understood they would be executed if captured and that surrender would be a \"gift\" to the enemy.\n\n\"We are witnesses of Russian crimes,\" Samoilenko said. \"Surrender is not an option because Russia is not interested in our lives.\"\n\nAll the civilians who were inside the plant have been evacuated, according to Azov's commander, Denys Prokopenko.\n\n\"We need the proper opportunity to be evacuated,\" Svyatoslav Palamar, the deputy commander of the Azov regiment. \"Another thing that hurts is that the politicians said you continue (fighting) while we evacuate the civilians. But we (are) here defending the people.\"\n\nThey criticised the Ukrainian government for celebrating the evacuation of several dozen civilians over the past few weeks, while failing to prepare Ukraine over the past eight years for what they say was an inevitable war with Russia.\n\n\"The government let this happen to 25,000 people,\" said Samoilenko, speaking of the number of civilians in Mariupol that he estimates have died.\n\nAzov forces say they are more than 100km from the nearest Ukrainian forces and cannot make it to safety without help from Ukraine's authorities.\n\nThe Azov battalion has been central to Russia's justification for invading Ukraine. Russia claims its members are neo-Nazis who are responsible for \"Nazifying\" Ukraine.\n\nAzov fighters say its membership holds a range of political opinions. Azov formed as a volunteer battalion in 2014 to fight Russian-backed forces and some its leaders are known to hold far-right views. But since 2015, it has been part of the Ukrainian army and no longer attracts only far-right combatants.\n\nRussian propaganda has long exaggerated the domestic influence of Azov in Ukraine as well as the scale of its membership.\n\nRussia's full-scale invasion of Ukraine has worked to transform the image of the fighters in the eyes internationally and in Ukraine. Many now view them as heroes.\n\nSamoilenko said they felt supported by words but asked for aerial attacks on Russian positions and berated the Ukrainian authorities for not defending Ukraine's southern regions.\n\n\"We are doing our job and we are doing our job well. Some of the politicians are not doing their job well,\" said Samoilenko, who also said Azov had killed 2,500 Russian soldiers from 24 February to 25 April.\n\nSamoilenko said the weak reaction of the world to Russian aggression in 2014 is one of the reasons why this invasion had happened. He said western countries should have understood that the price of prosperity in Europe had been 15,000 Ukrainian lives in the last eight years, referring to the 2014-22 war.\n\nHe said the west had refused to help the battalion over the last eight years. Some of those who led Azov in its inception as a volunteer battalion in 2014 were of far-right leanings. The battalion was incorporated into Ukraine's army in 2015 and its members are now politically pluralistic.\n\n\"We showed that anything is possible,\" said Samoilenko. \"Please do your job and so we can teach people how to do impossible things.\"\n\nSamoilenko also criticised the Ukrainian government for negotiating with Russia, describing them as \"barbarians\". He said Azov's goal was to eliminate the enemy threat by pacifying Russia and that they were not only fighting for Ukraine but the whole of the free world.\n\nSamoilenko declined to say how many soldiers were left in the plant or talk about their supplies, saying that this was classified operational information. The fighters say morale is still high, despite coming under almost constant shelling.\n\n\"We're grateful for the support from the world and this might help,\" said Samoilenko \"People have seen who we are.\"", "source": {"uri": "theguardian.com", "dataType": "news", "title": "The Guardian"}, "authors": [{"uri": "isobel_koshiw@theguardian.com", "name": "Isobel Koshiw", "type": "author", "isAgency": false}], "image": "https://i.guim.co.uk/img/media/662ea679c644aee27696f28ab1fd877a3eb1c6ff/0_277_4256_2554/master/4256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=feb9547d223f1d87297cd1b40f5dd339", "eventUri": "eng-7697627", "sentiment": -0.192156862745098, "wgt": 165, "relevance": 1, "stanza_neg": 10, "stanza_neu": 25, "stanza_pos": 2, "swn_neg": 37, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7035940191", "lang": "eng", "isDuplicate": false, "date": "2022-05-10", "time": "23:06:00", "dateTime": "2022-05-10T23:06:00Z", "dateTimePub": "2022-05-10T22:08:00Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://www.today.com/parents/parents/photos-wounded-ukrainian-soldiers-mariupol-steel-plant-rcna28137", "title": "Harrowing photos offer rare glimpse of wounded soldiers in besieged Mariupol steel plant", "body": "Photos of badly wounded Ukrainian soldiers trapped in a steel plant in Mariupol give a rare look at the conditions of those fighting Russia's ongoing attempts to take control of the city.\n\nLt. Ilya Samoilenko, a 27-year-old staff officer for the elite Ukrainian Azov Regiment, has been trapped in the Azovstal steel plant in besieged Mariupol for more than 70 days.\n\nSamoilenko shared photos with TODAY Parents to put a spotlight on his injured comrades and the doctors trying to keep them alive inside the steel plant's basement.\n\n\"I'm OK, relatively,\" Samoilenko told TODAY Parents via the Telegram messaging app. \"Hungry, but not starving. Water is not enough. Health ... well, I did not lose any more limbs than before.\"\n\nSamoilenko said he lost his left arm and right eye four years ago. \"It's a long story, from a previous life,\" he explained. He said he also has some shrapnel in his leg.\n\n\"I'm still in a fight,\" he added. \"And there are hundreds of guys like me. We're standing tall on missing legs. We hold weapons in lost arms. We are in a fight, and we are going to fight until the end.\"\n\nWith limited access to food, water, medication and equipment, doctors have been treating severed limbs, head wounds, severe lacerations, gunshot wounds and broken bones inside the steel plant. Samoilenko described the doctors as \"living heroes\" and \"legends.\"\n\n\"Ninety percent of our servicemen are wounded,\" Samoilenko said. \"A lot of people recovered from lighter injuries, and they are back in the fight. Through pain, through struggle, well, you know, you have no choice. When you must fight, you're rising up -- with pain, with physical damage, but you are fighting.\"\n\nRelated: Hope and defiance: A Ukrainian soldier shares what life is like inside Mariupol steel plant\n\nOver the weekend, all the women, children and elderly Ukrainian civilians believed to be trapped in the Azovstal steel plant with the soldiers were safely evacuated.\n\nThere are at least 2,000 Ukrainian soldiers still fighting in the port city of Mariupol.\n\nUkrainian President Volodymyr Zelenskyy said Russia's attacks in the east of Ukraine have increased. At least 60 people were feared dead after a Russian airstrike on a school in eastern Ukraine on Saturday afternoon.\n\nRelated: Jill Biden visits Ukraine border as Russia doubles down on attacks\n\nRussian forces also have increased their attacks on Odesa, another key port city located on the Black Sea in southern Ukraine. On Monday, Russian missiles hit a shopping center and a warehouse, killing one person and injuring five more.\n\nZelenskyy also has described the situation in Mariupol as \"extremely severe.\"\n\nThe soldiers of the Azov Regiment demanded the \"immediate evacuation of wounded servicemen in Ukrainian-controlled territories\" so they could be \"assisted and provided with proper care.\"\n\n\"The servicemen you see in the photos and hundreds more at the Azovstal plant defended Ukraine and the entire civilized world, with serious injuries at the cost of their own health,\" said a Telegram post made by a member of the Azov Regiment.\n\n\"Are Ukraine and the world community now unable to protect and take care of them?\"", "source": {"uri": "today.com", "dataType": "news", "title": "TODAY.com"}, "authors": [], "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x512_center,f_auto,q_auto:best/rockcms/2022-05/ukranian-soldiers-mariupol-mc-2200510-07-f0f191.jpg", "eventUri": "eng-7697627", "sentiment": 0.003921568627450966, "wgt": 164, "relevance": 1, "stanza_neg": 8, "stanza_neu": 23, "stanza_pos": 2, "swn_neg": 33, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7033216610", "lang": "eng", "isDuplicate": false, "date": "2022-05-08", "time": "22:34:00", "dateTime": "2022-05-08T22:34:00Z", "dateTimePub": "2022-05-08T22:33:00Z", "dataType": "news", "sim": 0.6313725709915161, "url": "https://news.yahoo.com/azov-regiment-believes-russian-troops-185949791.html", "title": "Azov Regiment believes Russian troops should have been stopped on Crimeas border", "body": "Denys Prokopenko, Commander of the Azov Regiment, believes that Ukrainian forces should have more actively attempted to stop Russian troops as they advanced from the Russian-occupied Crimea near Henichesk [a port city on the Sea of Azov in the Kherson Oblast]. According to Prokopenko, this would have changed the trajectory of the fight for Mariupol.\n\nSource: Denys Prokopenko, interview with Ukrainska Pravda\n\nQuote from Prokopenko: \"If the forces located there [at the Crimea-Ukraine border] held the defence firmer, did everything they could to resist the enemy's advance, didn't just let the enemy troops enter the [Ukrainian] cities, everything would have been different now.\n\nThe thing is, the enemy should have been destroyed at the neck of land connecting Crimea with the rest of Ukraine, near Henichesk. The enemy's manoeuvring capacity would have been limited there and would only have had one way to advance. Given the terrain, the enemy would have been bottlenecked.\n\nFrom the tactical point of view, that was the location that would have been the most conducive to inflicting damage on the enemy troops, in order to hinder their advance and destroy them. The enemy troops should have been destroyed there, during their advance from Crimea. And for some reason, this just wasn't done.\"\n\nDetails: Prokopenko believes that the siege of Mariupol could have been avoided.\n\nQuote from Prokopenko: \"If Henichesk, Melitopol, and Berdiansk, and other cities [on the Russians' route from Crimea to Mariupol] held their defence and fought the enemy as steadfastly [as Mariupol's defenders], it would have taken the enemy much longer than 4 days to get from Crimea to Mariupol.\n\nSince this is not how it happened, we found ourselves surrounded. Because in reality the enemy covered quite a substantial distance without meeting much resistance. Russian troops marched from Crimea without any significant fights on their way and found themselves on the western outskirts of Mariupol.\"\n\nMore details: The Azov Regiment Commander also said that the actions of the 36th Marine Brigade \"are difficult to make sense of.\"\n\n\"First, 1 battalion surrendered, as early as 4 April. As a result, we lost the only connection we had between Azov and the 36th Brigade. Then unexpectedly the commander of the 36th Brigade decided, without warning anyone, to just break through in a direction that wasn't agreed ahead of time, and that's how he lost lots of his people. Likewise, many people were just left to their own devices and ended up as Russian prisoners...These uncoordinated actions suddenly undertaken by the 36th Brigade had catastrophic consequences, which we can no longer reverse,\" Prokopenko noted.\n\nProkopenko added that nearly 1,000 Marines ended up as Russian prisoners of war.\n\nEarlier: On 8 May, Illia Samoilenko, an intelligence officer, said that Volodymyr Baraniuk, commander of the 36th Marine Brigade, decided to flee the besieged Mariupol with his personnel, tanks, and ammunition.", "source": {"uri": "news.yahoo.com", "dataType": "news", "title": "Yahoo News"}, "authors": [], "image": "https://s.yimg.com/uu/api/res/1.2/5Pvb4fa1r9iJi3JDx2CqHA--~B/aD0zODc7dz02OTA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ukrayinska_pravda_articles_451/f0be41c998ab2a200742b05cd07d4123", "eventUri": "eng-7697627", "sentiment": -0.403921568627451, "wgt": 161, "relevance": 1, "stanza_neg": 6, "stanza_neu": 17, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7032925243", "lang": "eng", "isDuplicate": false, "date": "2022-05-08", "time": "15:14:00", "dateTime": "2022-05-08T15:14:00Z", "dateTimePub": "2022-05-08T15:14:00Z", "dataType": "news", "sim": 0.6235294342041016, "url": "https://censor.net/en/news/3339941/regiment_azov_destroyed_in_mariupol_25_thousand_russian_occupiers_officer_of_management_of_intelligence", "title": "Regiment \"Azov\" destroyed in Mariupol 2,5 thousand Russian occupiers, - officer of management of intelligence Samoilenko", "body": "Fighters of the Azov Regiment killed 2,500 Russian occupiers in Mariupol and wounded another 5,000, as well as destroyed about 60 tanks of the enemy's army.\n\nIlya Samoilenko, an officer of the intelligence department and a fighter of the Azov Regiment, stated this at a press conference, Censor.NET reports.\n\nAccording to my own estimates and the estimates of the units, we killed almost 2,500 personnel (of the Russian army) and wounded more than 5,000. This is 15% of the total losses of the enemy throughout the country. We also destroyed about 60 tanks and damaged 30. This is more than 10% of the total losses of tanks in Russia. Almost the same situation with infantry fighting vehicles, artillery - more than 10%. And these losses were inflicted on the enemy by only one unit - here in Mariupol,\" said Samoilenko.\n\nAt the same time, he noted that up to 150 sorties of enemy aircraft and air strikes fell on Mariupol. According to him, this is more than half of the total number of those inflicted on Ukraine.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/6/5/a/2/65a20dc99d682474e36bdb8490bc4c5e/censor_social.jpg", "eventUri": "eng-7697627", "sentiment": -0.4509803921568627, "wgt": 159, "relevance": 1, "stanza_neg": 5, "stanza_neu": 5, "stanza_pos": 1, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7033988579", "lang": "eng", "isDuplicate": false, "date": "2022-05-09", "time": "13:30:00", "dateTime": "2022-05-09T13:30:00Z", "dateTimePub": "2022-05-09T13:25:00Z", "dataType": "news", "sim": 0.6117647290229797, "url": "https://www.standard.co.uk/news/world/ukraine-azovstal-steel-plant-mariupol-russia-zelensky-b998886.html", "title": "Ukrainian soldiers at besieged Azovstal plant vow to keep fighting ", "body": "krainian soldiers at the besieged Azovstal steel plant have vowed to keep on fighting \"as long as we are alive\".\n\nRussian forces have continued shelling the steelworks building which is the last holdout of resistance in the ruined south-eastern port city of Mariupol.\n\nHowever, soldiers from the Azov regiment have refused to surrender despite being vastly outnumbered.\n\n\"We will continue to fight as long as we are alive to repel the Russian occupiers,\" Captain Sviatoslav Palamar, a deputy commander of Ukraine's Azov Regiment, told an online news conference.\n\n\"We don't have much time, we are coming under intense shelling,\" he said, pleading with the international community to help to evacuate wounded soldiers from the plant.\n\nIllia Samoilenko, a fighter with the Azov Regiment who also took part in the virtual conference, said they still had weapons, munitions and water, and were prepared to fight as long as they must.\n\n\"We can die at any moment... Our message is don't waste our efforts,\" Mr Samoilenko said, calling on the Ukrainian government to rely more on continuing fighting against Russian forces than hopes that Moscow can be pacified by negotiations.\n\nIn a week-long operation brokered by the United Nations and the International Committee of the RedCross (ICRC), scores of civilians in the plant's underground shelters have been evacuated.\n\nThe Ukrainian President Volodymyr Zelensky said that more than 300 civilians had been rescued and that authorities would now focus on trying to evacuate the wounded and medics. Other Ukrainian sources have cited different figures.\n\nRussian-backed separatists said a total of 145 people, including 24 children, were evacuated on Sunday from Mariupol to the village of Bezimenne, about 25 miles east, in the area they control.", "source": {"uri": "standard.co.uk", "dataType": "news", "title": "Evening Standard"}, "authors": [{"uri": "sami_quadri@standard.co.uk", "name": "Sami Quadri", "type": "author", "isAgency": false}], "image": "https://static.standard.co.uk/2022/05/06/08/SEI102440065.jpg?width=1200&width=1200&auto=webp&quality=75", "eventUri": "eng-7697627", "sentiment": -0.07450980392156858, "wgt": 156, "relevance": 1, "stanza_neg": 8, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036717952", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "12:46:00", "dateTime": "2022-05-11T12:46:00Z", "dateTimePub": "2022-05-11T12:16:00Z", "dataType": "news", "sim": 0.6117647290229797, "url": "http://rusjev.net/2022/05/11/planes-artillery-tanks-infantry-russians-storm-azovstal-with-everything-they-can/", "title": "Planes, artillery, tanks, infantry: Russians storm Azovstal with everything they can", "body": "Russian troops continue to carry out airstrikes and bomb the Azovstal iron and steel works in the besieged city of Mariupol.\n\nSource: Azov Regiment\n\nLiterally: \"Over the past day, 38 aircraft flew to the territory of the Azovstal plant, which is defended by the defenders of Mariupol, including 4 sorties of strategic bombers.\n\nWhat preceded it: Illia Samoilenko, an Intelligence Directorate officer from the Azov Regiment, said that his unit cannot surrender to the Russians, because it has an order to keep the Azovstal defence in Mariupol and cannot violate it.", "source": {"uri": "rusjev.net", "dataType": "news", "title": "Русский Еврей"}, "authors": [], "image": null, "eventUri": "eng-7697627", "sentiment": 0.1058823529411765, "wgt": 156, "relevance": 1, "stanza_neg": 1, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 4, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036879376", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "14:50:00", "dateTime": "2022-05-11T14:50:00Z", "dateTimePub": "2022-05-11T13:12:00Z", "dataType": "news", "sim": 0.5882353186607361, "url": "https://www.washingtonpost.com/world/2022/05/11/mariupol-fighters-ukraine-wounded-azovstal-steel-plant-photos/", "title": "Mariupol fighters  --  faces bruised, limbs missing  --  plead for rescue", "body": "Some are pictured with lost arms, others their legs, while many sit with bandaged wounds, waiting for help that might not arrive as Russian troops continue their assault.\n\n\"The whole civilized world must see the conditions in which the wounded, crippled defenders of Mariupol are and act!\" the regiment wrote in its post, adding that conditions at the plant are \"completely unsanitary\" and that the wounded are without access to medication and food.\n\nThe regiment said that along with those photographed, \"hundreds more\" are in need of medical attention due to constant shelling from Russian forces.\n\nIt called on the United Nations and the Red Cross to evacuate the wounded, who are being treated in makeshift hospitals at the industrial site -- one of which was targeted in an airstrike Tuesday, local police said.\n\nLast Ukrainian fighters in Mariupol vow to fight 'as long as we are alive'\n\nAn estimated 300 women and children were evacuated from the sprawling steel plant during a three-day operation last weekend, after weeks spent trapped underground at the site. Some who made it out said they had spent more than a month hidden inside cold tunnels below the complex, without access to sunlight or food.\n\nOn Tuesday, Ukrainian President Volodymyr Zelensky said rescue operations will be increasingly difficult as his government had tried \"all possible diplomatic tools\" to evacuate the remaining soldiers but Russia had not agreed to any proposals.\n\nRussian government-owned news agency Tass quoted the leader of the pro-Russian Donetsk separatist group in the city as saying Wednesday that its hands were \"no longer tied\" because civilians at the plant had been evacuated.\n\nUkraine's soldiers vowed to remain in the city's foothold and to fight until the end, as regional police told The Washington Post that three soldiers were killed Friday during the civilian evacuation.\n\nThere are conflicting reports about the number of remaining fighters and civilians within the plant, which before the war, was one of Europe's largest metallurgical factories, pumping out millions of tons of crude steel every year.\n\nOfficials said Saturday that all women, children and elderly made it out of the plant, however, Petro Andryushchenko, an aide to the Mariupol mayor, wrote Tuesday on Telegram that Russian forces continue to bombard the Azovstal Iron and Steel Works complex despite the presence of \"at least\" 100 civilians there.\n\nUkrainian Deputy Prime Minister Iryna Vereshchuk, speaking to Agence France-Presse on Tuesday, said that more than 1,000 Ukrainian fighters, many of them injured, remain at the plant.\n\nLater that day, Police Chief Mykhailo Vershynin, who is inside the plant, disputed those figures, telling The Post that other officials' accounting of the number of civilians was wrong without giving further details. Vershynin said there are more than 500 wounded people in the plant and that number is increasing \"every day.\" The Post could not independently confirm any of the estimates.\n\nEvacuees from Mariupol steel plant describe brutality of long siege\n\nIlya Samoilenko, a lieutenant from Azov, said in an interview with Sky News on Wednesday that \"words of support will not stop a bomb from collapsing our bunker,\" a looming threat he said could become a reality in a matter of minutes or hours.\n\nSamoilenko, who was wearing an eye patch, said forces have held out against Russian attacks -- but their \"fighting capabilities are far lesser than they need right now.\"\n\nHis pleas came as Kateryna Prokopenko, the wife of Azov Regiment commander Denys Prokopenko, and Yulya Fedosiuk, the wife of Azov soldier Arseniy Fedosiuk, met with Pope Francis in Rome on Wednesday and asked for his help in rescuing their husbands and other soldiers from inside the steelworks, the Catholic News Service reported.\n\nSerhiy Volyna, a commander of the 36th Separate Marine Brigade who is inside Azovstal, said in a Facebook post shared Wednesday that soldiers were willing to \"give their lives for the motherland.\"\n\nLast month, Volyna told The Post that fighters inside steel plant were \"dying underground\" and called on other nations to intervene to secure safe passage for those wanting to leave the area.", "source": {"uri": "washingtonpost.com", "dataType": "news", "title": "Washington Post"}, "authors": [], "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JQBTJTWQQUI6ZCDL353BQPJDH4.jpg&w=1440", "eventUri": "eng-7697627", "sentiment": -0.08235294117647063, "wgt": 150, "relevance": 1, "stanza_neg": 13, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7034716036", "lang": "eng", "isDuplicate": false, "date": "2022-05-10", "time": "03:28:00", "dateTime": "2022-05-10T03:28:00Z", "dateTimePub": "2022-05-10T03:28:00Z", "dataType": "news", "sim": 0.5843137502670288, "url": "https://www.newsy.com/stories/ukrainian-fighters-continue-to-defend-steel-plant/", "title": "Ukrainian Fighters Defend Steel Plant As Russia Celebrates Victory Day", "body": "Fighters say conditions as dire but they have food, water and ammunition. They vow to fight to the death because surrendering would be suicide.\n\nIt's an image orchestrated by Russia for Russian state-run TV viewers -- a ribbon symbolizing Russia's military paraded through the streets of Mariupol by pro-Putinists who've come to the occupied city.\n\nBut on the day when Putin had expected to announce victory in Mariupol, he cannot. He's denied by Ukrainian fighters -- around 2,000 of them -- waging a last stand against overwhelming odds beneath the twisted ruins of the Soviet-era Azovstal steel works plant.\n\nAs if to taunt Putin even more, amidst the horror of the battle, the fighters held an astonishing news conference via Zoom. The connection was made possible by Starlink, which is Elon Musk's satellite internet service.\n\nDeep in their bunkers it's dark, desolate, and extremely dangerous.\n\n\"Surrender for us is unacceptable,\" Azov Regiment Fighter Ilya Samoilenko said. \"Surrender is not an option because Moscow is not interested in our lives....We are basically dead men. Most know this and it's why we fight so fearlessly.\"\n\nThey vow to fight to the death because surrendering would be suicide.\n\n\"We, all of the military personnel in the garrison of the Mariupol, we eye-witnessed the war crimes conducted by Russia, by the Russian army,\" Samoilenko.\n\nThey described conditions as dire but say they have food, water and ammunition.\n\n\"We will continue to fight as long as we are alive to repel the Russian occupiers,\" Azov Regiment Deputy Commander Sviatoslav Palamar said. \"We don't have much time. We are coming under intense shelling.\"\n\nThey pleaded for the more than 500 wounded to be evacuated.\n\n\"We still have many wounded soldiers who need the help we so desperately ask for,\" Palamar continued.\n\nThe fighters are resigned and bitter about what they say is the failure of the government in Kyiv to find some way to get them out alive.\n\n\"Somebody better do their jobs. Somebody needs to listen to us instead of the Russians,\" Samoilenko said. \"We feel abandoned.\"\n\nHopes for a cease fire died with the evacuation of civilians from the steel plant completed over the weekend.\n\nThe deputy commander says his men sacrificed to make that happen. Three of his troops died helping with the escape.", "source": {"uri": "newsy.com", "dataType": "news", "title": "Newsy"}, "authors": [], "image": "https://cdn.newsy.com/images/videos/m/1652125293_lGhRtM.jpg", "eventUri": "eng-7697627", "sentiment": -0.3803921568627451, "wgt": 149, "relevance": 1, "stanza_neg": 11, "stanza_neu": 14, "stanza_pos": 1, "swn_neg": 26, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036732752", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "12:56:00", "dateTime": "2022-05-11T12:56:00Z", "dateTimePub": "2022-05-11T12:52:00Z", "dataType": "news", "sim": 0.5647059082984924, "url": "https://www.silverscreenbeat.com/the-horror-that-the-army-chief-experienced-after-being-bombarded-for-73-consecutive-days-at-mariupols-steel-plant-world-news/", "title": "The horror that the army chief experienced after being bombarded for 73 consecutive days at Mariupol's steel plant - World News - Silver Screen Beat", "body": "The Mirror received a horrifying account from a Ukrainian army chief who was hiding in the Mariupol steel plant.\n\nIlya Samoilenko describes how terrifying it was to be bombed by the Russians for 73 days while trying desperately to hold on the Azovstal plant.\n\nSamoilenko, 36 years old, is responsible for intelligence and reconnaissance within the Ukraine Army Factory.\n\nThe brave officer was already blinded and had to be amputated after he tried to fight against Russian mines during the war.\n\nHe speaks about the heroism and bravery of soldiers.\n\nThree of his colleagues were killed and six others were wounded 24 hours prior to his call to Mirror.\n\nHe stated that: \"We've been in a locked-down place for 73 days now - without replenishing our supplies.\n\n\"You go brush your teeth in the morning and you know you might get killed doing that.\n\n\"It's like an extreme sport or some twisted game where you play the role of the target.\n\n\"One of our soldiers was killed - his mother received messages from his phone with photos of her son, executed by the Russian military - strangled with a bag on his head.\n\n\"The Russians are not interested in witnesses surviving at all. The Azovstal factory area is completely bombed out.\n\n\"There are huge bomb craters, some of them up to 20 metres in diameter. It resembles the surface of the moon.\"\n\nWe asked him about a typical day in Azovstal.\n\nHe said: \"Each day bombs are dropped, shots are fired at us. Conditions are very far from ideal.\n\n\"We are not just living here in a blockaded area, we are fighting here.\n\n\"An ordinary day depends on what a soldier or an officer does, there are different duties.\n\n\"But directly each of us, apart from providing for our daily life, is fighting.\n\n\"The supply of medicines is limited, as is the supply of provisions.\n\n\"Many critical medications are no longer available.\n\n\"Wounded people who need specific care cannot get medical supplies.\n\n\"It is a problem we cannot solve on our own. There are many different types of wounds.\n\n\"These are bullet wounds, shrapnel wounds, mine blast injuries, fall injuries, compression injuries.\n\n\"These are people who have been rescued from the rubble.\n\n\"Amputated limbs, arms, legs - not problems that can be easily solved in conditions of an improvised field hospital.\n\n\"Most of the amputations that fighters have received are when a limb has been damaged or torn off already by an explosion, or by a shrapnel or a bullet.\n\n\"Here in Azovstal the doctors were doing the most unbelievable things, heroic deeds. The medics are real heroes.\n\n\"People are asking us how much food and water we have left. I can't believe my ears when I hear that.\n\n\"Would I say that if I knew the exact number? What is that, people are setting a counter until we die?\n\n\"At the moment we have managed to find all the civilians, they have been evacuated.\n\n\"But there is still a possibility that some could be under the rubble. But 99% of the people we found have left.\"\n\nHe said: \"The problem is that the Russian side, contrary to UN agreements, continued shelling while evacuating people.\n\n\"The Russian army can be expected to do anything.\n\n\"Because by their actions they have already shown that their military is capable of any action beyond human understanding.\n\n\"This is a terrorist tactic, a scorched earth tactic.\n\nHe gave more details of Russian atrocities.\n\n\"We had an incident recently - one of our fighters \"Dan\"He was captured in the city. He was captured.\n\n\"The enemy published the video, where you could see this soldier with his name tag, his surname, his unit.\n\n\"After about four days his mother received messages from his phone with photos of her son, executed by the Russian military, strangled, with a bag on his head.\"\n\nHe promised that they would never give up.\n\n\"Prisoners of war who surrender in large numbers are a huge gift to the enemy.\n\n\"A gift that is both ideological and psychological,.. We can not give such a gift to the enemy.\"\n\nMariupol's steelworks were a pivotal battleground during the war. Crack Ukrainian troops fought to save the city from Russian control.\n\nIt was a highly controversial point that Vladimir Putin became furious at the inability of his army to take it.\n\nLast month, he spoke out about a plan for the Azovstal Steelworks to be overthrown. \"impractical\".\n\nHe ordered Russian troops then to blockade this area \"so that a fly can't get through\"It is possible to starve the Ukrainians.\n\nAfter several weeks, he seemed to have changed his mind and the heavy bombing increased again.\n\nThe Azov regiment, which is still holding out in Azovstal said that over the past 24 hours, 34 Russian planes had flown above the plant, including eight sorties of strategic bombers.\n\nIt stated that the plant was under attack from the Russian navy as well as tanks, artillery firing and rockets.\n\nMany civilians sought refuge in the plant, which boasts a large number of underground tunnels.\n\nMost of them were evacuated within the last seven days.\n\nThe huge plant is still home to around 2,000 soldiers from Ukraine.\n\nRussia has taken Mariupol's entire city, with the exception of the steelworks.", "source": {"uri": "silverscreenbeat.com", "dataType": "news", "title": "Silver Screen Beat"}, "authors": [{"uri": "david_wells@silverscreenbeat.com", "name": "David Wells", "type": "author", "isAgency": false}], "image": "https://www.silverscreenbeat.com/wp-content/uploads/2022/05/Inside-Mariupol-steel-plant-as-army-chief-describes-horror-of.jpg", "eventUri": "eng-7697627", "sentiment": -0.207843137254902, "wgt": 144, "relevance": 1, "stanza_neg": 18, "stanza_neu": 44, "stanza_pos": 2, "swn_neg": 64, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036715105", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "12:44:00", "dateTime": "2022-05-11T12:44:00Z", "dateTimePub": "2022-05-11T12:34:00Z", "dataType": "news", "sim": 0.5215686559677124, "url": "https://www.mirror.co.uk/news/world-news/inside-mariupol-steel-plant-army-26927495", "title": "Army chief describes horror of being bombed for 73 days in Mariupol steel plant", "body": "A Ukraine army chief holed up in the besieged Mariupol steel plant gave the Mirror a harrowing account of conditions inside.\n\nIlya Samoilenko describes the terror of being bombed for 73 days by the Russians while desperately trying to hold the Azovstal plant.\n\nSamoilenko, 36, is in charge of the Ukraine army intelligence and reconnaissance in the factory.\n\nThe courageous officer had already lost an eye and arm while dealing with Russian mines earlier in the war.\n\nHe talks about the heroism of the doctors and the bravery of the soldiers.\n\n24 hours before his call to the Mirror three of his colleagues had been killed and six wounded.\n\nHe said: \"We've been in a locked-down place for 73 days now - without replenishing our supplies.\n\n\"You go brush your teeth in the morning and you know you might get killed doing that.\n\n\"It's like an extreme sport or some twisted game where you play the role of the target.\n\n\"One of our soldiers was killed - his mother received messages from his phone with photos of her son, executed by the Russian military - strangled with a bag on his head.\n\nSmoke rises above the Mariupol steel plant ( Image: REUTERS)\n\n\"The Russians are not interested in witnesses surviving at all. The Azovstal factory area is completely bombed out.\n\n\"There are huge bomb craters, some of them up to 20 metres in diameter. It resembles the surface of the moon.\"\n\nWe asked him to describe a typical day in Azovstal.\n\nHe said: \"Each day bombs are dropped, shots are fired at us. Conditions are very far from ideal.\n\n\"We are not just living here in a blockaded area, we are fighting here.\n\n\"An ordinary day depends on what a soldier or an officer does, there are different duties.\n\n\"But directly each of us, apart from providing for our daily life, is fighting.\n\n\"The supply of medicines is limited, as is the supply of provisions.\n\n\"Many critical medications are no longer available.\n\n\"Wounded people who need specific care cannot get medical supplies.\n\nThe army chief had already lost an eye and arm while dealing with Russian mines earlier in the war\n\n\"It is a problem we cannot solve on our own. There are many different types of wounds.\n\n\"These are bullet wounds, shrapnel wounds, mine blast injuries, fall injuries, compression injuries.\n\n\"These are people who have been rescued from the rubble.\n\n\"Amputated limbs, arms, legs - not problems that can be easily solved in conditions of an improvised field hospital.\n\n\"Most of the amputations that fighters have received are when a limb has been damaged or torn off already by an explosion, or by a shrapnel or a bullet.\n\n\"Here in Azovstal the doctors were doing the most unbelievable things, heroic deeds. The medics are real heroes.\n\n\"People are asking us how much food and water we have left. I can't believe my ears when I hear that.\n\n\"Would I say that if I knew the exact number? What is that, people are setting a counter until we die?\n\n\"At the moment we have managed to find all the civilians, they have been evacuated.\n\n\"But there is still a possibility that some could be under the rubble. But 99% of the people we found have left.\"\n\nUkraine shows firefighters putting out the fire after a Russian missile hit the shopping and entertainment center of Odesa ( Image: State Emergency Service of Ukrai)\n\nHe added: \"The problem is that the Russian side, contrary to UN agreements, continued shelling while evacuating people.\n\n\"The Russian army can be expected to do anything.\n\n\"Because by their actions they have already shown that their military is capable of any action beyond human understanding.\n\n\"This is a terrorist tactic, a scorched earth tactic.\n\nHe gave more details of Russian atrocities.\n\n\"We had an incident recently - one of our fighters \"Dan\" was surrounded in the city. He was captured.\n\n\"The enemy published the video, where you could see this soldier with his name tag, his surname, his unit.\n\nUkrainian President Volodymyr Zelensky ( Image: EyePress News/REX/Shutterstock)\n\n\"After about four days his mother received messages from his phone with photos of her son, executed by the Russian military, strangled, with a bag on his head.\"\n\nHe said they would never surrender.\n\n\"Prisoners of war who surrender in large numbers are a huge gift to the enemy.\n\n\"A gift that is both ideological and psychological,.. We can not give such a gift to the enemy.\"\n\nThe steelworks in Mariupol became one of the key battlegrounds in the war with crack Ukrainian troops fighting to save it from falling into Russian hands.\n\nRussian President Vladimir Putin watches the Victory Day military parade at Red Square in central Moscow ( Image: SPUTNIK/AFP via Getty Images)\n\nIt became such a controversial flashpoint that Vladimir Putin was furious his army could not take it.\n\nLast month he described a plan to storm the Azovstal steelworks as \"impractical\".\n\nHe then ordered Russian troops to blockade the area \"so that a fly can't get through\" to try and starve the Ukrainians.\n\nBut after several weeks he appeared to change tack and heavy bombing intensified again.\n\nEmergency personnel work near a building damaged after a military strike in Odesa, Ukraine ( Image: via REUTERS)\n\nThe Azov Regiment, which is holding out in Azovstal, said that in the past 24 hours, 34 Russian aircraft had flown over the plant including eight sorties by strategic bombers.\n\nIt said the plant had come under fire from the Russian navy and from tanks, artillery fire and rockets.\n\nHundreds of civilians took shelter in the plant which has a huge myriad of underground tunnels.\n\nMost of them have been safely evacuated in the last seven days.\n\nAround 2,000 Ukraine soldiers are still in the huge plant.\n\nRussia has taken the whole city of Mariupol except for the steelworks.\n\nRead More\n\nRead More", "source": {"uri": "mirror.co.uk", "dataType": "news", "title": "Mirror"}, "authors": [{"uri": "andy_lines@mirror.co.uk", "name": "Andy Lines", "type": "author", "isAgency": false}], "image": "https://i2-prod.mirror.co.uk/incoming/article26928824.ece/ALTERNATES/s1200/0_MBP_CHP__937JPG.jpg", "eventUri": "eng-7697627", "sentiment": -0.1450980392156863, "wgt": 133, "relevance": 1, "stanza_neg": 18, "stanza_neu": 51, "stanza_pos": 2, "swn_neg": 71, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7037129553", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "18:22:00", "dateTime": "2022-05-11T18:22:00Z", "dateTimePub": "2022-05-11T18:22:00Z", "dataType": "news", "sim": 0.501960813999176, "url": "https://www.npr.org/2022/05/07/1097376932/ukraine-wives-mariupol-azovstal-steel-plant", "title": "Spouses of Ukrainian soldiers in the Mariupol steel plant plead for an evacuation", "body": "ZAPORIZHZHIA, Ukraine -- When Yaroslava Ivantsova spotted the convoy of blue-and-white United Nations vans outside a hotel in this lush, riverine city, she knew what she had to do: text the others to come over, pronto, and bring the banners and posters.\n\nOne reads: \"Soldiers are humans too.\" Another: \"Rescue Our Defenders.\" And another: \"Save the Military of Mariupol.\"\n\n\"They're abandoning our soldiers,\" says Ivantsova, a 48-year-old grandmother with freckles and platinum-blond hair. \"We can't let this happen.\"\n\nIvantsova's husband, Nikolai, is one of hundreds of Ukrainian soldiers who have, for the past 10 weeks, staged a last stand against Russian occupation in the southeastern port city of Mariupol. The fighters -- who include men and women -- are holding out in a labyrinth of shelters under the Soviet-era Azovstal plant, one of the largest steel mills in Europe. On Sunday, the soldiers even managed to hold a video press conference from inside the plant, despite problems with connectivity. They call the tunnels \"the territory of Azovstal\" but paint a dire picture of what's happening there. They say there are many dead, and more wounded.\n\nSviatoslav Palamar, deputy commander of the Azov Regiment, told reporters that wounded soldiers are dying from gangrene due to infections because there aren't enough antibiotics and no equipment to conduct amputations.\n\n\"It is truly catastrophic,\" Palamar said.\n\nUkrainian and Russian officials say all civilians have been evacuated from Azovstal after three operations led by the United Nations and International Committee of the Red Cross. (U.N. humanitarian officials say they can't independently confirm this.) But the soldiers remain to fight what Ivantsova compares to a modern-day Battle of Thermopylae.\n\n\"I've heard people call our soldiers 'the 300,' 'the Spartans,'\" she tells NPR at the Zaporizhzhia hotel where she and others demonstrated. \"I have mixed feelings. I am proud of them, but right now we don't need dead heroes. We need living heroes.\"\n\nIvantsova met her husband 30 years ago, when he was a young soldier and she was a college freshman. He's Ukrainian. She was born in Chita, a city in Russia's far east.\n\n\"I feel ashamed to admit that I was born in Russia,\" she says, sighing. \"I don't want to be associated with this country. Look what [the Russians] have done to Mariupol. I don't even talk to my relatives there.\"\n\nThe couple have four children and four grandchildren. They used to live in Mariupol. Her husband helped defend the city when Russian-backed separatists attacked in 2015. And when Russian troops invaded this February, he fought alongside hundreds of Ukrainian soldiers to defend the city. Russian troops pummeled Mariupol, reducing most of it to charred rubble. Mariupol's vice mayor, Sergei Orlov, tells NPR that thousands of residents are estimated to have died during the Russian siege. Many are thought to be buried in mass graves. Russian troops now occupy the ruins of the city.\n\n\"Azovstal is the last part of Mariupol that is free,\" Ivantsova says. \"Our soldiers should be rewarded for this.\"\n\nShe says her husband tells her he wants to fight to the last bullet. And she understands that, as a soldier, he signed up for this life. But she worries that if he and his fellow soldiers are captured, they will be executed.\n\n\"Nobody trusts the army of Vladimir Putin,\" she says, referring to Russia's president. \"He can barely honor a cease-fire.\"\n\nRussia has also sought to portray the Azovstal soldiers as far-right extremists. Some of the soldiers holed up in the steel plant are members of the Azov Regiment, which is a unit of the Ukrainian National Guard. It got its start as a volunteer battalion, founded in 2014 by far-right nationalists. But many of these extremists left after the battalion joined the armed forces, says Polina Beliakova, a research associate at the Center for Strategic Studies at Tufts University who has studied Ukraine's volunteer battalions. She says the Azov Regiment currently includes fighters with diverse political views and ethnic backgrounds.\n\nIvantsova says her husband rejects far-right views and only wants to defend Ukraine.\n\n\"Nikolai is a patriot,\" she says. \"And by that I mean he wants everyone in this country to live and breathe free.\"\n\nOutside the hotel with the U.N. vans, at least a dozen women join Ivantsova in singing the national anthem. Their handwritten posters rattle in the wind. A few reporters show up but no one else stops.\n\nLater, the group meets at the EpiCenter, a shopping mall that features a large DIY home improvement store. The parking lot has become a way station for displaced Ukrainians fleeing Russian attacks. The centerpiece is a large tent stuffed with clothes, stuffed animals, plastic bags of nonperishable food and a station for coffee, tea and hot soup. Humanitarian workers are everywhere.\n\n\"Let's take out the signs,\" Ivantsova says.\n\nThe news from Azovstal seems to get more dire every hour. Russian troops began storming the underground tunnels. There are reports that the fighting is bloody and fierce. Some of the men have also sent goodbye messages to their spouses.\n\nA 22-year-old, her brown hair in a long braid, weeps. She gives her name as Olha and won't reveal her last name because she's worried the Russians will target her fiancé, who is inside Azovstal, if they capture him. She describes him as soft-spoken and romantic, the kind of guy who used to make her coffee every morning and slip Kinder chocolates (her favorite) into her handbag.\n\n\"Even when he's in a living hell -- which is where he is right now -- he always asks me how I'm doing, if I need help, if he can do anything for me,\" she says. \"And he writes very tender poems for me.\"\n\nShe's one of the few who speak to NPR at the shopping center parking lot. Many of the women are wiping away tears and waving away reporters. They flag down a Greek Catholic priest and ask him if he has connections to the Vatican. Some of the women have sent a letter to Pope Francis asking for help. The priest asks them to pray.\n\nAnother military spouse, who gives only her first name, Katia, gets angry.\n\n\"We don't need prayer, we need action,\" she says. \"How could the government and all these international aid organizations leave Ukraine's heroes -- our husbands -- in there to die?\"\n\nYaroslava Ivantsova's husband hasn't been online for two days.\n\n\"There is no mobile communication, I asked the girls but absolutely no one has communication,\" she says. \"I am so worried.\" She digs into her purse. \"I even tried to find my anti-anxiety pills. I had them somewhere.\"\n\nAs she looks, the other women begin chanting: Save Azovstal! Ivantsova drops her bag to the ground and clutches a handwritten banner that reads: \"Save Us.\"", "source": {"uri": "npr.org", "dataType": "news", "title": "NPR"}, "authors": [{"uri": "joanna_kakissis@npr.org", "name": "Joanna Kakissis", "type": "author", "isAgency": false}], "image": "https://media.npr.org/assets/img/2022/05/10/gettyimages-1240448228_wide-c855bb40a26760184a0d5b9b20ffed795b24f1cf.jpg?s=1400", "eventUri": "eng-7697627", "sentiment": 0.06666666666666665, "wgt": 128, "relevance": 1, "stanza_neg": 13, "stanza_neu": 67, "stanza_pos": 4, "swn_neg": 84, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]