[{"uri": "7035557069", "lang": "eng", "isDuplicate": false, "date": "2022-05-10", "time": "16:04:00", "dateTime": "2022-05-10T16:04:00Z", "dateTimePub": "2022-05-10T14:59:00Z", "dataType": "news", "sim": 0.8196078538894653, "url": "https://censor.net/en/news/3340440/azov_regiment_showed_photos_of_wounded_soldiers_at_azovstal_are_ukraine_and_world_community_unable_to", "title": "Azov Regiment showed photos of wounded soldiers at Azovstal: Are Ukraine and world community unable to take care of them?. PHOTOS", "body": "The Azov Regiment showed photos of wounded Ukrainian soldiers stationed at Azovstal in besieged Mariupol.\n\n\"The whole civilized world must see the conditions in which the wounded, crippled defenders of Mariupol are and act!\n\nIn complete unsanitary conditions, with open wounds bandaged with non-sterile remnants of bandages, without the necessary medication and even food. We call on the United Nations and the Red Cross to show their humanity and reaffirm the basic principles on which you were created by rescuing wounded people who are no longer combatants, \"the statement said.\n\n\"The servicemen you see in the photo and hundreds more at the Azovstal plant defended Ukraine and the whole civilized world with serious injuries at the cost of their own health. Are Ukraine and the world community now unable to protect and take care of them?\"\n\n\"We demand the immediate evacuation of the wounded servicemen to the territories controlled by Ukraine, where they will be provided with assistance and proper care,\" Azov said.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/9/2/3/6/92361c327a27611448a50e2ff56f10f4/censor_social.jpg", "eventUri": "eng-7704374", "sentiment": 0.1450980392156862, "wgt": 209, "relevance": 1, "stanza_neg": 1, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036443637", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "09:14:00", "dateTime": "2022-05-11T09:14:00Z", "dateTimePub": "2022-05-11T09:14:00Z", "dataType": "news", "sim": 0.7450980544090271, "url": "https://www.kyivpost.com/ukraine-politics/denisova-calls-on-un-to-take-measures-to-evacuate-wounded-soldiers-from-azovstal-plant.html", "title": "Denisova calls on UN to take measures to evacuate wounded soldiers from Azovstal plant - KyivPost - Ukraine's Global Voice", "body": "Verkhovna Rada Human Rights Commissioner Liudmyla Denisova has called on the UN and the Red Cross to take all measures in accordance with their mandates to evacuate wounded soldiers from the Azovstal steel plant to safe regions in Ukraine.\n\nShe made the appeal on Telegram, Ukrinform reports.\n\n\"I call on the UN and the Red Cross to take all measures in accordance with their mandates to evacuate wounded Azovstal soldiers to safe regions of Ukraine, where they will be provided with medical care and proper care,\" Denisova said.\n\nAccording to her, \"with open wounds, without the necessary medication, in unsanitary conditions - in such inhumane conditions are wounded and maimed defenders of Mariupol, servicemen of the Azov National Guard.\"\n\nShe clarified that Mariupol defenders are making inhuman efforts every minute to defend the city's last outpost and they did not hesitate to sacrifice themselves to save Ukraine and the world from total evil. \"Now the world must save them,\" the Ukrainian ombudswoman said.\n\n\"According to Article 16 of the Geneva Convention relative to the Protection of Civilian Persons in Time of War, the sick and wounded are under special protection and special respect. Article 3 of the Convention on the Amelioration of the Condition of the Wounded and Sick in Armed Forces obliges the parties to treat the wounded humanely in all circumstances,\" Denisova said.\n\nThe Russian invasion of Ukraine caused one of the biggest humanitarian catastrophes in Mariupol. The city was left without energy, water and gas supply.\n\nMariupol Mayor Vadym Boichenko said that up to 20,000 civilians in the city had been killed since the beginning of the Russian invasion.\n\nMore than 100,000 civilians remain trapped in Mariupol. The invaders are taking away Ukrainian passports from Mariupol's residents and forcibly deporting them to Russia and the occupied regions of Donetsk and Luhansk.\n\nSoldiers of the Azov Regiment, National Guard, Ukrainian marines, and motor riflemen continue to defend the besieged city.", "source": {"uri": "kyivpost.com", "dataType": "news", "title": "KyivPost"}, "authors": [], "image": "https://www.kyivpost.com/wp-content/uploads/2022/05/630_360_1652257133-808.jpg", "eventUri": "eng-7704374", "sentiment": 0.2078431372549019, "wgt": 190, "relevance": 1, "stanza_neg": 2, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036636390", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "11:44:00", "dateTime": "2022-05-11T11:44:00Z", "dateTimePub": "2022-05-11T11:32:00Z", "dataType": "news", "sim": 0.7450980544090271, "url": "https://en.24tv.ua/mariupol-wounded-soldiers-trapped-inside-azovstal-plead-for-help_n1976806", "title": "Mariupol: wounded soldiers trapped inside Azovstal plead for help", "body": "A series of photos published on the Azov Regiment's Telegram channel early this morning purport to show the squalid conditions of wounded Ukrainian defenders holed up under the Azovstal steelworks plant in besieged Mariupol.\n\nRead here I found myself in some hellish reality show: revelation of Mariupol's defender\n\n\"The whole civilised world must see the conditions in which the wounded, crippled defenders of Mariupol are and act!\n\nIn completely unsanitary conditions, with open wounds bandaged with non-sterile remnants of bandages, without the necessary medication and even food.\n\nWe call on the UN and the Red Cross to show their humanity and reaffirm the basic principles on which you were created by rescuing wounded people who are no longer combatants.\n\nThe servicemen you see in the photo and hundreds more at the Azovstal plant defended Ukraine and the entire civilised world with serious injuries at the cost of their own health. Are Ukraine and the world community now unable to protect and take care of them?\"", "source": {"uri": "en.24tv.ua", "dataType": "news", "title": "24 Канал"}, "authors": [], "image": "https://en.24tv.ua/resources/photos/news/1200x675_DIR/202205/1976806.jpg?v=1652268745000", "eventUri": "eng-7704374", "sentiment": 0.0117647058823529, "wgt": 190, "relevance": 1, "stanza_neg": 2, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036455255", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "09:24:00", "dateTime": "2022-05-11T09:24:00Z", "dateTimePub": "2022-05-11T09:23:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.ukrinform.net/rubric-ato/3480441-denisova-calls-on-un-to-take-measures-to-evacuate-wounded-soldiers-from-azovstal-plant.html", "title": "Denisova calls on UN to take measures to evacuate wounded soldiers from Azovstal plant", "body": "\"I call on the UN and the Red Cross to take all measures in accordance with their mandates to evacuate wounded Azovstal soldiers to safe regions of Ukraine, where they will be provided with medical care and proper care,\" Denisova said.\n\nAccording to her, \"with open wounds, without the necessary medication, in unsanitary conditions - in such inhumane conditions are wounded and maimed defenders of Mariupol, servicemen of the Azov National Guard.\"\n\nShe clarified that Mariupol defenders are making inhuman efforts every minute to defend the city's last outpost and they did not hesitate to sacrifice themselves to save Ukraine and the world from total evil. \"Now the world must save them,\" the Ukrainian ombudswoman said.\n\n\"According to Article 16 of the Geneva Convention relative to the Protection of Civilian Persons in Time of War, the sick and wounded are under special protection and special respect. Article 3 of the Convention on the Amelioration of the Condition of the Wounded and Sick in Armed Forces obliges the parties to treat the wounded humanely in all circumstances,\" Denisova said.\n\nThe Russian invasion of Ukraine caused one of the biggest humanitarian catastrophes in Mariupol. The city was left without energy, water and gas supply.\n\nMariupol Mayor Vadym Boichenko said that up to 20,000 civilians in the city had been killed since the beginning of the Russian invasion.\n\nMore than 100,000 civilians remain trapped in Mariupol. The invaders are taking away Ukrainian passports from Mariupol's residents and forcibly deporting them to Russia and the occupied regions of Donetsk and Luhansk.\n\nSoldiers of the Azov Regiment, National Guard, Ukrainian marines, and motor riflemen continue to defend the besieged city.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_05/thumb_files/630_360_1652257133-808.jpg", "eventUri": "eng-7704374", "sentiment": 0.01960784313725483, "wgt": 188, "relevance": 1, "stanza_neg": 2, "stanza_neu": 9, "stanza_pos": 1, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7035628306", "lang": "eng", "isDuplicate": false, "date": "2022-05-10", "time": "17:06:00", "dateTime": "2022-05-10T17:06:00Z", "dateTimePub": "2022-05-10T16:50:00Z", "dataType": "news", "sim": 0.7254902124404907, "url": "https://www.ukrinform.net/rubric-ato/3480020-we-demand-immediate-evacuation-azov-regiment-shows-wounded-mariupol-defenders.html", "title": "We demand immediate evacuation: Azov Regiment shows wounded Mariupol defenders ", "body": "\"The whole civilized world must see the conditions, in which the wounded, crippled defenders of Mariupol live, and take action! [They live] in completely unsanitary conditions, with open wounds bound with non-sterile remnants of bandages, without the necessary medicines and even food,\" the statement reads.\n\nIt is noted that the service members in the pictures and hundreds more, who remained at the Azovstal steelworks, are seriously wounded.\n\n\"We demand the immediate evacuation of the wounded service members to the Ukraine-controlled territories where assistance and proper care will be provided to them,\" the defenders of Mariupol wrote.\n\nThey also called on the UN and the Red Cross to reaffirm their basic founding principles by rescuing wounded people who are no longer combatants.\n\nAs reported, over the past day, the Russian invaders made 34 air raids on the Azovstal steelworks, including eight sorties of strategic bombers.\n\nOn May 7, civilians - women, children, and the elderly - were evacuated from the bunkers of the Azovstal steelworks in Mariupol.\n\nHowever, on May 9, Head of the Donetsk Regional Military Administration Pavlo Kyrylenko said that more than 100 civilians had remained in the bunkers.\n\nThe Ukrainian military, with several hundred wounded among them, hold the defense of the steelworks' territory, which Russian troops are constantly firing on by all kinds of weapons and trying to storm.\n\nPresident Volodymyr Zelensky said that the Ukrainian authorities were working on diplomatic options to save the Ukrainian military stationed in the Azovstal territory.\n\nSoldiers of the Azov Regiment, the National Guard, marines, and motorized riflemen continue to defend Mariupol.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_05/thumb_files/630_360_1652198265-3864.jpeg", "eventUri": "eng-7704374", "sentiment": -0.04313725490196074, "wgt": 185, "relevance": 1, "stanza_neg": 4, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7036634879", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "11:42:00", "dateTime": "2022-05-11T11:42:00Z", "dateTimePub": "2022-05-11T11:42:00Z", "dataType": "news", "sim": 0.686274528503418, "url": "https://www.b92.net/eng/news/world.php?yyyy=2022&mm=05&dd=11&nav_id=113685", "title": "Azov Group published creepy photos from Azovstal: \"Save them\" PHOTO", "body": "Tanjug/Dmytro 'Orest' Kozatskyi/Azov Special Forces Regiment of the Ukrainian National Guard Press Office via AP\n\nFighters of the \"Azov\" group, who have been surrounded in the Azovstal ironworks for days, sent the world horrifying photos of their soldiers and the condition in which they find themselves.\n\nIn the bunkers of Azovstal, which is located in Mairupol - a city occupied by the Russians, there is a group of Ukrainian fighters, which, as the Guardian writes, was left at the mercy of the Russians. Fighters from that ironworks have been suffering attacks from the Russian army for more than two months, and now they have come to a situation where they think that every day is their last.\n\nThey are running out of food, water and ammunition, but as they say, surrender is out of the question.\n\n\"We will not surrender. Surrender means death,\" said the first man of that group in Azovstal, Svyatoslav Palamar.\n\nThey published the latest photos from Azovstal via the Telegram channel, which show the difficult conditions in which the group finds itself. They were captured underground, there are many wounded, and a series of photos that were published - was posted with a message and a request to the international community for help.\n\n\"The whole civilized world should see the conditions in which the wounded, crippled defenders of Mariupol find themselves, and react! In completely unhygienic conditions, with open wounds wrapped in non-sterile remnants of bandages, without the necessary drugs and even food!\", this group wrote on the Telegram channel.\n\n\"We call on the UN and the Red Cross to show humanity and confirm the fundamental principles on which they were created. Save the wounded! The soldiers you see in the photos and hundreds more in the Azovstal factory defended Ukraine and the entire civilized world at the cost of their own health and lives. Aren't Ukraine and the world community now able to protect them and take care of them?\", they posted with photos.\n\nThey also demanded \"immediate evacuation of wounded soldiers to the territories under the control of Ukraine\", where they could be provided with the necessary assistance.", "source": {"uri": "b92.net", "dataType": "news", "title": "B92"}, "authors": [], "image": "https://www.b92.net/news/pics/2022/05/11/1329301358627b9008649e9394162206_640x360x005710.jpg", "eventUri": "eng-7704374", "sentiment": 0.1686274509803922, "wgt": 175, "relevance": 1, "stanza_neg": 6, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7037399742", "lang": "eng", "isDuplicate": false, "date": "2022-05-11", "time": "23:50:00", "dateTime": "2022-05-11T23:50:00Z", "dateTimePub": "2022-05-11T23:47:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://nypost.com/2022/05/11/fighters-holed-up-in-mariupol-steel-plant-beg-for-help/", "title": "Ukrainian fighters holed up in Mariupol steel plant beg for injured...", "body": "Ukrainian fighters who have been holed up in Mariupol's Azovstal steel plant for weeks issued a desperate plea for help, calling on the international community to evacuate those injured in the near-constant shelling.\n\nDefenders from the Azov Regiment, a nationalist militia that is part of Ukraine's national guard, said on Telegram Wednesday that the plant had been the target of 38 air strikes in 24 hours.\n\nThe plant's defenders also said Russian troops continued to try to take the sprawling plant by force Wednesday.\n\nThe post came a day after the regiment shared photos of injured fighters, some with missing arms or legs, as they wait for help in the besieged city.\n\n\"The whole civilized world must see the conditions in which the wounded, crippled defenders of Mariupol are and act!\" the regiment wrote in a post, adding that conditions at the plant are \"completely unsanitary.\"\n\nSome of the fighters are suffering from \"open wounds dressed with non-sterile remnants of bandages, without necessary medication and even food,\" they said.\n\n\"We call on the UN and the Red Cross to show their humanity and reaffirm the basic principles on which they were created by rescuing wounded people who are no longer combatants.\"\n\nThe brigade added, \"We demand the immediate evacuation of wounded servicemen to Ukrainian-controlled territories where they will be assisted and provided with proper care.\"\n\nUkrainian human rights ombudsman Lyudmyla Denisova agreed, calling on the UN and the International Red Cross to help broker an evacuation of the wounded fighters.\n\n\"The aggressor does not give the wounded military a chance to survive,\" Denisova wrote on Telegram. \"Due to the risk of infection because of a lack of antibiotics, medical instruments and sterile dressings, doctors are forced to amputate the limbs (of the wounded) even with minor injuries.\"\n\nThe two organizations were instrumental in negotiating and affecting the evacuation of civilians from the plant over the past two weeks.\n\nThe wives of two Azov Regiment fighters left in Azovstal made a plea to Pope Francis in Vatican City.\n\n\"You are our last hope, I hope you can save their lives, please don't let them die,\" Kateryna Prokopenko, 27, told the Pope.\n\nProkopenko and Yuliya Fedosiuk, 29, met with Pope Francis for some five minutes after his regular general audience in St. Peters Square. They asked him to intervene directly with Russian President Vladimir Putin to negotiate the extraction of Mariupol's defenders to a neutral nation.\n\n\"Our soldiers are waiting to be evacuated to a third country, to lay down their arms in case of evacuation,\" Fedosiuk told reporters.\n\nThe women said they'd last spoken to their husbands on Tuesday.\n\nMeanwhile, Petro Andrushchenko an advisor to Mariupol's mayor, told citizens on Telegram that Russia was beginning to block access to Facebook, Instagram and WhatsApp within the city.\n\nHe encouraged residents to come up with \"backup channels\" to communicate with loved ones, and warned that the FSB was hacking at least one popular chat app.", "source": {"uri": "nypost.com", "dataType": "news", "title": "New York Post"}, "authors": [], "image": "https://nypost.com/wp-content/uploads/sites/2/2022/05/mariupol-comp.jpg?quality=75&strip=all&w=1024", "eventUri": "eng-7704374", "sentiment": -0.08235294117647063, "wgt": 165, "relevance": 1, "stanza_neg": 9, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7037724580", "lang": "eng", "isDuplicate": false, "date": "2022-05-12", "time": "07:00:00", "dateTime": "2022-05-12T07:00:00Z", "dateTimePub": "2022-05-12T06:47:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.standard.co.uk/news/world/ukraine-swap-russian-prisoners-hurt-mariupol-fighters-azovstal-b999526.html", "title": "Ukraine offers to swap Russian prisoners for hurt Mariupol fighters", "body": "Iryna Vereshchuk, Ukraine's deputy prime minister, said on Wednesday that her government was negotiating to have the fighters at the Azovstal steel plant released following weeks of bombardment.\n\nShe said there were a number of options but \"none of them is ideal\". Both sides have exchanged prisoners of war on numerous occasions since the invasion began on February 24.\n\nRussian forces continued to pound the plant on Wednesday with Ukraine's Azov regiment claiming they had carried out 38 airstrikes in the previous 24 hours.\n\n\"Azovstal is on fire again after the bombing. If there is hell on earth, it is there,\" Petro Andryushchenko, an aide to Mayor Vadym Boichenko, wrote on Telegram on Wednesday.\n\nUkrainian officials issued dire warnings about the fate of the last fighters in the steelworks, which the city's mayor said had turned into a \"medieval ghetto\".\n\nHuman rights ombudswoman Lyudmyla Denisova said the destruction of a makeshift hospital there meant many people were dying.\n\n\"The aggressor does not give the wounded military a chance to survive,\" she wrote on Telegram. \"Due to the risk of infection because of a lack of antibiotics, medical instruments and sterile dressings, doctors are forced to amputate the limbs (of the wounded) even with minor injuries.\"\n\nShe said there were hundreds of wounded among the more than 1,000 fighters estimated to still be in the steel works.\n\nHarrowing photos issued by the Azov forces on Telegram captured the wounded defenders as part of an appeal urging the world to act and evacuate them.\n\nThe statement urged \"the whole civilised world must see the conditions in which the wounded, crippled defenders of Mariupol are and act.\"\n\n\"We demand the immediate evacuation of wounded servicemen to Ukrainian-controlled territories, where they will be assisted and provided with proper care,\" the statement concluded.\n\nAn adviser to the Mariupol mayor, Petro Andruishchenko, said Russian forces had blocked all evacuation routes out of the city on Wednesday - shortly after a major civilian evacuation effort led by the United Nations and the Red Cross.\n\nMr Andriushchenko said some residents who have remained in the city are cooperating with the Russian occupying forces in exchange for food.", "source": {"uri": "standard.co.uk", "dataType": "news", "title": "Evening Standard"}, "authors": [{"uri": "daniel_keane@standard.co.uk", "name": "Daniel Keane", "type": "author", "isAgency": false}], "image": "https://static.standard.co.uk/2022/05/12/07/2022-05-11T171653Z_1660199261_RC2X4U94ICYJ_RTRMADP_3_UKRAINE-CRISIS-AZOVSTAL.JPG?width=1200&width=1200&auto=webp&quality=75", "eventUri": "eng-7704374", "sentiment": -0.3803921568627451, "wgt": 163, "relevance": 1, "stanza_neg": 4, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7038474077", "lang": "eng", "isDuplicate": false, "date": "2022-05-12", "time": "16:57:00", "dateTime": "2022-05-12T16:57:00Z", "dateTimePub": "2022-05-12T16:56:00Z", "dataType": "news", "sim": 0.5568627715110779, "url": "https://www.foxnews.com/world/ukrainian-fighter-mariupol-steel-plant-elon-musk-help", "title": "Ukrainian fighter in Mariupol steel plant asks Elon Musk for help", "body": "\"@elonmusk people say you come from another planet to teach people to believe in the impossible. Our planets are next to each other, as I live where it is nearly impossible to survive,\" tweeted Serhiy Volina.\n\nUN SAYS RUSSIAN FORCES IN MARIUPOL HAVE KILLED 'THOUSANDS' OF CIVILIANS, INVESTIGATIONS REMAIN ONGOING\n\n\"Help us get out of Azovstal to a mediating country. If not you, then who? Give me a hint,\" he wrote.\n\nThe marine commander also posted his appeal on Instagram, saying that addressing the Tesla CEO and SpaceX founder is a \"forced cry of [his] soul.\"\n\nIn a statement posted on a Telegram channel titled \"Azov -- Mariupol,\" they said Tuesday that the injured were living in unsanitary conditions \"with open wounds bandaged with non-sterile remnants of bandages, without the necessary medication and even food.\"\n\nUN SAYS PEACE DEAL BETWEEN RUSSIA AND UKRAINE UNLIKELY\n\nThe statement - posted with pictures - said that \"the whole civilized world must see the conditions in which the wounded, crippled defenders of Mariupol are and act.\"\n\n\"We demand the immediate evacuation of wounded servicemen to Ukrainian-controlled territories, where they will be assisted and provided with proper care,\" they said.\n\nThere are reportedly about 1,000 fighters in Azovstal's many underground tunnels.\n\nUkrainian and Russian officials had said the last remaining women, children and the elderly were evacuated from the plant earlier in the week, but confusion remained as to whether all civilians had been evacuated after two Ukrainian officials estimated Tuesday that some remained.\n\nThe seaside mill is the only part of the port city that has not been taken by Russian forces.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe U.N. says that thousands of Ukrainian civilians have been killed in Mariupol since the beginning of the war, but that the \"true scale\" of atrocities has yet to be fully uncovered.\n\nFox News' Caitlin McFall, The Associated Press and Reuters contributed to this report.", "source": {"uri": "foxnews.com", "dataType": "news", "title": "Fox News"}, "authors": [{"uri": "julia_musto@foxnews.com", "name": "Julia Musto", "type": "author", "isAgency": false}], "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/12/1024/512/ELON-MUSK-TESLA.jpg?ve=1&tl=1", "eventUri": "eng-7704374", "sentiment": -0.1215686274509804, "wgt": 142, "relevance": 1, "stanza_neg": 3, "stanza_neu": 13, "stanza_pos": 1, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]