[{"uri": "7179708530", "lang": "eng", "isDuplicate": false, "date": "2022-09-07", "time": "16:36:00", "dateTime": "2022-09-07T16:36:00Z", "dateTimePub": "2022-09-07T16:24:00Z", "dataType": "news", "sim": 0.8745098114013672, "url": "https://censor.net/en/news/3365729/afu_successfully_repelled_attacks_of_russian_invaders_near_11_settlements_general_staff", "title": "AFU successfully repelled attacks of Russian invaders near 11 settlements, - General Staff", "body": "The General Staff of the Armed Forces of Ukraine published operational information as of 6:00 p.m. on September 7 regarding the Russian invasion.\n\nAs Censor.NET informs, the summary was published on the official Facebook page of the General Staff.\n\nThe message states: \"One hundred and ninety-sixth day of heroic resistance of the Ukrainian nation to the Russian military invasion continues.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of Donetsk region, maintaining the captured districts of Kherson, part of Kharkiv, Zaporizhzhia and Mykolaiv regions.\n\nThe UAV constantly conducts aerial reconnaissance, continues to take measures to improve the logistical support of its troops.\n\nDuring the current day, the enemy launched more than 8 missile and 10 air strikes on objects on the territory of Ukraine. In particular, infrastructure was affected in the areas of Kharkiv, Tsyrkuny, Velyki Prohody, Sloviansk, Siversk, Kramatorsk, Bohoiavlenka, Kostiantynivka, Dorozhianka, Olhivske, Bilohirka, Kostromka, Sukhy Stavok, Bezimenne, Andriivka and Bila Krynytsia.\n\nThe situation has not changed on the Volyn and Polissia directions. Certain units of the armed forces of the Republic of Belarus continue to perform tasks in the border areas with Ukraine.\n\nThere is still a threat of missile and air strikes on the territory of Ukraine from the airspace and the territory of the Republic of Belarus.\n\nIn other directions, the enemy continued to attack military and civilian objects by fire, namely:\n\non the Siversk direction from mortars and rocket artillery in the areas of the settlements of Bleshnia, Hai, Senkivka of the Chernihiv region and Manukhivka, Yurieve, Mykolaivka, Khodyne, Porohony, Vovkivka, Zapsillia, Stukalyvka and Novovasylivka of the Sumy region;\n\nin the Kharkiv direction from barrel and jet artillery in the areas of Duvanka, Sosnivka, Chornohlazivka, Myronivka, Kostiantynivka, Udy, Ruska Lozova, Pytomnyk, Cherkaska Lozova, Cherkaski Tyshky, Rusky Tishky, Bazaliivka, Stary Saltiv, Kostiantynivka, and Peremoha;\n\nin the Sloviansk direction from barrel and jet artillery in the areas of the settlements of Sloviansk, Dolyna, Krasnopillia, Mazanivka, Velyka Komyshuvakha, Dmytrivka, Brazhkivka, Sulihivka and Virnopillia;\n\nin the Kramatorsk direction, shelling was recorded near Tetianivka, Kryva Luka, Ozerny, Zvanivka, Spirne, Ivano-Dariivka, Verkhniokamiansky, Vesele, and Hryhorivka;\n\nin the Bakhmut direction from mortars, barrel and jet artillery in the areas of the settlements of New York, Toretsk, Yuriivka, Oleksandropil, Zaitseve, Vesela Dolyna, Opytne, Mykolaivka Druha, Mayorsk, Odradivka, Soledar, Bakhmutske, Bakhmut, Yakovlivka, Bilohorivka, Vyimka and Rozdolivka;\n\nin the Avdiivka direction near Avdiivka, Opytne, Orlivka, Vodiane, Tonenke and Pervomaiske;\n\nin the Novopavlivskyi direction from artillery of various types in the areas of Krasnohorivka, Mariinka, Novomykhailivka, Paraskoviivka, Heorhiivka, Mykilske, Vuhledar, Volodymyrivka, Prechystivka, Zolota Nyva, Yehorivka, Petrivka, Solodke, Shevchenko, Velyka Novosilka, Novomayorske, Pavlivka, Vremivka ;\n\nin the Zaporizhzhia direction from artillery in the areas of Novoandriivka, Mali Shcherbaky, Mala Tokmachka, Shcherbaky, Nesterianka, Novodanilivka, Zaliznychne, Dorozhnianka, Chervone, Poltavka, Malynivka, Olhivske, Bilohiria, Novopil, Vremivka, Vilne Pole and Shevchenko.\n\nIn the South Bug direction, the enemy fired from barrel and rocket artillery along the contact line. In addition, the settlements of Vesely Kut, Tavriiske, Liubomirivka, Oleksandrivka, Stepova Dolyna, Blahodatne, Luch, Dniprovske, Lupareve, Shevchenkove, Myrne, Novohrihorivka, Kyselyvka, Velyke Artakove, Bila Krynytsia, Ternivka, Sukhy Stavok, Olhhyne, were also shelled by enemy artillery. Myroliubivka, Liubimivka, Petrivka, Velyka Kostromka and Ivanivka.\n\nRussian occupation forces continue to violate all norms of international humanitarian law. For example, in Kupiansk, Kharkiv region, the invaders are illegally detaining about 40 local citizens in the local police station. Local residents are forcibly evicted from the private sector of Kozatske settlement of Kherson region. Cases of placing weapons and military equipment in the courtyards of educational institutions are being recorded again.\n\nEnemy troops continue to suffer losses. In the Kherson region, near Hola Prystan, just last day, as a result of fire damage, the enemy lost about 70 people, more than half of them were killed. Near the settlement of Tavriisk, two self-propelled artillery installations \"Akatsia\" were destroyed, two more were damaged, the loss of manpower is being specified. It also became known that one of the enemy's artillery divisions operating in the Kherson direction has lost up to 60 percent of its personnel and equipment and is considered incapacitated. Due to logistics complications, the enemy units lack fuel and ammunition.\n\nUnits of the Defense Forces continue to hold their positions and prevent the enemy from advancing on the territory of Ukraine. It was possible to successfully repulse the attacks of the Russian occupiers in the areas of Pytomnyk, Ruski Tyshky, Hryhorivka, Zaitseve, Mayorsk, Mykolaivka Druha, Soledar, Bakhmutske, Bakhmut, Dolyna and Opytne settlements.\n\nDuring the day, in order to support the actions of the ground groups, the aviation of the Defense Forces carried out more than 14 strikes on strongholds and places of concentration of the enemy's manpower and equipment. Air defense units of our troops destroyed two Su-25 aircraft, one Ka-52 helicopter and two UAVs in different directions.\n\nMissile troops and artillery of our ground groups continue to perform tasks of counter-battery combat, disruption of the control system and logistical support, fire damage to the enemy's manpower and combat equipment.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/e/a/e/9/eae93f7a06475dc386840eb956e3979e/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.05882352941176472, "wgt": 223, "relevance": 1, "stanza_neg": 8, "stanza_neu": 26, "stanza_pos": 2, "swn_neg": 36, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 2, "title_swn_sent": 0}, {"uri": "7179762229", "lang": "eng", "isDuplicate": false, "date": "2022-09-07", "time": "17:26:00", "dateTime": "2022-09-07T17:26:00Z", "dateTimePub": "2022-09-07T17:25:00Z", "dataType": "news", "sim": 0.8196078538894653, "url": "https://www.ukrinform.net/rubric-ato/3566666-ukrainian-aircraft-launch-over-14-strikes-on-enemy-strongholds-on-sep-7.html", "title": "Ukrainian aircraft launch over 14 strikes on enemy strongholds on Sep 7", "body": "According to Ukrinform, the press service of the General Staff of the Armed Forces of Ukraine said this in an evening update posted to Facebook.\n\nUkraine's air defense units in various areas also destroyed two Su-25 aircraft, a Ka-52 helicopter and two UAVs, the report said.\n\n\"Today, the enemy launched more than eight missile strikes and ten air strikes on objects across Ukraine. In particular, infrastructure outside the settlements of Kharkiv, Tsyrkuny, Velyki Prokhody, Sloviansk, Siversk, Kramatorsk, Bohoiavlenka, Kostiantynivka, Dorozhnianka, Olhivske, Bilohirka, Kostromka, Sukhyi Stavok, Bezimenne, Andriivka and Bila Krynytsia was damaged,\" the General Staff said.\n\nThe situation in the Volyn and Polissia directions has not changed. Units of the Belarusian armed forces continue to perform tasks in the areas bordering Ukraine. There remains a threat of missile and air strikes on Ukrainian territory from the airspace and territory of Belarus.\n\nIn other directions, the enemy continued to fire at military and civilian objects. In the Siversk direction, the enemy used mortars and rocket artillery outside the settlements of Bleshnia, Hai, Senkivka in the Chernihiv region and Manukhivka, Yurieve, Mykolaivka, Khodyna, Porokhon, Vovkivka, Zapsillia, Stukalivka and Novovasylivka in the Sumy region.\n\nIn the Kharkiv direction, the enemy fired guns and rocket artillery outside the settlements of Duvanka, Sosnivka, Chornohlazivka, Myronivka, Kosthantynivka, Udy, Ruska Lozova, Pytomnyk, Cherkaska Lozova, Cherkaski Tyshky, Ruski Tyshky, Bazaliivka, Staryi Saltiv, Kostiantynivka, and Peremoha. In the Sloviansk area, the enemy used field and rocket artillery outside the settlements of Sloviansk, Dolyna, Krasnopillia, Mazanivka, Velyka Komyshuvakha, Dmytrivka, Brazhkivka, Sulyhivka and Virnopillia. In the Kramatorsk direction, shelling was recorded near Tetianivka, Kryva Luka, Ozerne, Zvanivka, Spirne, Ivano-Darivka, Verkhniokamianske, Vesele, and Hryhorivka.\n\nOn the Bakhmut axis, Russian invaders used mortars, howitzers and rocket artillery outside the settlements of New York, Toretsk, Yurivka, Oleksandropil, Zaitseve, Vesela Dolyna, Opytne, Mykolaivka Druha, Maiorsk, Odradivka, Soledar, Bakhmutske, Bakhmut, Yakovlivka, Bilohorivka, Vyimka and Rozdolivka. In the Avdiivka direction, shelling was recorded near Avdiivka, Opytne, Orlivka, Vodiane, Tonenke and Pervomaiske.\n\nIn the Novopavlivka direction, the enemy fired artillery of various types outside Krasnohorivka, Marinka, Novomykhailivka, Paraskoviivka, Heorhiivka, Mykilske, Vuhledar, Volodymyrivka, Prechystivka, Zolota Nyva, Yehorivka, Petrivka, Solodke, Shevchenko, Velyka Novosilka, Novomaiorske, Pavlivka, and Vremivka. In the Zaporizhzhia direction, the enemy used artillery outside the settlements of Novoandriivka, Mali Shcherbaky, Mala Tokmachka, Shcherbaky, Nesterianka, Novodanylivka, Zaliznychne, Dorozhnianka, Chervone, Poltavka, Malynivka, Olhivske, Bilohiria, Novopil, Vremivka, Vilne Pole and Shevchenko.\n\nOn the Southern Bug axis, the enemy used all types of artillery along the contact line. The settlements of Veselyi Kut, Tavriiske, Liubomyrivka, Oleksandrivka, Stepova Dolyna, Blahodatne, Luch, Dniprovske, Lupareve, Shevchenkove, Myrne, Novohryhorivka, Kyselivka, Velyke Artakove, Bila Krynytsia, Ternivka, Sukhyi Stavok, Olhyne, Myroliubivka, Liubymivka, Petrivka, Velyka Kostromka and Ivanivka all came under enemy artillery shelling.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2021_12/thumb_files/630_360_1639691213-103.jpg", "eventUri": "eng-8008252", "sentiment": -0.3960784313725491, "wgt": 209, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 3, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7180279042", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "05:07:00", "dateTime": "2022-09-08T05:07:00Z", "dateTimePub": "2022-09-08T04:31:00Z", "dataType": "news", "sim": 0.8156862854957581, "url": "https://www.ukrinform.net/rubric-ato/3566811-ukraine-army-strikes-enemy-command-post-fuel-depot-personnel-and-equipment-clusters.html", "title": "Ukraine Army strikes enemy command post, fuel depot, personnel and equipment clusters", "body": "The relevant statement was made by the General Staff of the Armed Forces of Ukraine on Facebook, an Ukrinform correspondent reports.\n\n\"The enemy continues to focus efforts on establishing full control over Donetsk Region, holding the occupied areas of Kherson Region, Kharkiv Region, Zaporizhzhia Region and Mykolaiv Region. Enemy units are constantly conducting air reconnaissance with unmanned aerial vehicles (UAVs), taking measures to improve logistical supplies,\" the report states.\n\nThe enemy has launched over 10 missile strikes and 22 air strikes on Ukrainian objects over the past day, affecting the infrastructure near such settlements as Kharkiv, Tsyrkuny, Velyki Prokhody, Sloviansk, Siversk, Kramatorsk, Ivano-Darivka, Zaitseve, Soledar, Bakhmut, Bakhmutske, Bohoiavlenka, Kostiantynivka, Vremivka, Velyka Novosilka, Prechystivka, Dorozhnianka, Trudove, Chervone, Vysokopillia, Ternovi Pody, Lozove, Olhivske, Bilohirka, Kostromka, Chervonyi Yar, Sukhyi Stavok, Bezimenne, Andriivka and Bila Krynytsia.\n\nIn the Volyn and Polissia directions, the situation remained unchanged. The threat of missile and air strikes from the territory and air space of Belarus is persisting.\n\nIn other directions, Russian troops continued to open fire on military and civilian objects.\n\nIn the Siverskyi direction, the enemy used mortars and rocket artillery to open fire near Sumy Region's Bachivsk, Ulanove and Zapsillia.\n\nIn the Kharkiv direction, with cannon and rocket artillery, Russian invaders shelled such settlements as Duvanka, Kostiantynivka, Udy, Dymentiivka, Borshchova, Velyki Prokhody, Cherkaski Tyshky, Ruski Tyshky, Bairak, Staryi Saltiv and Peremoha.\n\nIn the Sloviansk direction, Russian occupiers used cannon and rocket artillery near Dolyna, Krasnopillia, Hrushuvakha, Karnaukhivka, Nova Dmytrivka and Virnopillia.\n\nIn the Kramatorsk direction, the enemy used tanks, mortars, cannon and rocket artillery to open fire near Bohorodychne, Pryshyb, Tetianivka, Sydorove, Siversk, Spirne, Verkhniokamianske, Vesele and Hryhorivka.\n\nIn the Bakhmut direction, with mortars, cannon and rocket artillery, Russian troops shelled Novobakhmutivka, New York, Yurivka, Zaitseve, Vesela Dolyna, Maiorsk, Soledar, Bakhmutske, Bakhmut, Yakovlivka and Bilohorivka.\n\nIn the Avdiivka direction, the enemy used mortars, cannon and rocket artillery near Krasnohorivka, Avdiivka, Kamianka, Vesele, Opytne, Vodiane and Pervomaiske.\n\nIn the Novopavlivka direction, Russian invaders opened fire near Vuhledar, Prechystivka, Yehorivka, Velyka Novosilka and Novomaiorske with mortars, cannon and rocket artillery.\n\nIn the Zaporizhzhia direction, Russian occupiers used tanks, mortars, cannon and rocket artillery to open fire near Novoandriivka, Dorozhnianka, Novopil and Vremivka.\n\nIn the Southern Bug direction, the enemy shelled Stepova Dolyna, Oleksandrivka, Veselyi Kut, Tavriiske, Liubomyrivka, Blahodatne, Pervomaiske, Shevchenkove, Myrne, Novohryhorivka and Bilohirka.\n\nAccording to the General Staff, Russian troops continue to suffer losses. Ukrainian forces inflicted fire damage on enemy personnel and military equipment clusters deployed within Ukraina Agricultural Enterprise in the village of Solodkovodne, Zaporizhzhia Region. As a result, the enemy suffered significant losses, but the exact numbers are yet to be checked.\n\nUkraine's Defense Forces continue to hold their positions and prevent enemy units from advancing. Ukrainian defenders successfully repelled enemy attacks near Kostiantynivka, Dibrivne, Hryhorivka, Zaitseve, Maiorsk, Mykolaivka Druha, Pervomaiske and Kamianka.\n\nOver the past day, providing support for the ground forces, Ukrainian air forces launched more than 30 strikes on enemy strong points, personnel and equipment clusters. In different directions, the Ukrainian anti-aircraft defense units destroyed two Su-25 aircraft, two helicopters (Ka-52 and Mi-24), and five UAVs.\n\n\"The missile and artillery units of our ground forces continue to complete missions, conducting counterbattery activities, disrupting control and logistic supply systems, and striking enemy personnel and military equipment clusters. As a result of fire damage, an enemy command post, fuel depot, personnel, ammunition and military equipment clusters have been hit over the past day,\" the General Staff noted.\n\nA reminder that, since February 24, 2022, Russia's total combat losses in Ukraine have reached about 50,610 troops.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_06/thumb_files/630_360_1656600611-874.jpg", "eventUri": "eng-8008252", "sentiment": -0.3568627450980392, "wgt": 208, "relevance": 1, "stanza_neg": 9, "stanza_neu": 16, "stanza_pos": 1, "swn_neg": 26, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183831364", "lang": "eng", "isDuplicate": false, "date": "2022-09-11", "time": "06:06:00", "dateTime": "2022-09-11T06:06:00Z", "dateTimePub": "2022-09-11T06:00:00Z", "dataType": "news", "sim": 0.8117647171020508, "url": "https://censor.net/en/news/3366351/due_to_significant_losses_occupiers_plan_to_conduct_mobilization_in_temporarily_occupied_territories", "title": "Due to significant losses, occupiers plan to conduct \"mobilization\" in temporarily occupied territories, - General Staff", "body": "Due to the losses, the Russians plan to carry out the so-called \"mobilization\" of the male population in the temporarily occupied territories, men are forbidden to leave the settlements.\n\nThis is reported by Censor.NET with reference to the summary on Facebook of the General Staff of the Armed Forces of Ukraine as of 06:00 a.m. on September 11 regarding the Russian invasion.\n\nThus, the two hundredth day of the heroic resistance of the Ukrainian nation to the Russian military invasion began.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of the Donetsk region, maintaining the temporarily captured districts of the Kherson region, part of the Kharkiv region, Zaporizhzhia region, and Mykolaiv region. Conducts air reconnaissance, constantly tries to improve the tactical position, takes measures to improve the logistical support of his units, and conducts shelling of the positions of our troops along the entire contact line.\n\nA further threat of air and missile strikes remains on the entire territory of Ukraine.\n\nOver the past day, the enemy launched 16 missiles and 34 air strikes on military and civilian objects in the territory of Ukraine. 28 settlements were affected by this. In particular, Slavhorod, Velyka Pisarivka, Velyki Prohody, Avdiivka, Nevelske, Mariinka, Neskuchne, Velyka Novosilka, Dnipro, and Bruskinske.\n\nThe situation in the Volyn and Polissia directions has not changed significantly.\n\nIn other directions, the enemy fired from tanks, mortars, barrel, and rocket artillery, namely:\n\nin the Siversk direction - near Bilopillia, Lynovoe and Hrabovske, the Sumy region;\n\nin the Kharkiv direction - in the areas of Liutivka, Timofiivka, Dementiivka, Zolochiv, Sosnivka, Pytomnyk, Ruski Tyshky, Cherkaski Tyshky and Borshchova settlements;\n\nin the Slovyansk direction - in the areas of the settlements of Sloviansk, Dolyna, Krasnopillia, Velyka Komyshuvakha, Dovhenke and Dmytrivka;\n\nin the Kramatorsk direction - near Kryva Luka, Piskunivka, Sydorovo and Rozdolivka;\n\nin the Bakhmut direction - in the areas of Vesela Dolyna, Soledar, Bakhmutske, Bakhmut, Yakovlivka, Bilohorivka and Vesele settlements;\n\nin the Avdiivka direction - near Avdiivka, Opytne, Vodyane, Pervomaiske, Karlivka and Krasnohorivka;\n\nin the Novopavlivka direction - in the areas of Velyki Novosilky, Shevchenko, Vuhledar and Mariinka settlements;\n\nin the Zaporozhzhia region - near Hulyaipole, Rivnopilla, Novosilka, Vilne Pole, Chervone and Malynivka;\n\nin the South Buz direction - in the areas of Myrne, Stepova Dolyna, Bila Krynytsia, Sukhy Stavok, Liubomirivka, Bezimenne and Nova Zoria settlements.\n\nThe enemy continues to suffer losses. In the Kharkiv direction, enemy units from the 3rd Motorized Rifle Division of the 20th Combined Arms Army were left without means of support, and the personnel were in a panicked mood. It is also known about numerous sanitary losses of the enemy in the specified direction. During the previous day, more than 75 wounded Russian soldiers were brought to the village of Valuyka in the Belgorod region, while more than a hundred occupiers were evacuated from Belgorod to Moscow.\n\nDue to significant losses in manpower, the Russian invaders plan to carry out the so-called \"mobilization\" of the male population in the temporarily captured territories. Now men are forbidden to leave settlements.\n\nIn response to the successful actions of the Armed Forces of Ukraine, the Russian invaders are carrying out \"countermeasures\".\n\nIn populated areas, in the temporarily captured territories of the Kharkiv and Kherson regions, the occupiers are strengthening the administrative and police regime, entry and exit from populated areas are prohibited, and a curfew has been introduced.\n\nIn Kherson, a search was made of the residential premises of the Skhidniy microdistrict, from which the Antoniv bridge can be seen. Local residents of Kakhovka and Kozatske were warned by the Russian military to open fire on them if they approached the crossings.\n\nAt the same time, the Defense Forces repelled enemy attacks in the areas of Sosnivka, Mayorsk, Mykolaivka Druha, Zaitseve, Vesela Dolyna, Soledar, Bakhmut, Pisky, Pervomaiske, and Novomykhailivka settlements.\n\nThe de-occupation of Ukraine continues. In general, in recent days, about two thousand square kilometers of Ukrainian territory have been freed from Russian occupation. Our units entered Kupyansk, the liberation of settlements of Kupiansk and Izium districts of the Kharkiv region is ongoing.\n\nDuring the day, in order to support the actions of the ground groups, the aviation of the Defense Forces carried out 23 strikes, during which four anti-aircraft missile systems were destroyed, four strongholds, and fifteen places where the enemy's manpower and equipment were concentrated were hit. In addition, our air defense units destroyed two aircraft (Su-25 and Su-34), one Ka-52 helicopter, two UAVs, and one guided air missile.\n\nMissile troops and artillery of ground troops continue to perform tasks of counter-battery combat, fire damage to manpower and combat equipment, disruption of the enemy's control system, and logistical support. As a result of the fire, two control points of unmanned aircraft, strongholds, accumulations of weapons, and military equipment of the enemy in the concentration areas were hit during the day. A pontoon crossing and enemy watercraft with military equipment on them also fell into the affected area.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1.censor.net/images/a/a/e/9/aae96437f069c6ca583ae701ab515d9f/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.1372549019607843, "wgt": 207, "relevance": 1, "stanza_neg": 9, "stanza_neu": 30, "stanza_pos": 0, "swn_neg": 39, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7180335728", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "06:12:00", "dateTime": "2022-09-08T06:12:00Z", "dateTimePub": "2022-09-08T06:02:00Z", "dataType": "news", "sim": 0.8117647171020508, "url": "https://censor.net/en/news/3365791/ukrainian_soldiers_successfully_repelled_enemy_attacks_in_area_of_8_settlements_enemy_suffered_significant", "title": "Ukrainian soldiers successfully repelled enemy attacks in area of 8 settlements. Enemy suffered significant losses as result of attack on village of Solodkovodne, - General Staff", "body": "The one hundred and ninety-seventh day of the heroic resistance of the Ukrainian nation to the Russian military invasion has begun. The enemy continues to focus its efforts on establishing full control over the territory of the Donetsk region, maintaining the captured districts of Kherson, part of Kharkiv, Zaporizhzhia, and Mykolaiv regions.\n\nThis is reported by Censor.NET with reference to the press center of the General Staff of the Armed Forces of Ukraine.\n\nAs noted, the enemy constantly conducts aerial reconnaissance by UAVs, continues to take measures to improve the logistical support of its troops.\n\n\"During the past day, the enemy launched more than 10 missiles and 22 air strikes on objects on the territory of Ukraine. In particular, infrastructure was damaged in the areas of the settlements of Kharkiv, Tsyrkuny, Velyki Prohody, Sloviansk, Siversk, Kramatorsk, Ivano-Dariivka, Zaytseve, Soledar, Bakhmut, Bakhmutske, Bohoiavlenka, Kostiantynivka, Vremivka, Velyka Novosilka, Prechistivka, Dorozhnianka, Trudove, Chervone, Vysokopilla, Ternovi Pody, Lozove, Olhivske, Bilohirka, Kostromka, Chervony Yar, Suhy Stavok, Bezimenne, Andriivka and Bila Krynytsia \", the message says.\n\nThe situation has not changed in the Volyn and Polissia directions. The threat of missile and air strikes on the territory of Ukraine from the airspace and the territory of the Republic of Belarus remains.\n\nAccording to the General Staff, in other directions the enemy continued to attack military and civilian objects by fire, namely:\n\non the Siversk direction from mortars and rocket artillery in the areas of settlements of Bachivsk, Ulanove, and Zapsilia of the Sumy region;\n\nin the Kharkiv direction from barrel and jet artillery in the areas of Duvanka, Kostiantynivka, Udy, Dymentiivka, Borshchova, Velyki Prohody, Cherkasski Tyshky, Ruski Tyshky, Bayrak, Stary Saltiv and Peremoha;\n\nin the Sloviansk direction from barrel and rocket artillery in the areas of Dolyna, Krasnopillia, Hrushuvaha, Karnaukhivka, Nova Dmytrivka, Virnopillya settlements;\n\nin the Kramatorsk direction from tanks, mortars, barrel and jet artillery in the areas of the settlements of Bohorodychne, Pryshyb, Tetianivka, Sydorove, Siversk, Spirne, Verkhniokamianske, Vesele, and Hryhorivka;\n\nin the Bakhmut direction from mortars, barrel, and jet artillery in the areas of Novobakhmutivka, New York, Yuriivka, Zaytseve, Vesela Dolyna, Mayorsk, Soledar, Bakhmutske, Bakhmut, Yakovlivka, and Bilohorivka settlements;\n\nin the Avdiivka direction from mortars, barrel, and jet artillery in the areas of Krasnohorivka, Avdiivka, Kamianka, Vesele, Opytne, Vodiane, and Pervomaiske settlements;\n\nin the Novopavlovsk direction from mortars, barrel and jet artillery near Vuhledar, Prechistivka, Yehorivka, Velyka Novosilka and Novomayorske;\n\nin the Zaporizhzhia direction from tanks, mortars, barrel, and jet artillery in the areas of settlements of Novoandriivka, Dorozhnianka, Novopil, and Vremivka.\n\nIn the South Buh region, the settlements of Stepova Dolyna, Oleksandrivka, Vesely Kut, Tavriyske, Liubomirivka, Blahodatne, Pervomaiske, Shevchenkove, Myrne, Novohrihorivka, and Bilohirka came under fire.\n\n\"Enemy troops continue to suffer losses. As a result of the fire impact on the concentration of personnel and military equipment of the enemy, which were on the territory of the agricultural enterprise \"Ukraine\" in the village of Solodkovodne, Zaporizhzhia region, the enemy suffered significant losses, the number is being specified,\" the message says.\n\nUnits of the Defense Forces hold their positions and prevent the enemy from advancing. Our soldiers successfully repelled enemy attacks in the areas of Kostiantynivka, Dibrivne, Hryhorivka, Zaytseve, Mayorsk, Mykolaivka Druha, Pervomaiske, and Kamianka.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1.censor.net/images/1/3/1/a/131a6d434fd021222d472de512e9d486/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.2549019607843137, "wgt": 207, "relevance": 1, "stanza_neg": 3, "stanza_neu": 18, "stanza_pos": 2, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183429017", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "16:58:00", "dateTime": "2022-09-10T16:58:00Z", "dateTimePub": "2022-09-10T16:58:00Z", "dataType": "news", "sim": 0.8039215803146362, "url": "https://censor.net/en/news/3366312/afu_successfully_repelled_attempts_of_russian_assaults_near_9_settlements_general_staff", "title": "AFU successfully repelled attempts of Russian assaults near 9 settlements, - General Staff", "body": "The General Staff of the Armed Forces published operational information regarding the Russian invasion as of 6:00 on September 10.\n\nAs Censor.NET informs, this was reported on the official Facebook page of the General Staff of the Armed Forces of Ukraine.\n\nThe message states: \"Glory to Ukraine! The one hundred and ninety-ninth day of the heroic resistance of the Ukrainian nation to the Russian military invasion continues.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of the Donetsk region, maintaining the captured territories and disrupting the offensive of our troops in certain directions.\n\nThe enemy conducts aerial reconnaissance, continues to fire at the positions of our units, takes measures to restore the lost position, and moves his troops for this purpose. The threat of air and missile strikes remains throughout the territory of Ukraine.\n\nDuring the day, the Russian occupiers launched 9 missiles and 10 air strikes on military and civilian objects of our State. In particular, the settlements of Slavhorod, Velyka Pysarivka, Velyki Prohody, Avdiivka, Siversk, Kostiantynivka, Bakhmut, Nevelske, Mariinka, Velyka Novosilka, Dnipro, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaky, Mykolaiv, Bilohiria, Sukhy Stavok, and Bruskinske were affected by enemy strikes\n\nIn the Volyn and Polissia directions, the situation has not changed significantly. In order to maintain the troops of the Armed Forces of the Republic of Belarus in combat readiness, the training period has been extended once again.\n\nIn other directions, the enemy fired at military and civilian infrastructure from tanks, combat vehicles, mortars, barrel and rocket artillery, namely:\n\nin the Siversky direction - near Bilopillia and Lynove of the Sumy region;\n\nin the Kharkiv direction - in the areas of Liutivka, Tymofiivka, Dementiivka, Prudianka, Zolochiv, Sosnivka, Duvanka, Udy, Kostiantynivka, Peremoha, Velyki Prokhody, Borshcheva and Zamulivka settlements;\n\nin the Sloviansk direction - in the areas of the settlements of Sloviansk, Dolyna, Krasnopillia, Mykilske, Velyka Komyshuvakha, Dibrivne, Karnaukhivka, Dovhenke and Dmytrivka;\n\nin the Kramatorsk direction - in the areas of Serebrianka, Kryva Luka, Rai-Olexandrivka, Piskunivka, Sydorivka, Siversk, Ivano-Dariivka, Rozdolivka and Spirne settlements;\n\nin the Bakhmut direction - in the areas of Zaitseve, Mykolaivka Druha, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut, Bilohorivka, and Vesele settlements;\n\nin the Avdiivka direction - near Krasnohorivka, Avdiivka, Opytne, Vodiane, Karlivka and Pervomaiske;\n\nin the Novopavlivsky direction - near Mariinka, Novomykhailivka, Mykilsky, Vuhledar, Shevchenko, Velyka Novosilka, Bohoiavlenka, Neskuchne and Vremivka;\n\nin the Zaporizhzhia region - in the areas of Novoandriivka, Huliaipole, Charivne, Rivnopillia, Novosilka, Vilne Pole, Chervone, Malynivka, Orihiv, Novopil and Vremivka settlements;\n\nin the South Bug direction - in the areas of Stepova Dolyna, Oleksandrivka, Myrne, Liubomirivka, Kyselivka, Vesely Kut, Velyke Artakove, Blahodativka and Visokopillia settlements. In total, more than twenty settlements were hit by artillery fire in this direction.\n\nThe enemy continues to suffer losses. In particular, as a result of the actions of the Defense Forces in the South Bug region, the losses of units of the 106th Airborne Division of the Armed Forces of the Russian Federation in the previous day alone amounted to more than 58 people killed. The command of the occupying forces is carrying out measures to restore the combat capability of units of the 1st Army Corps by transferring personnel who survived the hostilities to other units. Thus, according to available information, the remnants of personnel from the so-called special purpose battalion \"Khan\" have been transferred to the 9th Marine Regiment.\n\nThe number of self-harms has increased among personnel arriving in Ukraine for reinforcements. The Russian leadership is constantly looking for new sources of replenishment of reserves. Promising a high salary and a social package, it tries to recruit \"volunteers\" among retired military personnel in the Kyrgyz Republic through social media groups.\n\nIn connection with the approach of units of the Defense Forces, the command of the Russian occupying forces in the Kherson region is trying to strengthen the city of Kherson by moving reserves. Thus, in the regional center, new units of the enemy are recorded, whose servicemen are poorly oriented in the city.\n\nThe invaders are trying to carry out work on the restoration of traffic across the Kakhovska HPP bridge, the section of which is under the fire control of the Armed Forces of Ukraine. In Nova Kakhovka, the invaders intensified filtering measures with the participation of FSB officers of Russia - they check mobile devices, look for citizens who help the Armed Forces of Ukraine. The situation is similar in Enerhodar, Zaporizhzhia region.\n\nDefense forces successfully repelled enemy offensives in the areas of Sosnivka, Mayorsk, Mykolayivka Druha, Zaitseve, Vesela Dolyna, Bakhmut, Pervomaiske and Novomykhailivka settlements.\n\nThe liberation of settlements that were temporarily captured by the Russian occupiers in the Kharkiv region and in the South Bug region continues. For the safety of our servicemen, official information will be provided later.\n\nDuring the day, in order to support the actions of the ground groups, the Air Force of the Defense Forces carried out more than 17 strikes on strongholds and places where the enemy's manpower and equipment are concentrated, as well as ammunition warehouses. Air defense units destroyed the UAV and shot down the Kh-59 air missile in the airspace of the Dnipropetrovsk region.\n\nMissile troops and artillery of ground troops continue to perform tasks of counter-battery combat, fire damage to control points, manpower and combat equipment, disruption of the enemy's control system and logistical support.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/e/a/e/9/eae93f7a06475dc386840eb956e3979e/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.2313725490196078, "wgt": 205, "relevance": 1, "stanza_neg": 9, "stanza_neu": 29, "stanza_pos": 2, "swn_neg": 40, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 2, "title_swn_sent": 0}, {"uri": "7182939106", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "06:32:00", "dateTime": "2022-09-10T06:32:00Z", "dateTimePub": "2022-09-10T06:26:00Z", "dataType": "news", "sim": 0.7882353067398071, "url": "https://censor.net/en/news/3366216/to_strengthen_russian_group_unit_of_kadyrovs_military_with_number_of_up_to_1300_people_arrived_in_occupied", "title": "To strengthen Russian group, unit of Kadyrov's military with number of up to 1,300 people arrived in occupied Kherson region, - General Staff", "body": "A unit of Kadyrov's military numbering up to 1,300 people was sent to the occupied Kherson region.\n\nThis is reported by Censor.NET with reference to the summary on Facebook of the General Staff of the Armed Forces of Ukraine as of 06:00 a.m. on September 10 regarding the Russian invasion.\n\nThus, the one hundred and ninety-ninth day of the heroic resistance of the Ukrainian nation to the Russian military invasion has begun.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of the Donetsk region, maintaining the temporarily captured districts of the Kherson region, part of the Kharkiv region, Zaporizhzhia region, and Mykolaiv region.\n\nThe enemy conducts aerial reconnaissance with high intensity, continues to take measures to improve the logistical support of its troops. A further threat of air and missile strikes remains on the entire territory of Ukraine.\n\nOver the past 24 hours, the enemy has launched 13 missiles and 23 air strikes on objects in the territory of Ukraine. In particular, infrastructure was affected in the areas of Velyki Prokhody, Avdiivka, Nevelske, Mariinka, Velyka Novosilka, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaky, Bilohiria, Ternovi Pody, Blahodatne, Suhy Stavok, Kostromka, and Bezimenne settlements.\n\nThe situation in the Volyn and Polissia directions has not changed significantly.\n\nIn the Siversk direction, the enemy carried out airstrikes on civilian and military infrastructure in the areas of Slavhorod and Velyka Pysarivka settlements of the Sumy region.\n\nIn other directions, the Russian occupiers shelled military and civilian infrastructure with tanks, combat vehicles, barrel, and rocket artillery:\n\nin the Kharkiv direction - in the areas of the settlements of Dmytrivka, Prudianka, Zolochiv, Sosnivka, Duvanka, Udy, Lyptsi, Peremoha, Momotove, Borshchova;\n\nin the Sloviansk direction - in the areas of the settlements of Sloviansk, Dolyna, Krasnopillia, Velyka Komyshuvakha, Mykilske, Dibrivne;\n\nin the Kramatorsk direction - near Serebrianka, Kryva Luka, Sydorovo, Hryhorivka, Ivano-Dariivka and Spirne;\n\nin the Bakhmut direction - in the areas of Zaitseve, Mykolaivka Druha, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut and Yakovlivka settlements;\n\nKrasnohorivka, Avdiivka, Opytne, Vodiane, Karlivka, and Pervomaiske were shelled by mortars and barrel artillery in the Avdiivka direction;\n\nin the Novopavlivka direction - in the areas of Mariinka, Novomykhailivka, Mykilske, Vuhledar, Shevchenko, Velyka Novosilka, Bohoiavlenka, Neskuchne, Vremivka;\n\nin the Zaporizhzhia region in the areas of settlements of Novoandriivka, Huliaipole, Charivne, Novosilka, Shcherbaki, Vilne Pole, Malynivka, Orihiv, Novopil.\n\nIn the South Buh direction, the enemy continued shelling along the contact line.\n\nIn addition, the enemy conducted aerial reconnaissance using UAVs - 36 sorties were recorded.\n\nTo strengthen the Russian group in the temporarily occupied territories of the Kherson region, a unit of Kadyrov's military, numbering up to 1,300 people, formed according to national characteristics, arrived.\n\nDefense forces successfully repelled enemy attacks in the areas of Zaitseve, Vesela Dolyna, Soledar, Bakhmut, and Pervomaiske settlements.\n\nIn general, in recent days, more than a thousand square kilometers of Ukrainian territory have been liberated from the occupiers. In some directions, units of the Defense Forces wedged themselves into the enemy's defenses to a depth of up to 50 km. More than thirty settlements that were temporarily occupied by the Russian invaders in the Kharkiv region were liberated or taken under control.\n\nDuring the day, in order to support the actions of the ground groups, the Air Force of the Defense Forces carried out 33 strikes - an ammunition depot was destroyed, damage was inflicted on almost 25 strongholds, and places where manpower and equipment were concentrated.\n\nAir defense units of our troops destroyed two UAVs and one guided air missile in different directions.\n\nOver the past 24 hours, as a result of the fire of rocket forces and artillery of our ground troops, eighteen control points of various levels, areas of concentration of enemy manpower, means of anti-aircraft defense and electronic warfare, artillery units and more than twenty warehouses with ammunition and fuel and lubricants were damaged.\n\nMeanwhile, de-occupied communities are returning to life in the liberated territories. Demining of the area is underway. Units of the National Guard of Ukraine are conducting stabilization measures. The work of the National Police has been resumed.\n\nThe police are recording numerous crimes committed by the enemy on Ukrainian soil, and are ready to counter provocations and the infiltration of subversive and intelligence groups. The local population is immediately provided with all possible help, because the occupiers left behind destroyed infrastructure, destroyed houses of civilians, and heaps of scrap metal.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/0/7/2/1/072191b5a597ea3eb19eb9a3f81a2eed/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.1764705882352942, "wgt": 201, "relevance": 1, "stanza_neg": 6, "stanza_neu": 27, "stanza_pos": 2, "swn_neg": 35, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183461802", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "17:46:00", "dateTime": "2022-09-10T17:46:00Z", "dateTimePub": "2022-09-10T17:38:00Z", "dataType": "news", "sim": 0.7882353067398071, "url": "https://www.ukrinform.net/rubric-ato/3568698-liberation-of-settlements-in-kharkiv-region-continues-general-staff.html", "title": "Liberation of settlements in Kharkiv region continues - General Staff", "body": "The Armed Forces of Ukraine struck two Russian control points and eight areas of concertation of enemy manpower and military equipment, the liberation of settlements in the Kharkiv and in the Southern Buh directions continues. In Kherson, the enemy is attempting to increase its presence by moving reserves.\n\nThe General Staff of the Armed Forces of Ukraine said this in its latest operational update posted on Facebook, Ukrinform reports.\n\nThus, according to the General Staff, as of 18:00 on September 10, the Russian troops continue to focus their efforts on establishing full control over the territory of Donetsk region, maintaining the captured territories and disrupting the offensive of the Armed Forces of Ukraine in certain directions.\n\nThe enemy conducts aerial reconnaissance, continues to fire at the positions of Ukrainian units, takes measures to restore the lost position, and moves its troops for this purpose. The threat of air and missile strikes remains on the entire territory of Ukraine.\n\nDuring the day, the invaders launched 9 missile and 10 air strikes on military and civilian facilities of Ukraine. In particular, Slavhorod, Velyka Pysarivka, Velyki Prohody, Avdiivka, Siversk, Kostyantynivka, Bakhmut, Nevelske, Maryinka, Velyka Novosilka, Dnipro, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaky, Mykolaiv, Bilohirya, Sukhyi Stavok, an Bruskinske came under enemy fire.\n\nIn the Volyn and Polissia directions, the situation has not changed significantly. According to the General Staff, in order to maintain the troops of Belarus in combat readiness, military exercises were extended.\n\nIn other directions, the enemy struck military and civilian infrastructure using tanks, combat vehicles, mortars, barrel and jet artillery.\n\nIn the Siverskyi direction, the invaders struck near Bilopillia and Linove of Sumy region, in the Kharkiv direction -- in the areas of Liutivka, Tymofiivka, Dementiivka, Prudianka, Zolochiv, Sosnivka, Duvanka, Udy, Kostiantynivka, Peremoha, Velyki Prokhody, Borshchova, and Zamulivka.\n\nIn the Sloviansk direction, Russian troops shelled the areas of Sloviansk, Dolyna, Krasnopillia, Mykilske, Velyka Komyshuvaha, Dibrivne, Karnaukhivka, Dovhenke, and Dmytrivka.\n\nIn the Kramatorsk direction, the districts of Serebrianka, Kryva Luka, Rai-Oleksandrivka, Pyskunivka, Sydorove, Siversk, Ivano-Daryivka, Rozdolivka, and Spirne came under enemy fire, in the Bakhmut direction -- the districts of Zaitseve, Mykolaivka Druha, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut, Bilohorivka and Vesele.\n\nIn the Avdiivka direction, Russian troops struck near Krasnohorivka, Avdiivka, Opytne, Vodiane, Karlivka, and Pervomaiske; in the Novopavlivka direction - near Maryinka, Novomykhailivka, Mykilske, Vuhledar, Shevchenko, Velyka Novosilka, Bohoiavlenka, Neskuchne, and Vremivka.\n\nIn the Zaporizhzhia direction, the enemy hit the districts of Novoandriivka, Huliaipole, Charivne, Rivnopillia, Novosilka, Vilne Pole, Chervone, Malynivka, Orikhiv, Novopil and Vremivka.\n\nIn the Southern Buh direction, the invaders shelled the areas of Stepova Dolyna, Oleksandrivka, Myrne, Liubomyrivka, Kyselivka, Veselyi Kut, Velyke Artakove, Blahodativka, and Vysokopillia. In total, more than 12 settlements came under artillery fire in this direction.\n\nAs reported, the Armed Forces of Ukraine eliminated about 52,250 Russian invaders between February 24 and September 10.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://www.ukrinform.net/img/img_none.jpg", "eventUri": "eng-8008252", "sentiment": -0.3568627450980392, "wgt": 201, "relevance": 1, "stanza_neg": 2, "stanza_neu": 16, "stanza_pos": 1, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7181703778", "lang": "eng", "isDuplicate": false, "date": "2022-09-09", "time": "06:04:00", "dateTime": "2022-09-09T06:04:00Z", "dateTimePub": "2022-09-09T06:00:00Z", "dataType": "news", "sim": 0.7607843279838562, "url": "https://censor.net/en/news/3366002/in_3_days_afu_advanced_almost_50_km_in_kharkiv_region_general_staff", "title": "In 3 days, AFU advanced almost 50 km in Kharkiv region, - General Staff", "body": "In the Kharkiv direction, the Ukrainian military is conducting a successful counteroffensive, advancing almost 50 km in 3 days.\n\nThis is reported by Censor.NET with reference to the summary on Facebook of the General Staff of the Armed Forces of Ukraine as of 6:00 a.m. on September 9 regarding the Russian invasion.\n\nThus, the one hundred and ninety-eighth day of the heroic resistance of the Ukrainian nation to the Russian military invasion has begun.\n\nThe enemy concentrated its efforts on establishing full control over the territory of the Donetsk region, maintaining the temporarily captured districts of Kherson, part of Kharkiv, Zaporizhzhia, and Mykolaiv regions. Constantly conducts UAV aerial reconnaissance, continues to take measures to improve the logistical support of its troops.\n\nOver the past 24 hours, the enemy has carried out 45 air and 5 missile strikes, in particular on the settlements of Kostiantynivka, Tsyrkuny, Radushne, and Kharkiv. There are victims among the civilian population.\n\nIn the Volyn and Polissia directions, on the territory of Belarus, military exercises have begun, during which it is planned to work out the issue of \"liberation of captured territories\". The threat of missile and air strikes on the territory of Ukraine from the Republic of Belarus remains.\n\nIn the Siversk direction, the intensity of shelling by the enemy has significantly decreased. In other directions, the enemy continued to attack military and civilian objects of Ukraine, namely:\n\nin the Kharkiv direction, from barrel and jet artillery, in the areas of the settlements of Udy, Sosnivka, Duvanka, Tsupivka, Prudianka, Dementiivka, Velyki Prohody, Pytomnyk, Ruski Tyshky, Petrivka, Peremoha, Bayrak, and Kostiantynivka;\n\nin the Sloviansk direction - near Dolyna, Krasnopillia, Sloviansk and Mykilske;\n\nin the Kramatorsk direction - in the areas of the settlements of Bohorodychne, Novomykolaivka, Serebrianka, Siversk, Verkhniokamianske, Ivano-Dariivka, Spirne, Rozdolivka and Hryhorivka;\n\nin the direction of Bakhmut - near Yakovlivka, Soledar, Bakhmutske, Bakhmut, Vesela Dolyna, Zaytsevo, New York and Vesele;\n\nin the Avdiivka direction - in Kamianka, Avdiivka, Pervomaiske, Vodiane and Opytne districts;\n\nin the Novopavlivka direction - near Mariinka, Paraskoviivka, Novomykhailivka, Velyka Novosilka, Novoukrainka, Prechystivka and Mykilske;\n\nin the Zaporizhzhia region - in the areas of the settlements of Novopil, Vremivka, Poltavka, Zaliznychne, Chervone, Novoandriivka and Orihiv;\n\nin the South Buh direction - in the areas of Arkhanhelske, Novovoznesensk, Myroliubivka, Novovoskresenske, Bilohirka, Novohrihorivka, Shevchenkove, Liubomyrivka, Ternovi Pody, Stepova Dolyna, Myrne, Olhine, Oleksandrivka and Tavriyske settlements.\n\nIn connection with the offensive of our troops, in some areas of the Kherson region, units of the armed forces of the Russian Federation are switching to tactics of terrorist actions against local civilians. Thus, according to available information, in the settlement of Velyka Oleksandrivka, the occupiers are using the local population as a \"human shield\". The village is closed for entry and exit.\n\nUnits of the Defense Forces heroically hold their positions and prevent the enemy from advancing. Our defenders successfully repelled the enemy's offensive in the areas of Udy, Kostiantynivka, Virnopillia, Ploske, Mayorsk, Bezimenne, and Kamianka.\n\nDefense forces are conducting a successful counteroffensive in the Kharkiv direction. Thanks to skillful and coordinated actions, the Armed Forces of Ukraine, with the support of the local population, advanced almost 50 km in 3 days.\n\nAccording to intelligence, some enemy units suffered significant losses. The occupiers are trying to evacuate wounded personnel and damaged military equipment to the areas of Vilkhuvatka and Borodoyarske settlements.\n\nPersonnel of the occupying forces in civilian clothes resort to desertion and try to return to the territory of the Russian Federation. So, during the day, more than 15 such cases were noted.\n\nMissile troops and artillery of our ground groups continue to perform tasks of counter-battery combat, disruption of the control system and logistical support, damage to the enemy's manpower and combat equipment.\n\nDuring the past day, in order to support the actions of ground groups, the Air Force of the Defense Forces carried out more than 20 strikes, 2 platoon strongholds, 15 areas of concentration of manpower and military equipment, and 3 anti-aircraft missile systems were hit. 4 UAVs and a Ka-52 helicopter were destroyed. Enemy manpower losses are specified.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/8/c/4/a/8c4a7b93d567cc727aeb03dd7ebf6354/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.0980392156862745, "wgt": 194, "relevance": 1, "stanza_neg": 7, "stanza_neu": 26, "stanza_pos": 2, "swn_neg": 35, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183799556", "lang": "eng", "isDuplicate": false, "date": "2022-09-11", "time": "05:13:00", "dateTime": "2022-09-11T05:13:00Z", "dateTimePub": "2022-09-11T05:12:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://www.ukrinform.net/rubric-ato/3568842-armed-forces-of-ukraine-enter-kupyansk-liberation-in-two-districts-of-kharkiv-region-ongoing.html", "title": "Armed Forces of Ukraine enter Kupyansk, liberation in two districts of Kharkiv region ongoing", "body": "The Ukrainian units entered Kupyansk, the liberation of localities of Kupyansk and Izium districts of Kharkiv region continues.\n\nThis is stated in the report of the General Staff of the Armed Forces of Ukraine as of 06:00, September 11, published on Facebook.\n\nOver the past 24 hours, the enemy launched 16 missile strikes and 34 airstrikes on military and civilian objects in the territory of Ukraine. Twenty-eight localities were hit: Slavhorod, Velyka Pysarivka, Velyki Prokhody, Avdiivka, Nevelske, Marinka, Neskuchne, Velyka Novosilka, Dnipro, Bruskinske, and other.\n\nThe situation in Volyn and Polissia directions has not changed significantly.\n\nIn other directions, the enemy opened fire from tanks, mortars, tube and rocket artillery, namely:\n\nIn Siversky direction - near Bilopillia, Lynove, and Hrabovske of Sumy region;\n\nIn Kharkiv direction - in the areas of Liutivka, Tymofiyivka, Dementiyivka, Zolochiv, Sosnivka, Pytomnyk, Ruski Tyshky, Cherkaski Tyshky, and Borshchova;\n\nin Slovyansk direction - in the areas of Slovyansk, Dolyna, Krasnopillia, Velyka Komyshuvakha, Dovhenke, and Dmytrivka;\n\nIn Kramatorsk direction - near Kryva Luka, Pyskunivka, Sydorove, and Rozdolivka;\n\nIn Bakhmut direction - in the areas of Vesela Dolyna, Soledar, Bakhmutske, Bakhmut, Yakovlivka, Bilohorivka and Vesele;\n\nIn Avdiivka direction - near Avdiivka, Opytne, Vodiane, Pervomaiske, Karlivka, and Krasnohorivka;\n\nIn Novopavlivka direction - in the areas of Velyki Novosilky, Shevchenko, Vuhledar, and Marinka;\n\nIn Zaporizhzhia direction - near Huliaypole, Rivnopillia, Novosilky, Vilne Pole, Chervone, and Malynivka;\n\nIn Southern Buh direction - in the areas of Myrne, Stepova Dolyna, Bila Krynytsia, Sukhyi Stavok, Liubomyrivka, Bezimenne, and Nova Zoria.\n\nIt is noted that the enemy continues to suffer losses. In Kharkiv direction, enemy units from the 3rd motorized rifle division of the 20th combined arms army were left without means of support, the personnel were in panic. Also, it is known about numerous sanitary losses of the enemy in the indicated direction. Over the past day, more than 75 wounded Russian soldiers were delivered to the village of Valuyky in Belgorod region, while more than 100 occupiers were evacuated from Belgorod to Moscow.\n\nDue to significant manpower losses, the Russian invaders plan to carry out the so-called \"mobilization\" of the male population in the temporarily captured territories. Now men are forbidden to leave settlements.\n\nIn response to the successful actions of the Armed Forces of Ukraine, the Russian invaders take \"countermeasures\". In populated localities, in the temporarily captured territories of Kharkiv and Kherson regions, the occupiers tighten the administrative and police regime, it is banned to enter or leave localities, a curfew was set. In Kherson city, the houses of Skhidnyi neighborhood, from which the Antonivka Bridge is seen, are searched. The Russian military warned the residents of Kakhovka and Kozatske that they would shoot them if they approached the crossings.\n\nAt the same time, the Defense Forces of Ukraine repelled enemy attacks in the areas of Sosnivka, Mayorsk, Mykolaivka Druha, Zaitseve, Vesela Dolyna, Soledar, Bakhmut, Pisky, Pervomaiske, and Novomykhailivka.\n\nThe de-occupation of Ukraine continues. In general, in recent days, about 2,000 square kilometers of Ukrainian territory have been freed from Russian occupation. The Ukrainian units entered Kupyansk, the liberation of localities of Kupyansk and Izium districts of Kharkiv region continues.\n\nOver the past day, to support the actions of the ground groups, the aviation of the Defense Forces launched 23 strikes, during which four anti-aircraft missile systems were destroyed, four strongholds and 15 enemy's manpower and equipment clusters were hit. In addition, the Ukrainian air defense units destroyed two aircraft (Su-25 and Su-34), one Ka-52 helicopter, two UAVs, and one guided missile.\n\nThe missile troops and artillery of ground troops continue to perform counter-battery combat tasks, hit enemy manpower and equipment, disrupt enemy control systems and logistical support. In particular, two enemy control points of unmanned aircraft, strongholds, weapon and military equipment clusters were hit. A pontoon crossing and enemy watercraft with military equipment were also struck.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of Donetsk region, holding the temporarily captured districts of Kherson region, part of Kharkiv region, Zaporizhzhia region, and Mykolaiv region. The enemy conducts aerial reconnaissance, constantly tries to improve the tactical position, takes measures to improve the logistical support of its units, and shells the Ukrainian positions along the entire contact line.\n\nThere is still a threat of air and missile strikes on the territory of Ukraine.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1659293500-979.jpg", "eventUri": "eng-8008252", "sentiment": -0.2313725490196078, "wgt": 192, "relevance": 1, "stanza_neg": 8, "stanza_neu": 28, "stanza_pos": 1, "swn_neg": 37, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7180090507", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "00:15:00", "dateTime": "2022-09-08T00:15:00Z", "dateTimePub": "2022-09-08T00:15:00Z", "dataType": "news", "sim": 0.7490196228027344, "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2022-09-07.htm", "title": "\nUkraine", "body": "A number of claims and counterclaims are being made on the Ukraine-Russia conflict on the ground and online. While GlobalSecurity.org takes utmost care to accurately report this news story, we cannot independently verify the authenticity of all statements, photos and videos.\n\nOn 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War. Russian President Vladimir Putin announced a \"special military operation\" (SVO - spetsialnaya voennaya operatsiya) in Ukraine in response to the appeal of the leaders of the \"Donbass republics\" for help. That attack is a blatant violation of the territorial integrity, sovereignty and independence of Ukraine. Putin stressed that Moscow's goal is the demilitarization and denazification of the country. The military buildup in preceeding months makes it obvious that the unprovoked and dastardly Russian attack was deliberately planned long in advance. During the intervening time, the Russian government had deliberately sought to deceive the world by false statements and expressions of hope for continued peace.\n\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\" [Judgment of the International Military Tribunal]\n\nThe UK Ministry of Defence reported that, over the last 24 hours, heavy fighting has taken place on three fronts: in the north, near Kharkiv; in the east in the Donbas; and in the south in Kherson Oblast. Russia's planned main effort is probably an advance on Bakhmut in the Donbas, but commanders face a dilemma of whether to deploy operational reserves to support this offensive, or to defend against continued Ukrainian advances in the south.\n\nMultiple concurrent threats spread across 500km will test Russia's ability to coordinate operational design and reallocate resources across multiple groupings of forces.\n\nEarlier in the war, Russia's failure to do this was one of the underlying reasons for the military's poor performance.\n\nThe General Staff of the Armed Forces of Ukraine reported that Russia continues to focus its efforts on establishing full control over the territory of Donetsk oblast, maintaining the captured districts of Kherson, part of Kharkiv, Zaporizhzhya and Mykolaiv oblasts. The UAVs constantly conducts aerial reconnaissance, continues to take measures to improve the logistical support of its troops. During the current day, Russian forces launched more than 8 missile and 10 air strikes on objects on the territory of Ukraine. In particular, infrastructure was affected in the areas of Kharkiv, Tsyrkuny, Velyki Prohody, Slovyansk, Siversk, Kramatorsk, Bohoyavlenka, Kostyantynivka, Dorozhyanka, Olhivske, Bilohirka, Kostromka, Sukhy Stavok, Bezimenne, Andriivka and Bila Krynytsia.\n\nThe situation has not changed on the Volyn and Polissya directions. Certain units of the armed forces of the Republic of Belarus continue to perform tasks in the border areas with Ukraine. There is still a threat of missile and air strikes on the territory of Ukraine from the airspace and the territory of the Republic of Belarus.\n\nIn other directions, the enemy continued to attack military and civilian objects by fire, namely:\n\non the Siverskyi direction from mortars and jet artillery in the areas of the settlements of Bleshnya, Hai, Senkivka of the Chernihiv oblast and Manukhivka, Yuryeve, Mykolaivka, Khodyne, Porohon, Vovkivka, Zapsillia, Stukalivka and Novovasylivka of the Sumy oblast;\n\nin the Kharkiv direction from barrel and jet artillery in the areas of Duvanka, Sosnivka, Chornohlazivka, Myronivka, Kostiantynivka, Udy, Ruska Lozova, Pytomnyk, Cherkaska Lozova, Cherkasky Tyshky, Rusky Tyshky, Bazaliivka, Stary Saltiv, Kostyantynivka, and Peremoha;\n\nin the Slovyansk direction from barrel and jet artillery in the areas of the settlements of Slovyansk, Dolyna, Krasnopillya, Mazanivka, Velyka Komyshuvakha, Dmytrivka, Brazhkivka, Sulihivka and Virnopillya;\n\nin the Kramatorsk direction, shelling was recorded near Tetyanivka, Kryvya Luka, Ozerne, Zvanivka, Spirne, Ivano-Daryivka, Verkhnyokamyanske, Vesele, and Hryhorivka;\n\nin the Bakhmut direction from mortars, barrel and jet artillery in the areas of the settlements of New York, Toretsk, Yuryivka, Oleksandropil, Zaitseve, Vesela Dolyna, Opytne, Mykolaivka Druha, Mayorsk, Odradivka, Soledar, Bakhmutske, Bakhmut, Yakovlivka, Bilohorivka, Vyimka and Rozdolivka;\n\nin the Avdiivka direction near Avdiivka, Opytne, Orlivka, Vodiane, Tonenke and Pervomaiske;\n\nin the Novopavlivskyi direction from artillery of various types in the areas of Krasnohorivka, Maryinka, Novomykhailivka, Paraskoviyivka, Heorgiyivka, Mykilske, Vuhledar, Volodymyrivka, Prechystivka, Zolota Nyva, Yehorivka, Petrivka, Solodke, Shevchenko, Velyka Novosilka, Novomayorske, Pavlivka, Vremivka ;\n\nin the Zaporizhzhya direction from artillery in the areas of Novoandriivka, Mali Shcherbaky, Mala Tokmachka, Shcherbaky, Nesteryanka, Novodanylivka, Zaliznychne, Dorozhnyanka, Chervone, Poltavka, Malynivka, Olhivske, Bilohirya, Novopil, Vremivka, Vilne Pole and Shevchenko.\n\nIn the South Buh direction, Russian forces fired from barrel and jet artillery along the contact line. In addition, the settlements of Vesely Kut, Tavriyske, Lyubomirivka, Oleksandrivka, Stepova Dolyna, Blahodatne, Luch, Dniprovske, Luparevo, Shevchenkove, Myrne, Novohryhorivka, Kiselivka, Velyke Artakove, Bila Krynytsia, Ternivka, Sukhy Stavok, Olhyne, were also shelled by Russian artillery. Myrolyubivka, Lyubymivka, Petrivka, Velyka Kostromka and Ivanivka.\n\nRussian occupation forces continue to violate all norms of international humanitarian law. For example, in Kupyansk, Kharkiv oblast, the Russian invaders are illegally detaining about 40 local citizens in the local police station. Local residents are forcibly evicted from the private sector of Kozatske settlement of Kherson oblast. Cases of placing weapons and military equipment in the courtyards of educational institutions are being recorded again.\n\nRussian troops continue to suffer losses. In the Kherson region, near Hola Prystan, just last day, as a result of fire damage, Russian forces lost about 70 people, more than half of them were killed. Near the settlement of Tavriysk, two self-propelled artillery systems \"Akatsiya\" were destroyed, two more were damaged, the loss of manpower is being clarified. It also became known that one of Russia's artillery divisions operating in the Kherson direction has lost up to 60 percent of its personnel and equipment and is considered incapacitated. Due to logistics complications, Russian units lack fuel and ammunition.\n\nUnits of the Ukrainian Defense Forces continue to hold their positions and prevent the enemy from advancing on the territory of Ukraine. It was possible to successfully repulse Russian attacks in the areas of Pytomnyk, Ruski Tyshky, Hryhorivka, Zaitseve, Mayorsk, Mykolaivka Druha, Soledar, Bakhmutske, Bakhmut, Dolyna and Opytne settlements.\n\nDuring the day, in order to support the actions of the land grouping, the aviation of the Ukrainian Defense Forces carried out more than 14 strikes on strongholds and places of concentration of the enemy's manpower and equipment. Air defense units Ukrainian troops destroyed two Su-25 aircraft, one Ka-52 helicopter and two UAVs in different directions. Missile troops and artillery of the Ukrainian land grouping continue to perform tasks of counter-battery combat, disruption of the command system and logistical support, fire damage to the enemy's manpower and combat equipment.\n\nThe Russian Ministry of Defense reported that during the day the Armed Forces of Ukraine did not carry out offensive operations in the Nikolaev-Kryvyi Rih direction due to large losses in manpower and equipment.\n\nThe Russian Aerospace Forces with high-precision strikes hit the command post of the 24th brigade of the Armed Forces of Ukraine in the Olenovka region (Nikolaev region), the manpower and equipment of the 46th brigade in the areas of Belogorka, Sukhoi Stavka and Andreevka (Kherson region), as well as the 61st brigade of the Armed Forces of Ukraine in the regions Visunsk and Yavkino (Nikolaev region). An ammunition depot of the 406th brigade of Ukrainian troops was destroyed near Peremoga (Mykolaiv region).\n\nFighter aircraft of the Russian Aerospace Forces and air defense systems (air defense) in the Tokarevo region (Kherson region) destroyed the MiG-29, and in the Komsomolsky region (Nikolaev region) they shot down the Su-25 of the Ukrainian Air Force.\n\nIt is noted that due to heavy losses, the personnel of the 57th motorized infantry brigade of the Armed Forces of Ukraine in the areas of Belaya Krinitsa (Kherson region) and Veliky Artakovo (Mykolaiv region) refused to perform combat missions and left their positions without permission.\n\nIn total, 4 tanks, 6 infantry fighting vehicles and 5 other armored vehicles, 2 pickup trucks with machine guns and more than 150 servicemen lost per day in the Nikolaev-Krivoy Rog direction of the Armed Forces of Ukraine.\n\nIn the area of Krivoy Rog (Dnipropetrovsk region), high-precision weapons destroyed a fuel storage facility for the Armed Forces of Ukraine with a volume of more than 5.5 thousand tons, and the stationing point of the Kraken national formation unit in Kharkov was defeated.\n\nConcentrated fire strikes on the positions of the 113th Territorial Defense Brigade in the area of Prishib, Yavorsky and Andreevka (Kharkiv region) killed up to 40 and wounded more than 80 military personnel of the Armed Forces of Ukraine.\n\nAviation, missile forces and artillery hit 6 command posts of the Armed Forces of Ukraine in the areas of Chuguev, Dergachi, Prishib (Kharkiv region), Bakhmut, Soledar, Kurakhovo (Donetsk People's Republic, DPR), as well as 47 artillery units, manpower and equipment of the Armed Forces of Ukraine in 143 districts . In the area of Konstantinovka (DNR), workshops for the production of shells for the Ukrainian multiple launch rocket systems (MLRS) \"Alder\" were destroyed. 3 weapons and ammunition depots were liquidated in the areas of Liman (Kharkiv region), Ocheretino (DPR) and Gulyaipol (Zaporozhye region), as well as a US-made counter-battery radar in the Zelenodolsk region (Dnipropetrovsk region).\n\nDuring the day, air defense systems shot down 8 unmanned aerial vehicles (UAVs) of the Armed Forces of Ukraine in Kharkiv, Zaporozhye, Kherson regions and the DPR. 20 HIMARS and Vilkha MLRS shells were intercepted in the Kherson region, as well as a Tochka-U missile in the Luhansk People's Republic (LPR).\n\nDuring the day, 3 artillery shelling of Enerhodar (Zaporozhye region) was recorded. As a result of falling into a transformer substation, the city was de-energized. The radiation situation at the Zaporozhye NPP remains normal.\n\nDNR\n\nThe people's militia of the DPR in the evening report reported that since the beginning of the day, Ukrainian armed formations have fired more than 170 rounds of 155- and 152-caliber barrel artillery, as well as 120-mm mortars, across the territory of the republic.\n\nShelling was carried out in the areas of 7 settlements. As a result of the attacks, 4 civilians were injured. 14 housing constructions and 2 civil infrastructure facilities were damaged.\n\nActive fighting continues in the areas of Seversk, Soledar and Bakhmut. Also reported on the advance of the advancing units in the Mayorska area north of Gorlovka and in the area between Maryinka and Novomikhailovka.\n\nAndrey Marochko , an officer of the People's Militia of the LPR , said that numerous cases of looting were recorded in the settlements of the DPR, which are still controlled by the Armed Forces of Ukraine. Thus, similar episodes are reported in Soledar and Bakhmut, where the Ukrainian military take away valuables, vehicles and food from residents.\n\nDPR Foreign Minister Natalya Nikonorova said that Donetsk is negotiating the recognition of the republic with 7 countries in Asia, Africa and Latin America. According to the diplomat, Olga Makeyeva , DPR Ambassador to Moscow, held meetings on this issue with representatives of these states.\n\nNikonorova also said that the International Criminal Court had stopped accepting materials from the DPR on Ukraine's war crimes. In addition, she announced the imminent termination of the activities of the Special Commission for fixing and collecting evidence of war crimes of the Ukrainian authorities in Donbass in connection with the reorganization of the JCCC.\n\nLC\n\nAndrey Marochko, an officer of the NM of the LPR, said that the special services of Ukraine and the West have stepped up their activities to intimidate the population of the republic. Thus, the number of facts of telephone terrorism, threats in social networks and instant messengers has increased.\n\nIn addition, Marochko said that the Armed Forces of Ukraine have increased the use of prohibited ammunition during shelling of the positions of LDNR units. The officer added that the Ukrainian military uses similar methods, including in areas where there are civilians.\n\nVitaly Kiselyov , an adviser to the head of the LPR Ministry of Internal Affairs , said that, together with the acting mayor of Lisichansk, he came under fire from the Armed Forces of Ukraine in the vicinity of the city. As a result of the incident, no one was injured.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8008252", "sentiment": -0.1529411764705882, "wgt": 191, "relevance": 1, "stanza_neg": 21, "stanza_neu": 59, "stanza_pos": 3, "swn_neg": 83, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7182914155", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "05:54:00", "dateTime": "2022-09-10T05:54:00Z", "dateTimePub": "2022-09-10T05:54:00Z", "dataType": "news", "sim": 0.7450980544090271, "url": "https://www.ukrinform.net/rubric-ato/3568299-enemy-moves-1300-kadyrov-fighters-to-kherson-region.html", "title": "Enemy moves 1,300 Kadyrov fighters to Kherson region", "body": "This is stated in the latest report of the General Staff of the Armed Forces of Ukraine published on Facebook, Ukrinform reports.\n\nThe enemy continues to focus its efforts on establishing full control over the territory of Donetsk region, maintaining the temporarily captured districts of Kherson region, part of Kharkiv region, Zaporizhzhia region, and Mykolaiv region.\n\nThe enemy conducts aerial reconnaissance with high intensity, continues to take measures to improve the logistical support of its troops. A further threat of air and missile strikes on the entire territory of Ukraine remains.\n\nOver the past day, the enemy launched 13 missile and 23 air strikes on the facilities across the territory of Ukraine. In particular, infrastructure was affected in the areas of Velyki Prokhody, Avdiivka, Nevelske, Mariinka, Velyka Novosilka, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbakiy, Bilohirya, Ternovi Pody, Blahodatne, Suhyi Stavok, Kostromka and Bezimenne settlements.\n\nIn the Volyn and Polissia directions, the situation has not undergone significant change.\n\nIn the Siverskyi direction, the enemy launched air strikes on civilian and military infrastructure in the areas of Slavhorod and Velyka Pysarivka settlements of Sumy region.\n\nIn other directions, the Russian occupiers shelled military and civilian infrastructure using tanks, combat vehicles, barrel and rocket artillery:\n\nin the Kharkiv direction - in the areas of Dmytrivka, Prudianka, Zolochiv, Sosnivka, Duvanka, Udy, Lyptsi, Peremoha, Momotove, Borshchova settlements;\n\nin the Sloviansk direction - in the areas of Sloviansk, Dolyna, Krasnopillia, Velyka Komyshuvaha, Mykilske, Dibrivne;\n\nin the Kramatorsk direction - near Serebrianka, Kryva Luka, Sydorove, Hryhorivka, Ivano-Daryivka and Spirne;\n\nin the Bakhmut direction - in the areas of Zaitseve, Mykolaivka Druha, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut and Yakovlivka;\n\nin the Avdiivka direction - Krasnohorivka, Avdiivka, Opytne, Vodiane, Karlivka, and Pervomaiske came under mortars and barrel artillery shelling;\n\nin the Novopavlivske direction - in the areas of Maryinka, Novomykhailivka, Mykilske, Vuhledar, Shevchenko, Velyka Novosilka, Bohoiavlenka, Neskuchne, Vremivka;\n\nin the Zaporizhzhia region - in the areas of Novoandriivka, Huliaipole, Charivne, Novosilka, Shcherbaky, Vilne Pole, Malynivka, Orihiv, Novopil.\n\nIn the Southern Buh direction, the enemy continued shelling along the contact line.\n\nIn addition, the enemy conducted aerial reconnaissance using UAVs - 36 sorties were recorded.\n\nThe Ukrainian defense forces successfully repelled enemy attacks in the areas of Zaitseve, Vesela Dolyna, Soledar, Bakhmut and Pervomaiske settlements.\n\nOverall, more than 1,000 square kilometers of Ukrainian territory have been liberated from the occupiers in recent days.\n\nUnits of the defense forces managed to advance 50 kilometer in Kharkiv region. More than 30 settlements of the region were liberated from Russian invaders.\n\nOver the past day, to support the actions of ground groups, the Air Force launched 33 strikes - an enemy ammunition depot was destroyed, damage was inflicted on almost 25 strongholds and places of accumulation of manpower and equipment.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2016_12/thumb_files/630_360_1482323943-5311.jpg", "eventUri": "eng-8008252", "sentiment": -0.3254901960784313, "wgt": 190, "relevance": 1, "stanza_neg": 2, "stanza_neu": 19, "stanza_pos": 2, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7181708292", "lang": "eng", "isDuplicate": false, "date": "2022-09-09", "time": "06:09:00", "dateTime": "2022-09-09T06:09:00Z", "dateTimePub": "2022-09-09T06:08:00Z", "dataType": "news", "sim": 0.7176470756530762, "url": "https://www.ukrinform.net/rubric-ato/3567530-in-kharkiv-region-ukraine-army-advances-50-km-in-three-days.html", "title": "In Kharkiv region, Ukraine Army advances 50 km in three days", "body": "That's according to a morning update by the General Staff of the Armed Forces of Ukraine, Ukrinform reports.\n\n\"The adversary focused its efforts on establishing full control over the territory of Donetsk region, maintaining control of the temporarily captured districts of Kherson region and parts of Kharkiv, Zaporizhia, and Mykolaiv regions. Their UAVs constantly conduct aerial reconnaissance flights, while the enemy forces are continuing to undertake measures to improve supplies to their troops,\" the statement reads.\n\nOver the past 24 hours, the enemy carried out 45 air strikes and five missile attacks, in particular on the settlements of Kostyantynivka, Tsyrkuny, Radushne, and Kharkiv. Civilian victims have been confirmed.\n\nIn the Volyn and Polissia directions, military exercises have begun in Belarus, where the country's forces are tasked with working out the task of \"liberating captured territories.\" The threat of missile and air strikes from the Republic of Belarus remains in place.\n\nIn the Siverskyi direction, the intensity of enemy shelling has significantly decreased. In other areas, the enemy continued to attack Ukrainian military and civilian infrastructure.\n\nIn the Kharkiv direction, the enemy fired barrel and jet artillery in the areas of Udy, Sosnivka, Duvanka, Tsupivka, Prudyanka, Dementiivka, Velyki Prohody, Pytomnyk, Ruski Tyshki, Petrivka, Peremoha, Bayrak, and Kostiantynivka.\n\nIn the Slavyansk direction - near Dolyna, Krasnopill, Slavyansk and Mykilsky.\n\nIn the Kramatorsk direction - in the areas of Bohorodychne, Novomykolaivka, Serebryanka, Siversk, Verkhnyokamianske, Ivano-Daryivka, Spirne, Rozdolivka, and Hryhorivka.\n\nIn the Bakhmut direction - near Yakovlivka, Soledar, Bakhmutske, Bakhmut, Vesela Dolyna, Zaytseve, New York, and Vesele.\n\nIn the Avdiyivka direction - in the areas of Kamianka, Avdiyivka, Pervomaiske, Vodiane, and Opytne.\n\nIn the Novopavlivka direction - near Maryinka, Paraskoviivka, Novomykhailivka, Velika Novosilka, Novoukrainka, Prechistivka, and Mykilske.\n\nIn the Zaporizhia region - in the areas of Novopil, Vremivka, Poltavka, Zaliznychne, Chervone, Novoandriivka, and Orihiv.\n\nIn the Southern Buh region - in the areas of Arkhanhelske, Novovoznesensk, Myrolyubivka, Novovoskresenske, Bilohirka, Novohryhorivka, Shevchenkove, Lyubomirivka, Ternovy Pody, Stepova Dolyna, Myrne, Olhyne, Oleksandrivka, and Tavriyske.\n\nIn connection with the offensive being conducted by Ukraine's troops, in some areas of Kherson region, Russian army units are switching to tactics of terrorist attacks targeting local civilians. According to available intelligence, in the settlement of Velyka Oleksandrivka, the occupiers are using the local population as a human shield. The village has been shut for entry and exit.\n\n\"Ukraine's Defense Forces heroically hold their ground, not allowing the enemy to advance. Our defenders successfully repelled the enemy's offensive in the areas of Uda, Kostyantynivka, Virnopillya, Ploske, Mayorsk, Bezimenne, and Kamianka,\" the statement reads.\n\nAs noted, Ukraine's forces are conducting a successful counteroffensive in the Kharkiv direction. \"Thanks to the skillful and coordinated actions of the Armed Forces with the support of the local population, they advanced almost 50 km in three days. \"\n\nAccording to intelligence, a number of enemy units suffered significant losses.\n\nThe occupiers are trying to evacuate wounded personnel and damaged military equipment to the areas of Vilkhuvatka and Borodoyarske. Servicemen switch to civilian clothes, trying to desert and return to the territory of the Russian Federation. Over the past day, more than 15 such cases were reported.\n\nMeanwhile, Ukraine's missile troops and artillery units engage in counter-battery combat, disrupting the enemy's control system and supply routes, inflicting strikes on manpower and military equipment.\n\n\"Over the past day, in order to support the actions of ground groups, the Air Force carried out more than 20 strikes, hitting two platoon strongholds, 15 manpower and military equipment clusters, and three anti-aircraft missile systems. Four UAVs and a Ka-52 helicopter were downed,\" the General Staff concluded.\n\nAs reported, the Armed Forces of Ukraine eliminated about 51,250 Russian invaders from February 24 to September 8.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1658233750-509.jpg", "eventUri": "eng-8008252", "sentiment": -0.388235294117647, "wgt": 183, "relevance": 1, "stanza_neg": 9, "stanza_neu": 21, "stanza_pos": 2, "swn_neg": 32, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183649194", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "23:20:00", "dateTime": "2022-09-10T23:20:00Z", "dateTimePub": "2022-09-10T23:20:00Z", "dataType": "news", "sim": 0.7176470756530762, "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2022-09-10.htm", "title": "\nUkraine", "body": "A number of claims and counterclaims are being made on the Ukraine-Russia conflict on the ground and online. While GlobalSecurity.org takes utmost care to accurately report this news story, we cannot independently verify the authenticity of all statements, photos and videos.\n\nOn 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War. Russian President Vladimir Putin announced a \"special military operation\" (SVO - spetsialnaya voennaya operatsiya) in Ukraine in response to the appeal of the leaders of the \"Donbass republics\" for help. That attack is a blatant violation of the territorial integrity, sovereignty and independence of Ukraine. Putin stressed that Moscow's goal is the demilitarization and denazification of the country. The military buildup in preceeding months makes it obvious that the unprovoked and dastardly Russian attack was deliberately planned long in advance. During the intervening time, the Russian government had deliberately sought to deceive the world by false statements and expressions of hope for continued peace.\n\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\" [Judgment of the International Military Tribunal]\n\nUkraine announced major advancements in a strategic military counteroffensive against Russian forces. On Saturday, Ukraine announced it had retaken Izyum and forced thousands of Russian soldiers to retreat across the Oskil River and territory in northeastern Ukraine.\n\nRussia's Defense Ministry confirmed its forces' pull out of Izyum, claiming the move was planned. Russia also confirmed that its troops were being regrouped from Balaklia and Izyum areas to the Donetsk region\n\nUkraine also claimed full control over the city of Balaklia in the northeastern region of Kharkiv, and that its forces had entered the strategic city of Kupyansk; a transportation hub in eastern Ukraine and strategically important for supplying Russian troops.\n\nMeanwhile, Ukrainian forces were reported to be oursideLysychansk and fighting outside Lyman.\n\nThe UK Ministry of Defence reported that Ukrainian forces launched offensive operations in the south of Kharkiv Oblast on 06 September 2022. Lead elements have advanced up to 50km into previously Russian held territory on a narrow front.\n\nRussian forces were likely taken by surprise. The sector was only lightly held and Ukrainian units have captured or surrounded several towns. A Russian force around Izium is likely increasingly isolated. Ukrainian units are now threatening the town of Kupiansk; its capture would be a significant blow to Russia because it sits on supply routes to the Donbas front line.\n\nWith Ukrainian operations also continuing in Kherson, the Russian defensive front is under pressure on both its northern and southern flanks.\n\nThe General Staff of the Armed Forces of Ukraine reported that Russia continues to focus its efforts on establishing full control over the territory of the Donetsk oblast, maintaining the captured territories and disrupting the offensive of our troops in certain directions. Russian forces conduct aerial reconnaissance, continues to fire at the positions of Ukrainian units, takes measures to restore the lost position, and move troops for this purpose. The threat of air and missile strikes remains throughout the territory of Ukraine.\n\nDuring the day, the Russian occupiers launched 9 missile and 10 air strikes on military and civilian objects of our State. In particular, the settlements of Slavhorod, Velyka Pysarivka, Velyki Prohody, Avdiyivka, Siversk, Kostyantynivka, Bakhmut, Nevelske, Maryinka, Velyka Novosilka, Dnipro, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaki, Mykolaiv, Biloghirya, Sukhy Stavok and Bruskinske were affected by enemy strikes.\n\nIn the Volyn and Polissya directions, the situation has not changed significantly. In order to maintain the troops of the Armed Forces of the Republic of Belarus in combat readiness, the training period has been extended once again.\n\nIn other directions, Russian forces fired at military and civilian infrastructure from tanks, combat vehicles, mortars, barrel and jet artillery, namely:\n\nin the Siverskyi direction - near Bilopilla and Lynove of the Sumy oblast;\n\nin the Kharkiv direction - in the areas of Lyutivka, Timofiyivka, Dementiyivka, Prudyanka, Zolochiv, Sosnivka, Duvanka, Udy, Kostyantynivka, Peremoha, Velyki Prokhody, Borshcheva and Zamulivka settlements;\n\nin the Slovyansk direction - in the areas of the settlements of Slovyansk, Dolyna, Krasnopillya, Mykilske, Velyka Komyshuvakha, Dibrivne, Karnaukhivka, Dovhenke and Dmytrivka;\n\nin the Kramatorsk direction - in the areas of Serebryanka, Kryva Luka, Rai-Olexandrivka, Piskunivka, Sydorove, Siversk, Ivano-Daryivka, Rozdolivka and Spirne settlements;\n\nin the Bakhmut direction - in the areas of Zaitseve, Mykolaivka Druga, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut, Bilohorivka and Vesele settlements;\n\nin the Avdiyivka direction - near Krasnohorivka, Avdiyivka, Opytny, Vodyany, Karlivka and Pervomaisky;\n\nin the Novopavlivskyi direction - near Maryinka, Novomykhailivka, Mykilske, Vugledar, Shevchenko, Velyka Novosilka, Bohoyavlenka, Neskuchne and Vremivka;\n\nin the Zaporizhzhya region - in the areas of Novoandriivka, Hulyaipole, Charivne, Rivnopillia, Novosilka, Vilne Pole, Chervone, Malynivka, Orihiv, Novopil and Vremivka settlements;\n\nin the Southern Buh direction - in the areas of Stepova Dolyna, Oleksandrivka, Myrne, Lyubomyrivka, Kiselivka, Vesely Kut, Velyke Artakove, Blahodativka and Vysokopilya settlements. In total, more than twenty settlements were hit by artillery fire in this direction.\n\nRussian forces continue to suffer losses. In particular, as a result of the actions of the Defense Forces in the South Buh region, the losses of units of the 106th Airborne Division of the Armed Forces of the Russian Federation in the previous day alone amounted to more than 58 people killed. The command of the Russian forces is carrying out measures to restore the combat capability of units of the 1st Army Corps by transferring personnel who survived the hostilities to other units. Thus, according to available information, the remnants of personnel from the so-called \"khan\" special purpose battalion were transferred to the 9th Marine Regiment.\n\nThe number of self-harms has increased among personnel arriving in Ukraine for reinforcements. The Russian leadership is constantly looking for new sources of replenishment of reserves. Promising a high salary and a social package, it tries to recruit \"volunteers\" among retired military personnel in the Kyrgyz Republic through social media groups.\n\nIn connection with the approach of units of the Ukrainian Defense Forces, the command of the Russian occupying forces in the Kherson region is trying to strengthen the city of Kherson by moving reserves. Thus, in the oblastr, new units of the enemy are recorded, whose servicemen are poorly oriented in the city.\n\nRussian forces are trying to carry out work on the restoration of traffic across the Kakhovskaya HPP bridge, the section of which is under the fire control of the Armed Forces of Ukraine. In Nova Kakhovka, Russian forces intensified filtering measures with the participation of FSB officers of Russia - they check mobile devices, look for citizens who help the Armed Forces of Ukraine. The situation is similar in Energhdar, Zaporizhzhya region.\n\nUkrainian defense forces successfully repelled enemy offensives in the areas of Sosnivka, Mayorsk, Mykolayivka Druha, Zaitseve, Vesela Dolyna, Bakhmut, Pervomaiske and Novomykhailivka settlements.\n\nThe liberation of settlements that were temporarily captured by the rssian occupiers in the Kharkiv region and in the South Buh region continues.\n\nDuring the day, in order to support the actions of the land groupings, the Air Force of the Ukrainian Defense Forces carried out more than 17 strikes on strongholds and places where Russian manpower and equipment are concentrated, as well as ammunition warehouses. Air defense units destroyed the UAV and shot down the Kh-59 air missile in the airspace of the Dnipropetrovsk oblast.\n\nMissile troops and artillery of land groupings, continue to perform tasks of counter-battery combat, fire damage to command and C2 points, manpower and combat equipment, disruption of the Russia's control system and logistical support.\n\nDuring the current day, as a result of artillery fire, damage was inflicted on two control points, eight areas of concentration of Russian manpower and military equipment, as well as a Russian forces' pontoon crossing.\n\nThe Ministry of Defense of Russia during a daily briefing reported that during the day, the headquarters of the 5th brigade of the National Guard of Ukraine, the points of deployment of units of the 92nd mechanized brigade and the nationalist formation \"Kraken\" in the Balakleya and Chuguev regions (Kharkiv region) were hit by high-precision weapons of the Russian Aerospace Forces , as well as the command post of the 54th mechanized brigade of the Armed Forces of Ukraine in the area of the settlement of Ray-Aleksandrovka (Donetsk People's Republic, DPR). Up to 300 Ukrainian servicemen and up to 15 units of military equipment were destroyed.\n\nAviation, missile forces and artillery hit 7 command posts of the Armed Forces of Ukraine in the areas of Rozovka, Ocheretino, Vodyany, Novomikhailovka and Vugledar (DPR), Snigirevka and Novonikolaevka (Nikolaev region), 48 artillery units, manpower and military equipment of the Armed Forces of Ukraine in 178 districts. 6 weapons and ammunition depots were liquidated in the districts of Kurakhovo, Konstantinovka and Seversk (DPR), Dnieper and Radushnoye (Dnipropetrovsk region), Gulyaipol (Zaporozhye region). In the Kaluga region (Nikolaev region), a radar station for detecting and tracking air targets was destroyed.\n\nDuring the counter-battery fight, 2 platoons of reactive and 5 platoons of cannon artillery of the Armed Forces of Ukraine were suppressed in the areas of Georgievka, Krasnogorovka, Antonovka, Romanovka, Ocheretino, Novgorodsky and Novoselovka 1st (DPR). A US-made 155-mm M777 howitzer was destroyed near Novoselovka 1st.\n\nAir defense systems shot down 13 unmanned aerial vehicles in the Kherson, Kharkiv, Zaporozhye regions and the DPR. In the Kherson region, 5 shells of the HIMARS multiple launch rocket system (MLRS) were destroyed in the air.\n\nThe Ministry of Defense spoke about the current situation in the Kharkiv region. The department reported that in order to achieve the goals of the NVO to liberate Donbass, a decision was made to regroup Russian troops in the Balakliya and Izyum regions to step up efforts in the Donetsk direction. Therefore, within 3 days, an operation was carried out to curtail and organize the transfer of a group of troops to the territory of the DPR. In order to prevent damage to the RF Armed Forces, a powerful fire defeat was inflicted on the enemy using aviation, missile troops and artillery, more than 2,000 Ukrainian and foreign fighters were destroyed, as well as over 100 armored vehicles and artillery units.\n\nThe Defense Ministry said that the military of the Izyum-Balakley group, as part of the tasks of destroying enemy assets, hit the operators who controlled the Bayraktar UAV. In addition, the ministry emphasized that the artillery crews of the group showed courage and bravery in battles with Ukrainian units.\n\nDPR\n\nThe people's militia of the DPR in the evening report reported that since the beginning of the day, Ukrainian troops had fired more than 100 ammunition from tanks, cannon artillery with a caliber of 155 and 152, as well as 120-mm mortars across the territory of the republic.\n\nShelling was carried out in the areas of 8 settlements. As a result of the attacks, 4 civilians were killed and 8 more were injured. 8 housing constructions and 2 civil infrastructure facilities were damaged.\n\nThere are reports of clashes in the vicinity of Liman. According to the Rybar Telegram channel, Russian units are repelling attempts by the Armed Forces of Ukraine to advance at the Stary Karavan-Brusovka-Dibrov line.\n\nThe Ministry of State Security of the DPR announced the elimination of 2 sabotage groups that planned terrorist attacks on critical facilities in the republic. The first of the DRGs was destroyed on August 26, it included Vyacheslav Matveev, Assistant Chief of Intelligence of the 5th Assault Regiment of the 1st Separate Brigade of the President of Ukraine named after Hetman Khmelnytsky of the Armed Forces of Ukraine . Filming from his personal camera made it possible to determine that Kyiv was planning the release of another group of saboteurs, which was subsequently ambushed and destroyed.\n\nLC\n\nOfficer of the People's Militia of the Luhansk People's Republic (LPR) Andrey Marochko denied media reports about the alleged entry of the Ukrainian military into the village of Svatovo.\n\n\"Regarding the settlement of Svatovo, I can assure you that this city is completely under our control. No Ukrainian troops crossed the border of the Luhansk People's Republic,\" he said.\n\nLPR Ambassador to Russia Rodion Miroshnik also said that the entire territory of the republic remains under the control of Lugansk. According to the diplomat, Ukraine is spreading false information in an effort to sow panic.\n\nAnother convoy of the Russian Ministry of Emergency Situations arrived in Luhansk and Severodonetsk, delivering flour, water and other humanitarian cargo, including drinking water, school supplies and diapers.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8008252", "sentiment": -0.1607843137254902, "wgt": 183, "relevance": 1, "stanza_neg": 34, "stanza_neu": 55, "stanza_pos": 2, "swn_neg": 91, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7181099583", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "16:55:00", "dateTime": "2022-09-08T16:55:00Z", "dateTimePub": "2022-09-08T16:55:00Z", "dataType": "news", "sim": 0.6980392336845398, "url": "https://www.ukrinform.net/rubric-ato/3567337-ukraine-army-repels-enemy-attacks-near-nine-settlements.html", "title": "Ukraine Army repels enemy attacks near nine settlements", "body": "The relevant statement was made on Facebook by the General Staff of the Armed Forces of Ukraine as of 06:00 p.m., September 8, 2022, an Ukrinform correspondent reports.\n\n\"The enemy continues to focus efforts on establishing full control over Donetsk Region and holding the occupied areas of Kherson Region, Kharkiv Region, Zaporizhzhia Region and Mykolaiv Region. Enemy units are constantly conducting air reconnaissance with unmanned aerial vehicles (UAVs) and continue taking measures to improve logistical supplies,\" the report states.\n\nDuring the day, Russian troops launched four missile strikes on such settlements as Kostiantynivka, Tsyrkuny, Bereznehuvate and Kharkiv (casualties among civilians were reported), and 15 air strikes on military and civilian objects near Temyrivka, Krasnohorivka, Volodymyrivka and Novomykhailivka.\n\nRussian occupiers struck such settlements as Serebrianka, Platonivka and Tavriiske with the Grad and Uragan multiple launch rocket systems (MLRS) over 10 times.\n\nIn the Volyn and Polissia directions, the situation is remaining unchanged. Belarusian forces continue to carry out tasks within the areas bordering with Ukraine. The threat of missile and air strikes from the air space and territory of Belarus is persisting.\n\nIn other directions, Russian troops continued to open fire on military and civilian objects as follows: in the Siverskyi direction - near Chernihiv Region's Senkivka and Sumy Region's Myropilske, Velykyi Prykil and Prokhody; in the Kharkiv direction - such settlements as Udy, Svitlychne, Nove, Male Vesele, Ruski Tyshky, Cherlaski Tyshky, Peremoha, Staryi Saltiv, Bairak and Kostiantynivka were struck with cannon and rocket artillery; in the Sloviansk direction - such settlements as Sloviansk, Virnopillia, Dolyna, Krasnopillia and Nova Dmytrivka came under enemy fire; in the Kramatork direction - near Pryshyb, Pereizne, Spirne and Rozdolivka; in the Bakhmut direction - near Yakovlivka, Soledar, Bakhmutske, Bakhmut, Vesela Dolyna, Zaitseve, New York and Vesele; in the Avdiivka direction - near Avdiivka, Pervomaiske, Vodiane and Opytne; in the Novopavlivka direction - near Krasnohorivka, Marinka, Velyka Novosilka, Vuhledar, Novomaiorske and Yehorivka; in the Zaporizhzhia direction - near Novoandriivka, Novopil and Vremivka; in the Southern Bug direction - near Bila Krynytsia, Pervomaiske, Liubymivka, Ternovi Pody, Zelenyi Hai, Petrivka, Stepova Dolyna, Pravdyne, Tavriiske, Myroliubivka and Ivanivka.\n\nThe successful efforts of the partisan movement, in cooperation with the artillery units of Ukraine's Defense Forces, create issues for enemy units in terms of logistical supplies in the temporarily occupied areas of Kherson Region.\n\nIn order to counter the leakage of information about the movement of occupation units at a railway station in Sokolohirne, Russian troops intensified filtration efforts.\n\nIn the temporarily occupied areas of Kharkiv Region, Donetsk Region, Zaporizhzhia Region and Kherson Region, as part of preparations for the so-called 'referendums', Russian occupiers are urging local residents, who have left the temporarily occupied areas, to return to their homes before October 1, 2022. In case of refusal, Russian invaders threaten to 'nationalize' their housing property.\n\nIn the occupied area of Kharkiv Region's Chuhuiv District, Russian invaders actively started to forcibly mobilize local residents. The men of fighting age get detained and sent to the so-called 'recruitment center' in Vovchansk.\n\nThe missile and artillery units of the Ukrainian ground forces continue to conduct counterbattery activities, disrupt control and logistical supply systems, strike enemy personnel and military equipment.\n\nDuring the day, providing support for the ground forces, Ukraine's aviation launched more than 12 strikes, having hit two enemy platoon strong points, six personnel and military equipment clusters, and two air-defense missile systems. The Ukrainian anti-aircraft defense units destroyed two Russian UAVs. The enemy's exact losses are yet to be checked.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_09/thumb_files/630_360_1662222458-431.jpg", "eventUri": "eng-8008252", "sentiment": -0.2784313725490196, "wgt": 178, "relevance": 1, "stanza_neg": 10, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7179914227", "lang": "eng", "isDuplicate": false, "date": "2022-09-07", "time": "20:08:00", "dateTime": "2022-09-07T20:08:00Z", "dateTimePub": "2022-09-07T20:08:00Z", "dataType": "news", "sim": 0.686274528503418, "url": "https://www.pravda.com.ua/eng/news/2022/09/7/7366504/", "title": "Ukrainian defenders repelled 11 Russian attacks, shot down two Su-25s and Ka-52 Alligator helicopter - General Staff report", "body": "As of 18.00 on 7 September, the Ukrainian defenders repelled 11 attacks by the Russian invaders, managing to destroy two Russian Su-25 aircraft and a Ka-52 helicopter.\n\nSource: General Staff of the Armed Forces of Ukraine\n\nQuote from General Staff: \"The enemy continues to focus its efforts on establishing full control over the territory of Donetsk Oblast, holding the captured areas of Kherson, Kharkiv, Zaporizhzhia and Mykolaiv oblasts.\n\n[The Russian army] constantly conducts aerial reconnaissance of UAVs, and continues to take measures to improve the logistics support of its troops.\n\nDuring the current day, the enemy launched more than 8 missile and 10 air strikes on objects on the territory of Ukraine.\"\n\nDetails: In particular, infrastructure was damaged in the areas of the settlements of Kharkiv, Tsyrkuny, Velyki Prokhody, Sloviansk, Siversk, Kramatorsk, Bohoiavlenka, Konstiantynivka, Dorozhnianka, Olhivske, Bilohirka, Kostromka, Sukhyi Stavok, Bezimenne, Andriivka and Bila Krynytsia.\n\nWe have launched English Twitter! Follow us!\n\nOn the Siversk, Kharkiv, Sloviansk, Kramatorsk, Bakhmut, Avdiivka, Novopavliv and Zaporizhzhia fronts, Russians continue to fire at military and civilian facilities. Russia fires mortars as well as rocket and tubed artillery on Ukrainian positions.\n\nOn the Pivdennyi Buh front, Russians opened fire from tubed and rocket artillery along the contact line.\n\nIt is reported that the Russian occupation forces continue to violate all norms of international humanitarian law. So, in Kupiansk, Kharkiv oblast, the invaders illegally hold about 40 local citizens in the local police station.\n\nResidents are being forcibly evicted from the private sector of the settlement of Kozatske in Kherson Oblast.\n\nCases of placing weapons and military equipment in the courtyards of educational institutions are recorded.\n\nIn addition, the invaders continue to suffer losses. In Kherson Oblast, near Hola Prystan, just over the previous day, Russian losses totalled about 70 people; more than half of them were killed.\n\nNear the village of Tavriysk, 2 Acacia self-propelled artillery units were destroyed; two more were damaged, and the loss of manpower is being clarified.\n\nIt also became known that one of Russia's artillery divisions operating on the Kherson front has lost up to 60% of its military personnel and equipment; so now, it is considered incapacitated. Due to logistics difficulties, there is a lack of fuel and ammunition in Russian units.\n\nThe Ukrainian defenders managed to successfully repel the attacks of the Russian invaders near Pytomnyk, Ruski Tyshky, Hryhorivka, Zaitseve, Maiorsk, Mykolaivka Druha, Soledar, Bakhmutske, Bakhmut, Dolyna and Opytne.\n\nDuring the day, the Air Force units delivered more than 14 strikes on strongholds and clusters of manpower and equipment of the invaders.\n\nAir defence units of Ukrainian troops destroyed two Su-25 aircraft, one Ka-52 helicopter and two UAVs, all in different locations.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/8/5/85a6a70-305915092-403165798663171-7995057113114720024-n.jpg", "eventUri": "eng-8008252", "sentiment": -0.192156862745098, "wgt": 175, "relevance": 1, "stanza_neg": 6, "stanza_neu": 17, "stanza_pos": 1, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7180379578", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "06:59:00", "dateTime": "2022-09-08T06:59:00Z", "dateTimePub": "2022-09-08T06:58:00Z", "dataType": "news", "sim": 0.6823529601097107, "url": "https://www.pravda.com.ua/eng/news/2022/09/8/7366549/", "title": "Ukrainian Armed Forces repel Russian attacks near 9 towns and villages - General Staff report", "body": "The Armed Forces of Ukraine have successfully repelled Russian attacks in the vicinities of Kostiantynivka, Dibrivne, Hryhorivka, Zaitseve, Maiorsk, Mykolaivka Druha, Pervomaiske and Kamianka.\n\nSource: General Staff of the Armed Forces of Ukraine on Facebook; information as of 06:00 on 8 September\n\nDetails: Over the course of the past 24 hours, Russian forces carried out over 10 missile strikes and 22 airstrikes on targets across Ukraine.\n\nIn particular, the Russian attacks damaged infrastructure targets in and around the following cities, towns and villages: Kharkiv, Tsyrkuny, Velyki Prokhody, Sloviansk, Siversk, Kramatorsk, Ivano-Darivka, Zaitseve, Soledar, Bakhmut, Bakhmutske, Bohoiavlenka, Kostiantynivka, Vremivka, Velyka Novosilka, Prechystivka, Dorozhnianka, Trudove, Chervone, Vysokopillia, Ternovi Pody, Lozove, Olhivske, Bilohirka, Kostromka, Chervonyi Yar, Sukhyi Stavok, Bezimenne, Andriivka and Bila Krynytsia.\n\nThere were no changes on the Volyn and Polissia fronts. There is an ongoing threat of missile strikes and airstrikes on Ukrainian targets from the territory and the airspace of the Republic of Belarus.\n\nRussian forces continued to fire on military and civilian targets on other fronts:\n\nWe have launched English Twitter! Follow us!\n\nThe General Staff also reports that Russian forces keep suffering losses. In particular, they suffered significant losses following the attack of the Ukrainian Armed Forces on a concentration of Russian military personnel and equipment on the territory of Ukraine [name of the business] agricultural business in the village of Solodkovodne in Zaporizhzhia Oblast. The extent of the Russian losses has yet to be confirmed.\n\nThe Ukrainian Defence Forces are maintaining their current positions and preventing Russian troops from advancing further into the territory of Ukraine. The Armed Forces of Ukraine have successfully repelled Russian attacks in the vicinities of Kostiantynivka, Dibrivne, Hryhorivka, Zaitseve, Maiorsk, Mykolaivka Druha, Pervomaiske and Kamianka.\n\nOver the course of the past 24 hours, Ukrainian aircraft supported the operations of Ukrainian ground forces by delivering over 30 airstrikes on Russian strong points and areas where Russian military personnel and equipment were concentrated.\n\nUkrainian air defence units shot down and destroyed two Russian Su-25 jets, two helicopters (a Ka-52 and a Mi-24) and five unmanned aerial vehicles on several different fronts.\n\nRocket and artillery units are continuing to perform counter-battery fire missions in order to disrupt Russian command and supply chains, kill Russian military personnel and destroy their military equipment.\n\nOver the course of the day, the Ukrainian soldiers struck a Russian command post, oil and lubricants storage points, and several clusters of Russian military personnel, weapons and equipment.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/6/5/659d926-305269313-403528375293580-617714312540196000-n.jpg", "eventUri": "eng-8008252", "sentiment": -0.4196078431372549, "wgt": 174, "relevance": 1, "stanza_neg": 5, "stanza_neu": 12, "stanza_pos": 2, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7182936638", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "06:33:00", "dateTime": "2022-09-10T06:33:00Z", "dateTimePub": "2022-09-10T06:28:00Z", "dataType": "news", "sim": 0.6745098233222961, "url": "https://www.pravda.com.ua/eng/news/2022/09/10/7366869/", "title": "Russia transfers 1,300 Kadyrov soldiers to the Kherson region - General Staff report", "body": "A unit of the so-called Kadyrovites [people who serve in detachments that are subordinate to Ramzan Kadyrov, Head of the Chechen Republic of the Russian Federation - ed.], amounting up to 1,300 people, has arrived in the occupied Kherson region.\n\nSource: report by General Staff of the Armed Forces of Ukraine as of 06:00, 10 September\n\nQuote: \"A unit of the so-called Kadyrovites, formed according to national characteristics, numbering up to 1,300 people, arrived to strengthen the Russian grouping in the temporarily occupied territories of Kherson Oblast\".\n\nDetails: During the day, the Russian forces launched 13 rocket strikes and 23 airstrikes. Infrastructure was damaged in the areas of Velyki Prokhody, Avdiivka, Nevelske, Marinka, Velyka Novosilka, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaky, Bilohiria, Ternovi Pody, Blahodatne, Sukhyi Stavok, Kostromka and Bezimenne.\n\nThe situation on the Volyn and Polissia fronts has not changed significantly.\n\nOn the Sivershchyna front, the Russian forces carried out airstrikes on civilian and military infrastructure in the areas of settlements of Slavhorod and Velyka Pysarivka of Sumy Oblast.\n\nWe have launched English Twitter! Follow us!\n\nOn other fronts, the Russian occupiers attacked military and civilian infrastructure with tanks, combat vehicles, tubed and rocket artillery:\n\nOn the Kharkiv front - in the areas of Dmytrivka, Prudianka, Zolochiv, Sosnivka, Duvanka, Udy, Lyptsi, Peremoha, Momotove, Borshchova;\n\nOn the Sloviansk front - near settlements of Sloviansk, Dolyna, Krasnopillia, Velyka Komyshuvakha, Mykilske, Dibrivne;\n\nOn the Kramatorsk front - near Serebrianka, Kryvi Luky, Sydorove, Hryhorivka, Ivano-Darivka and Spirne;\n\nOn the Bakhmut front - in the areas of Zaitseve, Mykolaivka Druha, Vesela Dolyna, Soledar, Bakhmutske, Bakhmut and Yakovlivka;\n\nOn Avdiivka front - near Krasnohorivka, Avdiivka, Opytne, Vodiane, Karlivka and Pervomaiske, where the invaders used tubed and rocket artillery;\n\nOn the Novopavlivka front - near settlements of Marinka, Novomykhailivka, Mykilske, Vuhledar, Shevchenko, Velyka Novosilka, Bohoiavlenka, Neskuchne, Vremivka;\n\nOn the Zaporizhzhia front - in the areas of Novoandriivka, Huliaipole, Charivne, Novosilka, Shcherbaky, Vilne Pole, Malynivka, Orikhiv, Novopil;\n\nOn the Pivdennyi Buh front, the Russian forces continued to fire along the contact line. In addition, the Russian army carried out reconnaissance from unmanned aerial vehicles - 36 sorties were recorded.\n\nDefence forces successfully repelled invaders' attacks in the areas of Zaitseve, Vesela Dolyna, Soledar, Bakhmut and Pervomaiske.\n\nAviation of the Defence Forces of Ukraine landed 33 strikes, destroying the ammunition warehouse, inflicting damage on almost 25 strongholds and clusters of manpower and equipment. During the day, the Armed Forces hit 18 checkpoints, as well as areas where the occupiers' manpower was concentrated, anti-aircraft and electronic defence systems, artillery units, and more than 20 warehouses with ammunition, fuel and lubricants. Air defence units destroyed two UAVs and a guided air missile, all on different fronts.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/f/e/fe50095-gettyimages-1239451817--3-.png", "eventUri": "eng-8008252", "sentiment": -0.08235294117647063, "wgt": 172, "relevance": 1, "stanza_neg": 5, "stanza_neu": 18, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7180603452", "lang": "eng", "isDuplicate": false, "date": "2022-09-08", "time": "10:09:00", "dateTime": "2022-09-08T10:09:00Z", "dateTimePub": "2022-09-08T10:09:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://liveuamap.com/en/2022/8-september-ukrainian-aviation-conducted-over-30-airstrikes", "title": "Ukrainian aviation conducted over 30 airstrikes at gatherings and bases of Russian forces. Ukrainian air defence shot down 2 Su-25 planes, Mi-24 and Ka-52 helicopters and 5 drones, - General Staff of Armed Forces of Ukraine says in the morning report         Kherson - Ukraine Interactive map  - Ukraine Latest news on live map - liveuamap.com", "body": "Ukrainian military repelled Russian offensive attempts at Kostiantynivka, Dibrivne, Hryhorivka, Zaitseve, Mayorsk, Mykolaivka Druha, Pervomaiske and Kamyanka, - General Staff of Armed Forces of Ukraine says in the morning report Russian army conducted 10 missile strikes and 22 airstrikes across Ukraine. Infrastructure was targeted near Kharkiv, Tsyrkuny, Velyki Prohody, Sloviansk, Sieversk, Kramatorsk, Ivano-Daryivka, Zaitseve, Soledar, Bakhmut, Bohoyavlenka, Kostiantynivka, Vremivka, Velyka Novosilka, Prechystivka, Dorozhnianka, Trudove, Chervone, Vysokopillia, Ternovi Pody, Lozove, Olhivske, Bilohirka, Kostromka, Chervony Yar, Sukhiy Stavok, Bezimenne, Andriivka and Bila Krynytsa , - General Staff of Armed Forces of Ukraine says in the morning report", "source": {"uri": "liveuamap.com", "dataType": "news", "title": "Ukraine Interactive map  - Ukraine Latest news on live map - liveuamap.com"}, "authors": [], "image": "https://liveuamap.com/pics/2022/09/08/22486596_shared.jpg", "eventUri": "eng-8008252", "sentiment": -0.3333333333333334, "wgt": 166, "relevance": 1, "stanza_neg": 0, "stanza_neu": 2, "stanza_pos": 0, "swn_neg": 2, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7182350728", "lang": "eng", "isDuplicate": false, "date": "2022-09-09", "time": "15:48:00", "dateTime": "2022-09-09T15:48:00Z", "dateTimePub": "2022-09-09T15:45:00Z", "dataType": "news", "sim": 0.6352941393852234, "url": "https://censor.net/en/news/3366154/artillery_of_afu_hit_3_enemy_control_points_pontoon_crossing_28_objects_of_concentration_of_occupying", "title": "Artillery of AFU hit 3 enemy control points, pontoon crossing, 28 objects of concentration of occupying forces, - General Staff", "body": "Operational information of the General Staff of the Armed Forces of Ukraine regarding the Russian invasion as of 6:00 p.m. 09/09/2022.\n\nThis is reported by Censor.NET with a link to the page of the General Staff of the Armed Forces of Ukraine.\n\n\"Glory to Ukraine! 198 days of heroic resistance of the Ukrainian nation to the Russian large-scale invasion continues. The enemy continues to focus its efforts on establishing full control over the territory of the Donetsk region, maintaining the temporarily captured areas of the Kherson region, parts of the Kharkiv, Zaporizhzhia, and Mykolaiv regions. It conducts aerial reconnaissance by UAVs with high intensity It is trying to improve the tactical position and logistical support of its troops.\n\nDuring the current day, the enemy launched more than 12 missile and more than 12 air strikes on objects on the territory of Ukraine. To do this, he spent up to forty sorties. In particular, infrastructure was affected in the areas of Velyki Prohody, Starovirivka, Yuryvka, Temyrivka, Ternovi Pody, Sukhy Stavok, Barvinok and Bilohirka settlements. There remains a further threat of air and missile strikes throughout the territory of Ukraine, in particular from the territory and airspace of the Republic of Belarus.\n\nIn the Volyn and Polissia directions, the situation remains without significant changes. Command and staff exercises are ongoing in the armed forces of the Republic of Belarus. In other directions, the enemy is shelling military and civilian infrastructure from tanks, combat vehicles, barrel and rocket artillery, namely:\n\nIn addition, he actively conducted aerial reconnaissance by UAVs, made more than 60 sorties.\n\nDue to significant losses and reluctance to fight, the morale and psychological condition of the occupation units is significantly deteriorating and the number of deserters is increasing. In the temporarily occupied territory of the Kherson region, in the area of the settlement of Babenkivka Druga, the enemy was forced to use helicopters and weapons to search for fugitives and return them to combat positions. In addition, through Kalanchak, in the direction of the temporarily occupied Crimea, an intensive movement of unarmed Russian soldiers by buses was noted.\n\nUnits of the Defense Forces hold their positions and prevent the enemy from advancing deep into the territory of Ukraine. Our soldiers successfully repelled enemy attacks in the areas of Kostiantynivka, Prudianka, Ruski Tyshky, Virnopillia, Mykolaivka Druha, Zaytseve, Avdiivka, Kamianka, Pobieda and Bezimenne settlements.\n\nDuring the day, in order to support the actions of the ground groups, the Air Force of the Defense Forces carried out more than 10 strikes, during which combat equipment, anti-aircraft defense equipment and a significant number of personnel were destroyed in strongholds in the Donetsk and Yuzhno-Buzka directions.\n\nAir defense units destroyed at least 2 enemy UAVs in different directions.\n\nMissile troops and artillery of ground troops continue to carry out the tasks of fire damage to manpower and combat equipment, counter-battery combat, disruption of the enemy's control system and logistical support. 3 enemy control points, a pontoon crossing, 28 manpower and military equipment concentration facilities were damaged by fire. Ammunition depots and firing positions of the enemy's artillery fell into the affected area. The results are being verified.\n\nWe believe in the Armed Forces! Let's win together! \"Glory to Ukraine!\" - says the information of the General Staff of the Armed Forces of Ukraine.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/7/f/2/1/7f2144c13c6abb6a809edb653ebc5791/censor_social.jpg", "eventUri": "eng-8008252", "sentiment": -0.02745098039215688, "wgt": 162, "relevance": 1, "stanza_neg": 5, "stanza_neu": 23, "stanza_pos": 3, "swn_neg": 31, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7183577119", "lang": "eng", "isDuplicate": false, "date": "2022-09-10", "time": "21:02:00", "dateTime": "2022-09-10T21:02:00Z", "dateTimePub": "2022-09-10T20:53:00Z", "dataType": "news", "sim": 0.6235294342041016, "url": "https://www.pravda.com.ua/eng/news/2022/09/10/7366935/", "title": "Ukrainian army continues to liberate Kharkiv Oblast and southern Ukraine - General Staff report ", "body": "The Armed Forces of Ukraine continue to liberate settlements in Kharkiv Oblast and on the Pivdennyi Buh front.\n\nSource: report of the General Staff of the Armed Forces of Ukraine as of 18:00\n\nQuote: \"The liberation of settlements that were temporarily seized by the Russian invaders in Kharkiv Oblast and on the Pivdennyi Buh front continues. For the safety of our servicemen, official information will be provided later.\"\n\nDetails: The General Staff reports that during the day [of 10 September], the Russian invaders carried out 9 missile and 10 air strikes on military and civilian targets in Ukraine. In particular, the settlements of Slavhorod, Velyka Pysarivka, Velyki Prokhody, Avdiivka, Siversk, Kostiantynivka, Bakhmut, Nevelske, Marinka, Velyka Novosilka, Dnipro, Neskuchne, Vilne Pole, Poltavka, Mali Shcherbaky, Mykolaiv, Bilohiria, Sukhyi Stavok and Bruskynske were affected by occupiers' strikes.\n\nThe Russian forces fired on military and civilian infrastructure from tanks, combat vehicles, mortars, barrel and rocket artillery, in the following areas:\n\nThe Russian forces continue to suffer losses. In particular, as a result of the actions of Ukraine's Defence Forces on the Pivdennyi Buh front, the death toll of the units of the 106th Airborne Division of the Armed Forces of the Russian Federation was more than 58 people in 24 hours.\n\nWe have launched English Twitter! Follow us!\n\nThe command of the occupation forces is taking measures to restore the combat capability of units of their 1st Army Corps by transferring the personnel who survived the fighting to other units. So, according to available information, the remnants of personnel from the so-called Special Forces Khan Battalion were transferred to the 9th Marine Regiment.\n\nAmong the Russian personnel arriving in Ukraine for reinforcement, there has been an increasing number of incidents of self-harm. The Russian leadership is constantly looking for new sources of reserves to replenish active forces, promising a high salary and social benefits; they are trying to recruit \"volunteers\" among retired military personnel in the Kyrgyz Republic through groups on social media.\n\nUkraine's Defence Forces successfully repelled the aggressors' offensive actions in the vicinity of the settlements of Sosnivka, Maiorsk, Mykolaivka Druha, Zaitseve, Vesela Dolyna, Bakhmut, Pervomaiske and Novomykhailivka.\n\nDuring the day [of 10 September], to support the actions of ground troops, the Defence Forces' aviation carried out more than 17 strikes against strongholds and places of concentration of Russian manpower and equipment, as well as against ammunition depots. Air defence units destroyed UAVs and shot down an X-59 guided air-to-ground missile that was in the airspace of the Dnipropetrovsk Oblast.\n\nDuring the psat 24 hours, artillery fire destroyed two command posts, eight areas of concentration of Russian manpower and military equipment, and a Russian pontoon crossing.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/1/c/1cebbab-viyna-genshtab3.jpg", "eventUri": "eng-8008252", "sentiment": -0.1686274509803921, "wgt": 159, "relevance": 1, "stanza_neg": 7, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7184050557", "lang": "eng", "isDuplicate": false, "date": "2022-09-11", "time": "11:11:00", "dateTime": "2022-09-11T11:11:00Z", "dateTimePub": "2022-09-11T11:08:00Z", "dataType": "news", "sim": 0.6117647290229797, "url": "https://www.pravda.com.ua/eng/news/2022/09/11/7366965/", "title": "Russian authorities plan \"mobilisation\" in occupied territories due to their casualties on front - Ukrainian General Staff report", "body": "Due to casualties on the front, the Russian authorities are planning to carry out the \"mobilisation\" of the male population in the temporarily occupied territories. Men have been forbidden to leave populated areas.\n\nSource: General Staff of the Armed Forces of Ukraine\n\nDetails: The occupying authorities are strengthening administrative and police measures in the temporarily occupied territories of Kharkiv and Kherson Oblasts. Entry to and exit from settlements are prohibited, and a curfew has been introduced.\n\nSearches of residential premises were conducted in the Skhidnyi microdistrict in the city of Kherson, from which the Antonivka Road Bridge can be seen. Russian troops warned local residents of Nova Kakhovka and Kozatske that they would shoot to kill if the locals approached the crossings.\n\nDuring the day [of 10 September], the enemy launched 16 missile and 34 airstrikes, affecting 28 settlements, including Slavhorod, Velyka Pysarivka, Velyki Prokhody, Avdiivka, Nevelske, Marinka, Neskuchne, Velyka Novosilka, Dnipro and Bruskinske.\n\nIn the vicinity of Kharkiv, enemy units from the 3rd Motorised Rifle Division of the 20th Combined Arms Army were left without supply routes, and the personnel were in a state of panic.\n\nWe have launched English Twitter! Follow us!\n\nNumerous Russian casualties were reported in the said vicinity. Over 75 wounded Russian soldiers were brought to Valuyki in Belgorod Oblast of the Russian Federation, and over a hundred Russian occupiers were evacuated from Belgorod to Moscow.\n\nThe situation on the Volyn and Polissia fronts has not changed significantly.\n\nThe Russian forces fired from tanks, mortars, tube and rocket artillery in following areas:\n\nUkrainian Defence forces repelled enemy attacks in the areas of the settlements Sosnivka, Maiorsk, Mykolaivka Druha, Zaitseve, Vesela Dolyna, Soledar, Bakhmut, Pisky, Pervomaiske and Novomykhailivka.\n\nUkrainian Air Forces launched 23 strikes. Four air defence systems were destroyed, 4 strong points and 15 places where Russian manpower and equipment were concentrated were hit. In addition, Ukrainian air defence units destroyed two jet aircraft (Su-25 and Su-34), a Ka-52 helicopter, two UAVs and one guided air missile.\n\nTwo unmanned aerial vehicle control points, various strong points, and places where the Russian army's weapons and military equipment were concentrated were also affected. A pontoon crossing and Russian vessels carrying military equipment came under Ukrainian fire.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/0/4/04b94e8-gettyimages-1243076982.png", "eventUri": "eng-8008252", "sentiment": -0.1843137254901961, "wgt": 156, "relevance": 1, "stanza_neg": 5, "stanza_neu": 15, "stanza_pos": 2, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7182638974", "lang": "eng", "isDuplicate": false, "date": "2022-09-09", "time": "21:16:00", "dateTime": "2022-09-09T21:16:00Z", "dateTimePub": "2022-09-09T21:16:00Z", "dataType": "news", "sim": 0.6039215922355652, "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2022-09-09.htm", "title": "\nUkraine", "body": "A number of claims and counterclaims are being made on the Ukraine-Russia conflict on the ground and online. While GlobalSecurity.org takes utmost care to accurately report this news story, we cannot independently verify the authenticity of all statements, photos and videos.\n\nOn 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War. Russian President Vladimir Putin announced a \"special military operation\" (SVO - spetsialnaya voennaya operatsiya) in Ukraine in response to the appeal of the leaders of the \"Donbass republics\" for help. That attack is a blatant violation of the territorial integrity, sovereignty and independence of Ukraine. Putin stressed that Moscow's goal is the demilitarization and denazification of the country. The military buildup in preceeding months makes it obvious that the unprovoked and dastardly Russian attack was deliberately planned long in advance. During the intervening time, the Russian government had deliberately sought to deceive the world by false statements and expressions of hope for continued peace.\n\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\" [Judgment of the International Military Tribunal]\n\nThe UK Ministry of Defence reported that, fighting continues in southern, eastern and northern Ukraine. On 08 September 2022, the military of Belarus, Ukraine's northern neighbour, started routine training exercises to regain territory taken by 'enemy forces' and secure their borders. The exercises are due to last until 14 September 2022.\n\nThe drills will be conducted close to Brest near the Polish border, around the Belarusian capital Minsk and in the north-eastern region of Vitebsk. Although Russia's use of Belarusian territory was instrumental in Russia's failed advance on Kyiv early in the invasion, Belarusian forces have limited offensive capabilities and there is a remote chance that they have deployed forces into Ukraine.\n\nIt is highly unlikely that these exercises are an indication of preparations for direct Belarusian involvement in the Ukraine war.\n\nThe General Staff of the Armed Forces of Ukraine reported that Russia continues to focus its efforts on establishing full control over the territory of the Donetsk oblast, maintaining the temporarily captured districts of the Kherson oblast, part of the Kharkiv, Zaporizhzhya, and Mykolaiv oblasts.\n\nUAV conducts aerial reconnaissance with high intensity. It is trying to improve the tactical position and logistical support of its troops.\n\nDuring the current day, Russian forces launched more than 12 missile and more than 12 air strikes on objects on the territory of Ukraine. To do this, it spent up to forty flyes. In particular, infrastructure was affected in the areas of Velyki Prohody, Starovirivka, Yurivka, Temyrivka, Ternovi Pody, Sukhy Stavok, Barvinok and Bilohirka settlements.\n\nThere remains a further threat of air and missile strikes throughout the territory of Ukraine, in particular from the territory and airspace of the Republic of Belarus. In the Volyn and Polissya directions, the situation remains without significant changes. Command and staff exercises are ongoing in the armed forces of the Republic of Belarus.\n\nIn other directions, Russian forces are shelling military and civilian infrastructure from tanks, combat vehicles, barrel and rocket artillery, namely:\n\nin the Seversky direction - in the areas of the settlements of Senkivka, Bleshnya and Hai of the Chernihiv oblast and Stukalivka, Zapsilya, Khodyne, Myropilske and Velikiy Prikil of the Sumy oblast;\n\nIn the South Buh direction, Russian forces fired from barrel and rocket artillery along the contact line. In addition, it actively conducted aerial reconnaissance by UAVs, made more than 60 flies.\n\nDue to significant losses and reluctance to fight, the morale and psychological condition of the Russian units is significantly deteriorating and the number of deserters is increasing. In the temporarily occupied territory of the Kherson region, in the area of the settlement of Babenkivka Druha, Russian forces were forced to use helicopters and weapons to search for fugitives and return them to combat positions. In addition, through Kalanchak, in the direction of the temporarily occupied Crimea, an intensive movement of unarmed russian soldiers by buses was noted.\n\nUnits of the Ukrainian Defense Forces hold their positions and prevent Russian forces from advancing deep into the territory of Ukraine. Ukrainian soldiers successfully repelled enemy attacks in the areas of Kostyantynivka, Prudyanka, Ruski Tyshky, Virnopillya, Mykolaivka Druha, Zaytseve, Avdiyivka, Kamianka, Pobieda and Bezimenne settlements.\n\nDuring the day, in order to support the actions of the land groupings, the Air Force of the Ukrainian Defense Forces carried out more than 10 strikes, during which combat equipment, anti-aircraft defense equipment and a significant number of personnel were destroyed in strongholds in the Donetsk and South Buh directions.\n\nUkrainian Air defense units destroyed at least 2 enemy UAVs in different directions.\n\nMissile troops and artillery of land groupings continue to carry out the tasks of fire damage to manpower and combat equipment, counter-battery combat, disruption of the enemy's command and control system and logistical support. 3 Russian control points, a pontoon crossing, 28 manpower and military equipment concentration facilities were damaged by fire. Ammunition depots and firing positions of the enemy's artillery fell into the affected area. The results are being verified.\n\nThe Russian Ministry of Defense reported that Director General of the International Atomic Energy Agency (IAEA) Rafael Grossi said that the last operating reactor could be stopped at the Zaporozhye nuclear power plant. Employees of the organization located at the station report that the energy infrastructure that feeds Energodar has been destroyed by shelling. At the same time, operators are not sure that the network can be restored.\n\nEarlier, Ukrainian nationalists fired 27 shells at Energodar. According to the Russian Defense Ministry, the enemy was suppressed by return fire.\n\nIn addition, the Ministry of Defense of the Russian Federation reported on the latest results achieved during the special operation. In the Mykolaiv and Kherson regions, Russian troops inflicted significant damage on the 46th Airmobile Brigade, the 35th Marine Brigade and the 61st Infantry Jaeger Brigade of the enemy. The losses of the neo-Nazis amounted to 270 people, 3 tanks, 11 armored vehicles, 2 cars.\n\nIn Prishib, Kharkiv region and Bakhmut, Donetsk People's Republic (DPR), high-precision weapons hit the control posts of the Kraken nationalist formation and the 93rd mechanized brigade. Also, strikes were made on the places of temporary deployment of units of the 127th territorial defense brigade and the 14th mechanized brigade in the Kharkov region. As a result, over 100 militants were killed, and about 120 more were injured.\n\nEight more command posts in Kharkiv, Dnepropetrovsk, Zaporozhye regions and on the territory of the DPR, 52 artillery units and 153 concentrations of enemy forces were hit by aircraft, missile troops and barreled guns. In addition, the militants lost three weapons depots, a HIMARS multiple launch rocket system and an M-777 howitzer.\n\nThe situation in the LDNR\n\nThe situation in the Donbass was characterized by massive shelling of DPR cities by neo-Nazis. The most difficult situation was observed in the capital of the republic, where at least five citizens were killed in the daytime alone, and there are also victims. Attacks were made on the Voroshilovsky and Petrovsky districts of Donetsk, where there were no military installations.\n\nIn Mariupol , the operations of the International Mine Action Center of the RF Armed Forces continue, the sappers of which have neutralized more than 300 explosive objects in two agricultural fields in the vicinity of the city . Most of the discovered mines are anti-tank TM-62M. All ammunition found was destroyed by overhead charges.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8008252", "sentiment": -0.192156862745098, "wgt": 154, "relevance": 1, "stanza_neg": 18, "stanza_neu": 42, "stanza_pos": 1, "swn_neg": 61, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]