[{"uri": "7096131189", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "11:22:00", "dateTime": "2022-06-29T11:22:00Z", "dateTimePub": "2022-06-29T11:00:00Z", "dataType": "news", "sim": 0.9176470637321472, "url": "https://uk.investing.com/news/world-news/pope-ukraine-shopping-centre-bombing-the-latest-barbarous-attack-2677948", "title": "Pope: Ukraine shopping centre bombing the latest 'barbarous' attack By Reuters", "body": "VATICAN CITY (Reuters) - Pope Francis on Wednesday called the bombing of a crowded shopping centre in the city of Kremenchuk the latest in string of \"barbarous attacks\" against Ukraine.\n\nUkraine said at least 18 people were killed and about 60 injured on Monday by a Russian missile strike. Russia's defence ministry said it had hit a legitimate military target in the city, and that the shopping centre was not in use.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping centre in Kremenchuk,\" Francis told crowds in St. Peter's Square (NYSE:SQ) on the feast of St. Peter and Paul.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace.\n\n\"May the Lord open the those paths to dialogue which men either do not want or not able to find. May they not neglect to help the Ukrainian population, which is suffering so much,\" he said.", "source": {"uri": "uk.investing.com", "dataType": "news", "title": "Investing.com UK"}, "authors": [], "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEI5S0GU_M.jpg", "eventUri": "eng-7820773", "sentiment": -0.2705882352941177, "wgt": 234, "relevance": 1, "stanza_neg": 3, "stanza_neu": 3, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096179468", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "12:01:00", "dateTime": "2022-06-29T12:01:00Z", "dateTimePub": "2022-06-29T11:07:00Z", "dataType": "news", "sim": 0.9176470637321472, "url": "https://www.sabcnews.com/sabcnews/ukraine-shopping-centre-bombing-the-latest-barbarous-attack-pope/", "title": "Ukraine shopping centre bombing the latest 'barbarous' attack: Pope - SABC News - Breaking news, special reports, world, business, sport coverage of all South African current events. Africa's news leader.", "body": "Image: Reuters Pope Francis arrives for the Mass of Saint Peter and Paul in St Peter's Basilica, at the Vatican, June 29, 2022.\n\nPope Francis on Wednesday called the bombing of a crowded shopping centre in the city of Kremenchuk the latest in string of \"barbarous attacks\" against Ukraine.\n\nUkraine said at least 18 people were killed and about 60 injured on Monday by a Russian missile strike. Russia's defence ministry said it had hit a legitimate military target in the city, and that the shopping centre was not in use.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping centre in Kremenchuk,\" Francis told crowds in St. Peter's Square on the feast of St. Peter and Paul.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace.\n\n\"May the Lord open those paths to dialogue which men either do not want or not able to find. May they not neglect to help the Ukrainian population, which is suffering so much,\" he said.", "source": {"uri": "sabcnews.com", "dataType": "news", "title": "SABC News - Breaking news, special reports, world, business, sport coverage of all South African current events. Africa's news leader."}, "authors": [], "image": "https://www.sabcnews.com/sabcnews/wp-content/uploads/2022/06/SABC-News-Pope-Reuters.jpg", "eventUri": "eng-7820773", "sentiment": -0.2392156862745098, "wgt": 234, "relevance": 1, "stanza_neg": 3, "stanza_neu": 4, "stanza_pos": 1, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096096246", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "10:56:00", "dateTime": "2022-06-29T10:56:00Z", "dateTimePub": "2022-06-29T10:53:00Z", "dataType": "news", "sim": 0.8745098114013672, "url": "https://www.devdiscourse.com/article/law-order/2091180-pope-ukraine-shopping-centre-bombing-the-latest-barbarous-attack", "title": "Pope: Ukraine shopping centre bombing the latest 'barbarous' attack | Law-Order", "body": "Ukraine said at least 18 people were killed and about 60 injured on Monday by a Russian missile strike. Russia's defence ministry said it had hit a legitimate military target in the city, and that the shopping centre was not in use. \"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping centre in Kremenchuk,\" Francis told crowds in St. Peter's Square on the feast of St. Peter and Paul.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace. \"May the Lord open the those paths to dialogue which men either do not want or not able to find. May they not neglect to help the Ukrainian population, which is suffering so much,\" he said.\n\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)", "source": {"uri": "devdiscourse.com", "dataType": "news", "title": "Devdiscourse"}, "authors": [], "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_19_06_09_904154.jpg?width=920&format=jpeg", "eventUri": "eng-7820773", "sentiment": -0.207843137254902, "wgt": 223, "relevance": 1, "stanza_neg": 4, "stanza_neu": 2, "stanza_pos": 1, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096369857", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "14:27:00", "dateTime": "2022-06-29T14:27:00Z", "dateTimePub": "2022-06-29T14:20:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.catholicnewsagency.com/news/251670/pope-francis-condemns-barbaric-attack-on-ukraine-mall", "title": "Pope Francis condemns 'barbaric attack' on Ukraine mall", "body": "Pope Francis condemned an attack on a shopping mall in Kremenchuk, central Ukraine, as \"barbaric,\" during a public address on Wednesday.\n\n\"I carry in my heart every day the dear and tormented Ukraine, which continues to be plagued by barbaric attacks, such as the one that struck the Kremenchuk shopping center,\" the pope said on June 29.\n\nA Russian missile strike hit a shopping mall in Kremenchuk on June 27. Ukrainian authorities said the next day that at least 18 people were killed in the attack and another 36 were missing.\n\n\"I pray that this foolish war may soon see an end, and I renew the invitation to persevere, without tiring, in the prayer for peace: may the Lord open those paths of dialogue that men are unwilling or unable to find,\" he said. \"And let us not neglect to come to the aid of the Ukrainian people, who are suffering so much.\"", "source": {"uri": "catholicnewsagency.com", "dataType": "news", "title": "Catholic News Agency"}, "authors": [], "image": "https://www.catholicnewsagency.com/storage/image/ukraine-supermarket.jpg?w=4096&jpg", "eventUri": "eng-7820773", "sentiment": -0.3725490196078431, "wgt": 188, "relevance": 1, "stanza_neg": 2, "stanza_neu": 3, "stanza_pos": 1, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7096180490", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "12:02:00", "dateTime": "2022-06-29T12:02:00Z", "dateTimePub": "2022-06-29T12:02:00Z", "dataType": "news", "sim": 0.7176470756530762, "url": "https://www.independent.co.uk/news/world/europe/russian-missile-ukraine-shopping-centre-hit-b2111892.html", "title": "Moment Russian missile hits Ukrainian shopping centre captured on camera", "body": "Footage of the moment a deadly Russian missile hit a shopping centre in the Ukrainian city of Kremenchuk has been shared by the country's president Volodymyr Zelensky.\n\nThe strike killed at least 18 people died in the shopping centre alone. Another 59 were injured and 25 were hospitalised while a further 36 people are thought to be missing.\n\nMr Zelensky posted the harrowing video as part of his evening address, in which he claimed a total of 2,811 missiles have been launched against cities across the war-torn nation.\n\nThe footage shows a huge plume of black smoke covering the centre immediately after the missile makes contact.\n\n\"The Russian missile hit this object, purposefully. They wanted to kill as many people as possible in a peaceful city, in a regular shopping mall,\" Mr Zelensky said.\n\nOn Wednesday, Pope Francis called the bombing the latest in string of \"barbarous attacks\" against Ukraine.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping centre in Kremenchuk,\" Francis told crowds in St. Peter's Square on the feast of St. Peter and Paul.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace.\n\nAccording to those clearing rubble at the site, 60 per cent of the mall was destroyed by the strike with over 400 workers assisting in the effort.\n\nThe UK Ministry of Defence said in an intelligence update on Wednesday that there is a \"realistic possibility\" that the shopping mall strike was accidental as the missile had been intended for a \"nearby infrastructure target\".\n\nThe statement added: \"Russia's shortage of more modern precision strike weapons and the professional shortcomings of their targeting planners will highly likely result in further civilian casualties.\"\n\nMoscow's defence ministry said on Tuesday that the blaze at the mall was caused by the \"detonation of stored ammunition for western weapons\", said Moscow's defence ministry, but provided no evidence to back up its claim.\n\nIt added: \"On 27 June, in the city of Kremenchuk, the Russian aerospace forces delivered a strike with high-precision air-based weapons on hangars with weapons and ammunition received from the United States and European countries.\n\nAs a result of a high-precision strike, western-made weapons and ammunition concentrated in a storage area for further shipment to the Ukrainian group of troops in Donbas were hit. The detonation of stored ammunition for western weapons caused a fire in a non-functioning shopping centre located next to the plant.\"", "source": {"uri": "independent.co.uk", "dataType": "news", "title": "The Independent"}, "authors": [], "image": "https://static.independent.co.uk/2022/06/29/11/fire%2010.PNG?quality=75&width=1200&auto=webp", "eventUri": "eng-7820773", "sentiment": -0.1764705882352942, "wgt": 183, "relevance": 1, "stanza_neg": 8, "stanza_neu": 7, "stanza_pos": 2, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096610494", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "17:54:00", "dateTime": "2022-06-29T17:54:00Z", "dateTimePub": "2022-06-29T17:40:00Z", "dataType": "news", "sim": 0.7137255072593689, "url": "https://www.ukrinform.net/rubric-society/3518201-pope-decries-barbaric-attacks-in-ukraine.html", "title": "Pope decries 'barbaric' attacks in Ukraine", "body": "At the Angelus address on the Feast of Sts Peter and Paul, Pope Francis has decried the bombing of the Kremenchuk shopping center in Ukraine as the latest in a series of \"barbaric\" attacks on Ukraine.\n\n\"Every day,\" the Pope reflected, \"I carry in my heart the dear and tormented Ukraine, which continues to be scourged by barbaric attacks, such as the one that struck the Kremenchuk shopping center.\"\n\nThe pontiff added that he prays that \"this mad war may soon see an end\" and that the Lord \"open paths of dialogue that men are unwilling or unable to find!\"\n\nThe Holy Father called for nations to come to the assistance of the Ukrainian people, \"who are suffering so much.\"\n\nAs Ukrinform reported, on June 27, two Russian missiles hit Kremenchuk, Poltava region. One of them hit a busy shopping mall.\n\nDeputy Head of the Presidential Office Kyrylo Tymoshenko said more than 20 people were killed and 59 were injured as a result of the attack.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_03/thumb_files/630_360_1647404160-142.jpg", "eventUri": "eng-7820773", "sentiment": -0.403921568627451, "wgt": 182, "relevance": 1, "stanza_neg": 2, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7097550202", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "11:35:00", "dateTime": "2022-06-30T11:35:00Z", "dateTimePub": "2022-06-30T11:06:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://www.econotimes.com/Russia-Ukraine-conflict-Pope-Francis-condemns-Russian-strike-on-Kremenchuk-shopping-center-1636500", "title": "Russia-Ukraine conflict: Pope Francis condemns Russian strike on Kremenchuk shopping center - EconoTimes", "body": "The latest deadly incident in Russia's war with Ukraine was its missile strike on a shopping center in Kremenchuk. Pope Francis recently condemned the strike that killed over a dozen people, calling it the latest in Russia's string of \"barbarous\" attacks.\n\nThe Pontiff Wednesday condemned the Russian missile strike on a shopping center in the Ukrainian city of Kremenchuk. Authorities said around 18 people were killed in the attack that took place Monday, and at least 60 people were injured.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping center in Kremenchuk,\" Pope Francis told the crowds in St. Peter's Square as the church celebrated the feast days of St. Peter and St. Paul.\n\n\"I pray this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace,\" said the Pontiff. \"May the Lord open those paths to dialogue which men either do not want or not able to find. May they not neglect to help the Ukrainian population, which is suffering so much.\"\n\nRussia's defense ministry claimed it hit a legitimate military target and that the shopping center was vacant.\n\nThe war Russian dictator Vladimir Putin is waging on Ukraine is in its fourth month, and Putin said Wednesday that Moscow will issue a response should the NATO alliance set up infrastructure in Finland and Sweden after they join the military alliance.\n\nPutin added that relations between Moscow, Helsinki, and Stockholm would ultimately sour when the two neutral countries decided to join NATO.\n\nPutin's comments follow the move by NATO member Turkey to lift its veto over Finland and Sweden's bid to join the alliance, clearing the way for membership after the three countries agreed to protect each other's security.\n\nThe Russian dictator reiterated the objectives of what he called a special \"military operation\" in Ukraine, that its goal was to \"liberate\" the Donbas region that was occupied by pro-Russia separatists. Putin added that there was no need to set a deadline for the so-called military operation.", "source": {"uri": "econotimes.com", "dataType": "news", "title": "EconoTimes"}, "authors": [], "image": "https://s1.econotimes.com/assets/uploads/202206307440c5d05612d4e68_th_1024x0.jpg", "eventUri": "eng-7820773", "sentiment": -0.3803921568627451, "wgt": 177, "relevance": 1, "stanza_neg": 5, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7097947480", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "16:47:00", "dateTime": "2022-06-30T16:47:00Z", "dateTimePub": "2022-06-30T16:46:00Z", "dataType": "news", "sim": 0.6823529601097107, "url": "https://uk.news.yahoo.com/moment-russian-missile-hits-ukrainian-113151426.html", "title": "Moment Russian missile hits Ukrainian shopping centre captured on camera", "body": "Images of the moment a deadly Russian missile hit a shopping centre in the central Ukrainian city of Kremenchuk has been shared by the country's president Volodymyr Zelensky.\n\nThe strike killed at least 18 in the shopping centre alone. Another 59 were injured and 25 were hospitalised while a further 36 people are thought to be missing.\n\nMr Zelensky posted the harrowing video in an address in which he also claimed a total of 2,811 missiles have been launched against cities across the war-torn nation in a single day.\n\nThe footage shows a huge plume of black smoke covering the centre immediately after the missile makes contact.\n\n\"The Russian missile hit this object, purposefully. They wanted to kill as many people as possible in a peaceful city, in a regular shopping mall,\" Mr Zelensky said.\n\nIt came as Ukraine carried out its biggest exchange of prisoners of war since Russia invaded, securing the release of 144 of its soldiers, including 95 who defended Mariupol's steelworkers, Ukraine's military intelligence agency said.\n\nThe majority of the Ukrainians were badly wounded, suffering from gunshot and shrapnel wounds, blast traumas, burns, fractured bones and amputated limbs, the agency known by the acronym GUR said in a statement on Telegram.\n\nThe prisoner swap included the handover of 43 members of the Azov regiment, a National Guard unit that Russia says is a dangerous far-right battalion, a promising sign for Ukrainians hoping for the release of other fighters from the unit.\n\nAlso on Wednesday, Pope Francis called the bombing the latest in string of \"barbarous attacks\" against Ukraine.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping centre in Kremenchuk,\" Francis told crowds in St Peter's Square on the feast of St Peter and Paul.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace.\"\n\nAccording to those clearing rubble at the site, 60 per cent of the mall was destroyed by the strike with over 400 workers assisting in the effort.\n\nThe Ministry of Defence (MOD) said in an intelligence update on Wednesday that there is a \"realistic possibility\" that the shopping mall strike was accidental as the missile had been intended for a \"nearby infrastructure target\".\n\nThe statement added: \"Russia's shortage of more modern precision strike weapons and the professional shortcomings of their targeting planners will highly likely result in further civilian casualties.\"\n\nMoscow's defence ministry said on Tuesday that the blaze at the mall was caused by the \"detonation of stored ammunition for western weapons\", said Moscow's defence ministry, but provided no evidence to back up its claim.\n\nIt added: \"On 27 June, in the city of Kremenchuk, the Russian aerospace forces delivered a strike with high-precision air-based weapons on hangars with weapons and ammunition received from the United States and European countries.\n\nAs a result of a high-precision strike, western-made weapons and ammunition concentrated in a storage area for further shipment to the Ukrainian group of troops in Donbas were hit. The detonation of stored ammunition for western weapons caused a fire in a non-functioning shopping centre located next to the plant.\"", "source": {"uri": "uk.news.yahoo.com", "dataType": "news", "title": "Yahoo News UK"}, "authors": [], "image": "https://s.yimg.com/uu/api/res/1.2/HH03dOhdCm0n8P9G_q.y1g--~B/aD02NzY7dz0xMjAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_independent_577/f3aa1cabdac44d2028c5a849e9fda280", "eventUri": "eng-7820773", "sentiment": -0.2549019607843137, "wgt": 174, "relevance": 1, "stanza_neg": 8, "stanza_neu": 10, "stanza_pos": 2, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096169431", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "11:53:00", "dateTime": "2022-06-29T11:53:00Z", "dateTimePub": "2022-06-29T10:08:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://www.vaticannews.va/en/pope/news/2022-06/pope-at-angelus-lets-imitate-saints-peter-paul-in-faith1.html", "title": "Pope decries 'barbaric' attacks in Ukraine, prays for end to war - Vatican News", "body": "At the Angelus address on the Feast of Sts Peter and Paul, Pope Francis decries the bombing of the Kremenchuk shopping centre, and prays that God might open the path to dialogue as the war wages on in Ukraine.\n\nBy Deborah Castellano Lubov\n\nPope Francis has appealed for dialogue and an end to the war in \"dear and tormented Ukraine, which continues to be scourged by barbaric attacks.\"\n\nAfter praying the Angelus prayer, Pope Francis made this appeal on the 29 June Feast of Saints Peter and Paul.\n\n\"Every day,\" the Pope reflected, \"I carry in my heart the dear and tormented Ukraine, which continues to be scourged by barbaric attacks, such as the one that struck the Kremenchuk shopping centre.\"\n\nPraying for an end to the war\n\nAt least 18 people were killed on Monday in what Kyiv said was a direct Russian missile strike against the busy shopping centre in Kremenchuk.\n\nThe G7 called the strike a Russian war crime, while Ukrainian President Volodymyr Zelensky accused Russia of directly targeting civilians.\n\nMoscow on Tuesday rejected those accounts, saying it had hit a legitimate military target in the city, and that the shopping centre was not in use.\n\nThe Holy Father called for nations to come to the assistance of the Ukrainian people, \"who are suffering so much.\"\n\n\"I pray that this mad war may soon see an end, and I renew the invitation to persevere, without tiring, in prayer for peace: may the Lord open paths of dialogue that men are unwilling or unable to find!\"\n\nNot a 'fad' to protect Creation, a responsibility\n\nSeparately, the Pope also appealed for protecting the environment following serious fires that broke out in Rome in recent days, as the Italian capital smoulders in extreme heat.\n\nPointing out that \"in many places, drought is now a serious problem, which is causing serious damage to production activities and the environment,\" the Pope expressed his hope \"that the necessary measures will be put in place to deal with these emergencies and to prevent future emergencies.\"\n\n\"\"All this must make us reflect on the protection of Creation, which is our responsibility, the responsibility of each one of us. It is not a fad, but a responsibility: the future of the earth is in our hands and our decisions!\"\"", "source": {"uri": "vaticannews.va", "dataType": "news", "title": "vaticannews.va"}, "authors": [], "image": "https://www.vaticannews.va/content/dam/vaticannews/agenzie/images/afp/2022/06/28/18/1656432032075.jpg/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg", "eventUri": "eng-7820773", "sentiment": -0.3019607843137255, "wgt": 166, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096305124", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "13:39:00", "dateTime": "2022-06-29T13:39:00Z", "dateTimePub": "2022-06-29T13:33:00Z", "dataType": "news", "sim": 0.6235294342041016, "url": "https://catholicphilly.com/2022/06/news/world-news/pope-condemns-barbaric-attack-on-shopping-center-in-ukraine/", "title": "Pope condemns 'barbaric' attack on shopping center in Ukraine", "body": "By Junno Arocho Esteves * Catholic News Service * Posted June 29, 2022\n\nVATICAN CITY (CNS) -- Pope Francis again pleaded for an end to hostilities in Ukraine after missiles struck a shopping center filled with people.\n\n\"I carry in my heart every day the dear and tormented Ukraine, which continues to be scourged by barbaric attacks, like the one that struck the Kremenchuk shopping center,\" the pope said June 29 after praying the Angelus prayer with pilgrims gathered in St. Peter's Square.\n\nAccording to the Ukrainian government, an estimated 1,000 people were inside the mall June 27 when two missiles struck it, killing at least 20 people.\n\nIn a message posted to the messaging app Telegram, Kyrylo Tymoshenko, deputy head of Ukraine's presidential office, blamed the \"insidious missile strike\" on Russian forces.\n\n\"More than 20 are already known to have been killed and 59 wounded,\" Tymoshenko said, according to news reports. \"There are also more than 40 statements from relatives about missing people who may have been in the mall during the shelling.\"\n\nThe attack also drew condemnation from G-7 leaders who were meeting in Germany at the time of the attack.\n\nRussia, however, denied striking the shopping center. In a statement published the day after the attack, Russia's defense ministry said its forces \"struck a weapons depot storing arms received from the United States and Europe with high-precision air-based weapons.\"\n\n\"The detonation of stored ammunition for Western weapons caused a fire in a non-functioning shopping center located next to the depot,\" the statement said, according to the Reuters news agency.\n\nPope Francis renewed his call for peace and called on Christians to \"not neglect to come to the aid of the Ukrainian people, who are suffering so much.\"\n\n\"I pray that this senseless war may soon come to an end, and I renew the invitation to persevere, tirelessly, in prayer for peace: May the Lord open those paths of dialogue that men are unwilling or unable to find!\"", "source": {"uri": "catholicphilly.com", "dataType": "news", "title": "Catholic Philly"}, "authors": [], "image": "https://catholicphilly.com/media-files/2022/03/20220313T0815-POPE-UKRAINE-PROFANE-1523177-796x502.jpg", "eventUri": "eng-7820773", "sentiment": -0.5058823529411764, "wgt": 159, "relevance": 1, "stanza_neg": 5, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096591551", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "17:37:00", "dateTime": "2022-06-29T17:37:00Z", "dateTimePub": "2022-06-29T17:31:00Z", "dataType": "news", "sim": 0.5960784554481506, "url": "https://censor.net/en/news/3351094/pope_calls_kremenchuk_shopping_mall_shelling_barbaric_attack", "title": "Pope calls Kremenchuk shopping mall shelling barbaric attack", "body": "Pope Francis, speaking in St. Peter's Square on the occasion of Apostles Peter and Paul Day, called the rocket attack on a shopping mall in the Ukrainian city of Kremenchuk a barbaric attack.\n\nAccording to Censor.NЕТ, this is stated by Ukrinform with reference to Reuters.\n\n\"Every day I carry in my heart the dear and long-suffering Ukraine, which continues to be afflicted by barbaric attacks like the one that happened to the shopping center in Kremenchuk,\" the pontiff said.\n\nHe added that he prays that this crazy war, he said, will end as soon as possible, and that those responsible, who \"are unwilling or unable\" to find dialogue, will not avoid helping the suffering Ukrainians.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1.censor.net/images/6/1/c/d/61cdebee0febea541c6de8c1c516d58c/censor_social.jpg", "eventUri": "eng-7820773", "sentiment": -0.3725490196078431, "wgt": 152, "relevance": 1, "stanza_neg": 1, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 4, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7098177856", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "20:47:00", "dateTime": "2022-06-30T20:47:00Z", "dateTimePub": "2022-06-30T20:46:00Z", "dataType": "news", "sim": 0.5843137502670288, "url": "https://www.breitbart.com/faith/2022/06/30/pope-francis-condemns-insane-war-barbaric-attacks-in-ukraine/", "title": "Pope Francis Condemns 'Insane War,' 'Barbaric Attacks' in Ukraine", "body": "ROME -- Pope Francis has once again condemned the Russian war on \"dear and tormented\" Ukraine, calling for prayers and aid for the besieged nation.\n\n\"Every day I carry in my heart the dear and tormented Ukraine, which continues to be scourged by barbaric attacks, like the one that struck the Kremenchuk shopping centre,\" the pontiff said after his Angelus prayer in the Vatican Wednesday.\n\n\"I pray that this insane war may soon see an end, and I renew the invitation to persevere, without tiring, in prayer for peace: may the Lord open those paths of dialogue that men are unwilling or unable to find!\" he said.\n\n\"And let us not neglect to come to the aid of the Ukrainian people, who are suffering so much,\" Francis concluded.\n\nThe pope was referring to Tuesday's Russian missile strike on a crowded mall in the central Ukrainian city of Kremenchuk, which claimed the lives of at least 16 civilians.\n\n\"The Russian strike today on the shopping centre in Kremenchuk is one of the most brazen terrorist acts in European history,\" Ukrainian President Volodymyr Zelensky said following the attack.\n\nPope Francis has been criticized for his unwillingness to call out Russian aggression by name, and for his refusal to acknowledge guilty and innocent parties in the conflict.\n\nIn an interview with the Jesuit journal La Civiltà Cattolica published earlier this month, the pope said there were no \"good guys\" and \"bad guys\" in the war and suggested that a number of factors, including \"barking\" by NATO and the international arms trade, had provoked Russia's aggression.\n\nThe pope said he is \"against reducing complexity to the distinction between good guys and bad guys without reasoning about roots and interests, which are very complex.\"\n\n\"What is before our eyes is a situation of world war, global interests, arms sales and geopolitical appropriation, which is martyring a heroic people,\" he asserted.\n\nIn a pointed response, Ukrainian Major Archbishop Sviatoslav Shevchuk asserted that Russia had not been \"provoked\" into invading Ukraine and that the causes of the war \"lie within Russia itself.\"\n\n\"We see and know, experiencing here in Ukraine, that Russia's aggression against Ukraine is completely unprovoked,\" the archbishop said. \"Anyone who thinks that some external cause has provoked Russia into military aggression is either themselves in the grip of Russian propaganda or is simply and deliberately deceiving the world.\"", "source": {"uri": "breitbart.com", "dataType": "news", "title": "Breitbart"}, "authors": [{"uri": "thomas_d_williams@breitbart.com", "name": "Thomas D. Williams", "type": "author", "isAgency": false}], "image": "https://media.breitbart.com/media/2022/06/pope-responds-to-ukraine.jpg", "eventUri": "eng-7820773", "sentiment": -0.3725490196078431, "wgt": 149, "relevance": 1, "stanza_neg": 3, "stanza_neu": 9, "stanza_pos": 1, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096784075", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "21:10:00", "dateTime": "2022-06-29T21:10:00Z", "dateTimePub": "2022-06-29T21:09:00Z", "dataType": "news", "sim": 0.572549045085907, "url": "https://www.dailyfinland.fi/europe/27924/144-Ukrainian-soldiers-freed-in-prisoner-swap", "title": "144 Ukrainian soldiers freed in prisoner swap", "body": "Ukrainian intelligence said 144 soldiers, including dozens who fought at the Azovstal steelworks in the southern city of Mariupol, have been freed in a prisoner swap with Russia, reported DW, quoting news agencies AP, AFP, Reuters and dpa.\n\n\"This is the largest exchange since the start of the full-scale Russian invasion. Of the 144 freed, 95 are Azovstal defenders,\" the intelligence directorate of Ukraine's Defense Ministry said on Telegram.\n\nPro-Russian separatist leader Denis Pushilin said 144 soldiers from Russia and the Donetsk People's Republic -- the name of the breakaway region recognized by Moscow -- had \"returned home\".\n\nHundreds of Ukrainians sheltered in the Azovstal steel plant during Moscow's bombardment of Mariupol, but they were taken into Russian custody after surrendering in mid-May.\n\nThree Belarusian activists \"could face the death penalty\" after being charged with carrying out railway sabotage in Belarus to impede Russian troops during the early stages of Moscow's invasion of Ukraine, Minsk investigators said Wednesday.\n\nThe men were accused of terrorism after being arrested on March 1 for setting fire to relay boxes on the railway network at night, the Belarusian Investigative Committee said on its website as it completed the three-month probe.\n\nMeanwhile, Pope Francis has condemned the bombing of a shopping mall in the city of Kremenchuk.\n\nUkraine said at least 18 people were killed and around 60 wounded in Monday's missile strike.\n\nMoscow's Defense Ministry said it had hit a legitimate military target, and that the mall was not in use.\n\n\"Every day, I carry in my heart dear and martyred Ukraine, which continues to be flagellated by barbarous attacks like the one that hit the shopping center in Kremenchuk,\" Pope Francis told those gathered St. Peter's Square.\n\n\"I pray that this mad war can soon end and I renew my appeal to persevere without tiring in praying for peace.\"\n\n\"May the Lord open the those paths to dialogue which men either do not want or not able to find. May they not neglect to help the Ukrainian population, which is suffering so much.\"", "source": {"uri": "dailyfinland.fi", "dataType": "news", "title": "clickittefaq"}, "authors": [], "image": "https://www.dailyfinland.fi/assets/news_photos/2022/06/29/image-27924.jpg", "eventUri": "eng-7820773", "sentiment": -0.207843137254902, "wgt": 146, "relevance": 1, "stanza_neg": 6, "stanza_neu": 7, "stanza_pos": 1, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]