[{"uri": "7004771763", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "08:45:00", "dateTime": "2022-04-15T08:45:00Z", "dateTimePub": "2022-04-15T08:44:00Z", "dataType": "news", "sim": 0.8509804010391235, "url": "https://metro.co.uk/2022/04/15/ukraine-russian-state-tv-warns-world-war-three-has-already-begun-16472787/", "title": "Russian state TV declares World War Three has started after sinking of Moskva", "body": "Russian state TV says World War Three has already started after the sinking of the Moskva.\n\nThe Kremlin's main propaganda mouthpiece went into meltdown last night after the flagship of the Black Sea Fleet was taken out.\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation which would be one of Kyiv's biggest military successes since the invasion began.\n\nBut Kyiv was struck by rockets overnight, a sign Vladimir Putin intends to punish Ukraine for the downing of the prized naval asset.\n\nOlga Skabeyeva, one of Russia 1's leading propagandists, told viewers: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nA guest on the show likened the sinking of the Moskva to an attack on Russian soil, despite the Kremlin's insistence went down because of a fire.\n\nHe also used the word 'war', banned in Russia, and had to be reminded of the government-approved terminology 'special military operation'.", "source": {"uri": "metro.co.uk", "dataType": "news", "title": "Metro"}, "authors": [{"uri": "sean_seddon@metro.co.uk", "name": "Sean Seddon", "type": "author", "isAgency": false}], "image": "https://metro.co.uk/wp-content/uploads/2022/04/SEC_98898726_1650012317.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "eventUri": "eng-7641352", "sentiment": -0.0980392156862745, "wgt": 217, "relevance": 1, "stanza_neg": 4, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004789866", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "09:03:00", "dateTime": "2022-04-15T09:03:00Z", "dateTimePub": "2022-04-15T08:58:00Z", "dataType": "news", "sim": 0.8117647171020508, "url": "https://wstale.com/world/russian-state-tv-declares-world-war-three-has-started-after-sinking-of-moskva/", "title": "Russian state TV declares World War Three has started after sinking of Moskva - WSTale.com", "body": "To view this video please enable JavaScript, and consider upgrading to a webbrowser thatsupports HTML5video\n\nRussian state TV says World War Three has already started after the sinking of the Moskva.\n\nThe Kremlin's main propaganda mouthpiece went into meltdown last night after the flagship of the Black Sea Fleet was taken out.\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation which would be one of Kyiv's biggest military successes since the invasion began.\n\nBut the capital was struck by rockets overnight, a sign Vladimir Putin intends to punish Ukraine for the downing of the prized naval asset.\n\nThe city has been spared arial bombardment since Russian troops pulled out of the north but there were strikes against Kyiv, Kharkiv and locations further west.\n\nRussia 1, a Kremlin mouthpiece which has championed the war, came close to acknowledging Ukraine sunk the Moskva by demanding a crushing response.\n\nOlga Skabeyeva, one of Vladimir Putin's leading propagandists, told viewers Western support amounted to direct conflict with Russia, saying: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nA guest on the show likened the sinking of the Moskva to an attack on Russian soil, despite the Kremlin's insistence went down because of a fire.\n\nHe also used the word 'war', banned in Russia, and had to be reminded of the government-approved terminology 'special military operation'.\n\nThis is a breaking news story, more to follow soon... Check back shortly for further updates.\n\nGot a story? Get in touch with our news team by emailing us at [email protected] Or you can submit your videos and pictures here.\n\nFor more stories like this, check our news page.", "source": {"uri": "wstale.com", "dataType": "news", "title": "WSTale.com"}, "authors": [], "image": "https://wstale.com/wp-content/uploads/2022/04/Russian-state-TV-declares-World-War-Three-has-started-after-sinking-of-Moskva.jpg", "eventUri": "eng-7641352", "sentiment": -0.1215686274509804, "wgt": 207, "relevance": 1, "stanza_neg": 7, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005023227", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "12:47:00", "dateTime": "2022-04-15T12:47:00Z", "dateTimePub": "2022-04-15T12:40:00Z", "dataType": "news", "sim": 0.8078431487083435, "url": "https://www.joe.ie/news/world-war-three-russia-ukraine-746365", "title": "Russian state TV warns World War Three has already begun | JOE.ie", "body": "Olga Skabeyeva claimed Russia is 'definitely fighting against NATO'.\n\nRussian state TV has claimed that World War Three has already started after the sinking of Vladimir Putin's warship, Moskva, and amid suggestions, NATO is \"definitely\" involved in the conflict.\n\nThe Kremlin's main propaganda mouthpiece went into overdrive after a Ukrainian missile stuck what was the flagship of Russia's Black Sea Fleet on Wednesday, 13 April.\n\nSpeaking on Russian state TV, Olga Skabeyeva - known as 'the Iron Doll of Putin' for her harsh criticism of Russian critics - told viewers World Was Three is already underway.\n\nWhile referring to Russia's invasion of Ukraine as the \"special operation\", Skabeyeva told viewers the situation had become far more dire:\n\n\"One can safely call what it has escalated into World War Three. That's absolutely for sure.\"\n\n\"Right now, we're definitely fighting against NATO infrastructure, if not NATO itself. We need to recognise that.\"\n\nA guest on the show likened the sinking of the Moskva to an attack on Russian soil.\n\nHe also used the word \"war\", banned in Russia, and had to be reminded of the government-approved terminology \"special military operation\", Metro reported.\n\nThe 12,490-tonne Moskva is the biggest Russian warship to be sunk in action since World War Two, the BBC noted in a report confirming the vessel's sinking.\n\nRussia has confirmed the Moskva has sunk - after earlier claiming it was still afloat - but said it was due to \"stormy seas\".\n\nWhile Kyiv said its missiles hit the Moskva, Moscow has not acknowledged any attack, with its defence ministry saying the vessel sank after a fire.\n\nThe blaze caused the explosion of the warship's ammunition, Russia says. It said the Moskva's entire crew was evacuated to nearby Russian vessels in the Black Sea.\n\nOn Friday, it was reported that Russia had hit back, blitzing a factory said to have made the missiles that sunk their prized warship.", "source": {"uri": "joe.ie", "dataType": "news", "title": "JOE.ie"}, "authors": [], "image": "https://img.maximummedia.ie/joe_ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL20wLmpvZS5jby51a1xcXC93cC1jb250ZW50XFxcL3VwbG9hZHNcXFwvMjAyMlxcXC8wNFxcXC8xNTEwNDEyMVxcXC9hLXd3My1zcGxpdC5wbmdcIixcIndpZHRoXCI6NjQ3LFwiaGVpZ2h0XCI6MzQwLFwiZGVmYXVsdFwiOlwiaHR0cHM6XFxcL1xcXC93d3cuam9lLmllXFxcL2Fzc2V0c1xcXC9pbWFnZXNcXFwvam9lXFxcL25vLWltYWdlLnBuZz9pZD0yNjRhMmRiZTM3MGYyYzY3NWZjZFwiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJhYmE4MDk1YTRmYzkwYzg0YjE5MmE4MzY5NGM2Y2FmMGExMGU1NDQ2In0=/a-ww3-split.png", "eventUri": "eng-7641352", "sentiment": -0.2705882352941177, "wgt": 206, "relevance": 1, "stanza_neg": 4, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005746674", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "05:58:00", "dateTime": "2022-04-16T05:58:00Z", "dateTimePub": "2022-04-16T05:52:00Z", "dataType": "news", "sim": 0.7960784435272217, "url": "https://thenewsguru.com/news/watch-russian-state-tv-declares-world-war-iii/", "title": "[Watch] Russian State TV declares World War III", "body": "Russian state television has declared that World War III has already started after the sinking of its naval vessel Moskva in the Ukraine war.\n\nThough Russia said this was damaged after a fire, Ukraine claimed the credit of destroying the flagship vessel of Moscow's Black Sea Fleet through its Neptune missile.\n\nBut the sinking of the ship led to meltdown on the Kremlin's main propaganda mouthpiece Russia 1. Presenter Olga Skabeyeva made the chilling statement, informing the viewers that \"what it's escalated into can safely be called World War III\" and insisted \"that's entirely for sure.\"\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that,\" Skabeyeva further said, according to Metro.\n\nA guest on the show compared the sinking of Moskva to an attack on Russian soil, despite Kremlin insisting that it went down because of a fire.\n\nThe man was reminded that instead of calling it a war, the government-approved phrase to be used for Russia's invasion of Ukraine is \"special military operation\".\n\nAds by\n\nThe clip of the show is going wildly viral on social media.\n\n\"They are poking the bear (pardon the pun) but in this case the NATO bear,\" a Twitter user commented.\n\n\"They've lost 500 tanks, another 2,000 other vehicles, 82 aircraft, 18,000+ soldiers and a battlecruiser. NATO hasn't even arrived yet. It is fair to say that this war against NATO is not going well for Russia,\" another user tweeted.\n\nOn another state-run television channel, an anchor argued that Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nOlesya Loseva, the host of Vremya Pokazhet on Channel One, said the West was now supplying \"zillions of weapons\" to Ukraine.\n\nMeanwhile, Russian news agencies reported late on Thursday that warship Moskva sank in rough weather while being towed back to port.", "source": {"uri": "thenewsguru.com", "dataType": "news", "title": "TheNewsGuru"}, "authors": [{"uri": "bayo_millz@thenewsguru.com", "name": "Bayo Millz", "type": "author", "isAgency": false}], "image": "https://thenewsguru.com/wp-content/uploads/2022/04/World-War.jpg", "eventUri": "eng-7641352", "sentiment": null, "wgt": 203, "relevance": 1, "stanza_neg": 8, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7006230461", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "16:23:00", "dateTime": "2022-04-16T16:23:00Z", "dateTimePub": "2022-04-16T16:05:00Z", "dataType": "news", "sim": 0.7686274647712708, "url": "https://niyitabiti.net/2022/04/russian-state-tv-declares-world-war-3-has-begun-photos/", "title": "Russian State TV Declares World War 3 Has Begun (Photos)", "body": "Russian State TV Declares World War 3 Has Begun (Photos)\n\nA Russian state TV has declared that World War 3 has begun following the sinking of the prized warship, Moskva.\n\nThe Kremlin's main propaganda mouthpiece went off on a rant last night after the flagship of the Black Sea Fleet was taken out.\n\nOlga Skabeyeva, one of Vladimir Putin's leading propagandists, told viewers Western support for Ukraine amounted to direct conflict with Russia, saying: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nMilitary commentator Dmitry Drozdenko said on separate state-run Channel 1:\n\n\"In actual fact a full-scale multi-level war is underway with the collective West.\n\n\"And the West has long been preparing for the war\".\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine. She claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nSkabeyeva also claimed that Ukrainians were delighted to see Russian troops in their country. She said:\n\n\"For some reason ordinary Ukrainians themselves aren't noticing any genocide.\n\n\"In Kharkiv region they're welcoming our soldiers like real liberators.\n\n\"People are coming out with Russian tricolours onto the streets where our military kit is.\n\n\"The people of Kharkiv are accusing not the Russian army of genocide, but the Ukrainian armed forces.\"\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation which would be one of Kyiv's biggest military successes since the invasion began.\n\nBut despite Russia's insistence it sunk because of fire, the Ukrainian capital was struck by rockets overnight, a sign Vladimir Putin wants revenge for the downing of the prized naval asset.\n\nThe city has been spared arial bombardment since Russian troops pulled out of the north but there were strikes against Kyiv, Kharkiv and locations further west.\n\nhttps://www.instagram.com/p/CcYq-xVNS2h/?utm_source=ig_web_copy_link", "source": {"uri": "niyitabiti.net", "dataType": "news", "title": "Gistmaster"}, "authors": [], "image": null, "eventUri": "eng-7641352", "sentiment": -0.2627450980392156, "wgt": 196, "relevance": 1, "stanza_neg": 6, "stanza_neu": 18, "stanza_pos": 0, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7006366002", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "19:45:00", "dateTime": "2022-04-16T19:45:00Z", "dateTimePub": "2022-04-16T19:28:00Z", "dataType": "news", "sim": 0.7647058963775635, "url": "https://olorisupergal.com/2022/04/16/world-war-iii-has-already-started-russian-state-tv-declares/", "title": "World War III Has Already Started, Russian State TV Declares - OloriSuperGal", "body": "Russian state TV propagandists have declared that World War III had already started after Ukrainian forces managed to sink Vladimir Putin's Black Sea flagship, the Moskva.\n\nThe Kremlin's main propaganda mouthpiece went off on a rant last night after the flagship of the Black Sea Fleet was taken out.\n\nThe flagship sank while being towed to port yesterday after suffering heavy damage under circumstances that remained in dispute, Daily Mail reports.\n\nKyiv said it was struck by two Neptune cruise missiles fired by a coastal battery, which struck the port side of the vessel, causing it to roll over.\n\nOlga Skabeyeva, one of Putin's leading propagandists said Western support for Ukraine amounted to direct conflict with Russia.\n\nShe said;\n\n\"What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.\"\n\nMilitary commentator Dmitry Drozdenko said on separate state-run Channel 1: \"In actual fact a full-scale multi-level war is underway with the collective West. And the West has long been preparing for the war.\"\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine.\n\nShe claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nSkabeyeva also claimed that Ukrainians were delighted to see Russian troops in their country.\n\nShe said:\n\n\"for some reason ordinary Ukrainians themselves aren't noticing any genocide.\n\n\"In the Kharkiv region, they're welcoming our soldiers like real liberators.\n\n\"People are coming out with Russian tricolours onto the streets where our military kit is.", "source": {"uri": "olorisupergal.com", "dataType": "news", "title": "Olori Supergal"}, "authors": [{"uri": "osg_media@olorisupergal.com", "name": "Osg Media", "type": "author", "isAgency": false}], "image": "https://olorisupergal.com/wp-content/uploads/2022/04/FB_IMG_1650136125685.jpg", "eventUri": "eng-7641352", "sentiment": -0.2862745098039216, "wgt": 195, "relevance": 1, "stanza_neg": 6, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005136891", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "14:36:00", "dateTime": "2022-04-15T14:36:00Z", "dateTimePub": "2022-04-15T14:36:00Z", "dataType": "news", "sim": 0.7490196228027344, "url": "https://www.firstpost.com/world/ukraine-invasion-has-already-escalated-into-world-war-3-says-russian-state-tv-after-sinking-of-moskva-10561771.html", "title": "Ukraine invasion has 'already escalated into World War 3,' says Russian state TV after sinking of Moskva", "body": "Moscow: It's been over 50 days since Russia began its special military operation in Ukraine and the reason President Vladimir Putin's invasion of Kyiv is taking so long is because the country has entered World War 3 against NATO, said a Russian state TV host.\n\nRossiya 1 presenter Olga Skabeyeva implored viewers to \"recognise\" that Russia was now \"fighting against NATO infrastructure, if not NATO itself,\" according to Independent.\n\nSkabeyeva's remarks follow a symbolic defeat for Moscow with sinking of the flagship of its Black Sea fleet, Moskva.\n\n\"Many are saying 'could it not be done more quickly?' Everyone wants it to happen more quickly. Everyone would like a conclusive victory. Everyone would like all the objectives set to be implemented. Otherwise, on the whole, it's impossible to accept the special operation which we started - Russia's special operation in Ukraine,\" Skabeyeva said.\n\nShe added, \"One can safely call what it has escalated into World War Three. That's absolutely for sure. Right now, we're definitely fighting against NATO infrastructure, if not NATO itself. We need to recognise that.\"\n\nThe 610 ft flagship Moskva sank on Thursday while being towed back to port, informed the Russian defence ministry.\n\nOfficials said ammunition on board the ship had exploded in an unexplained fire, however, Ukraine claimed it struck the ship with its Neptune missiles.\n\nOn 24 February, Russia launched a military operation in Ukraine after the breakaway republics of Donetsk and Luhansk appealed for help in defending themselves against Ukrainian forces.", "source": {"uri": "firstpost.com", "dataType": "news", "title": "Firstpost"}, "authors": [], "image": "https://images.firstpost.com/wp-content/uploads/2022/04/Russia-war1.jpg", "eventUri": "eng-7641352", "sentiment": 0.06666666666666665, "wgt": 191, "relevance": 1, "stanza_neg": 3, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005615281", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "01:52:00", "dateTime": "2022-04-16T01:52:00Z", "dateTimePub": "2022-04-16T01:51:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.pehalnews.in/world-war-iii-has-begun-after-sinking-of-moskva-russian-state-tv/1860672/", "title": "\"World War III Has Begun After Sinking Of Moskva\": Russian State TV", "body": "Moskva is moored within the Ukrainian Black Sea port of Sevastopol. (Reuters File Photo)\n\nRussian state tv has declared that World War III has already began after the sinking of its naval vessel Moskva within the Ukraine struggle. Though Russia stated this was broken after a fireplace, Ukraine claimed the credit score of destroying the flagship vessel of Moscow's Black Sea Fleet via its Neptune missile.\n\nBut the sinking of the ship led to meltdown on the Kremlin's essential propaganda mouthpiece Russia 1. Presenter Olga Skabeyeva made the chilling assertion, informing the viewers that \"what it's escalated into can safely be called World War III\" and insisted \"that's entirely for sure.\"\n\nWatch the video:\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that,\" Skabeyeva additional stated, based on Metro.\n\nA visitor on the present in contrast the sinking of Moskva to an assault on Russian soil, regardless of Kremlin insisting that it went down due to a fireplace.\n\nThe man was reminded that as a substitute of calling it a struggle, the government-approved phrase for use for Russia's invasion of Ukraine is \"special military operation\".\n\nThe clip of the present goes wildly viral on social media.\n\n\"They are poking the bear (pardon the pun) but in this case the NATO bear,\" a Twitter person commented.\n\n\"They've lost 500 tanks, another 2,000 other vehicles, 82 aircraft, 18,000+ soldiers and a battlecruiser. NATO hasn't even arrived yet. It is fair to say that this war against NATO is not going well for Russia,\" one other person tweeted.\n\nOn one other state-run tv channel, an anchor argued that Ukraine was doing the West's bidding by finishing up \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nOlesya Loseva, the host of Vremya Pokazhet on Channel One, said the West was now supplying \"zillions of weapons\" to Ukraine.\n\nMeanwhile, Russian information companies reported late on Thursday that warship Moskva sank in tough climate whereas being towed again to port.", "source": {"uri": "pehalnews.in", "dataType": "news", "title": "Pehal News"}, "authors": [], "image": "https://c.ndtvimg.com/2022-04/ue9q9geo_moskva-sinking-afp-650_625x300_15_April_22.jpg", "eventUri": "eng-7641352", "sentiment": -0.2156862745098039, "wgt": 188, "relevance": 1, "stanza_neg": 7, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7004955717", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "11:39:00", "dateTime": "2022-04-15T11:39:00Z", "dateTimePub": "2022-04-15T11:39:00Z", "dataType": "news", "sim": 0.7254902124404907, "url": "https://www.ndtv.com/world-news/world-war-iii-has-begun-after-sinking-of-moskva-russian-state-tv-2890945", "title": "\"World War III Has Begun After Sinking Of Moskva\": Russian State TV", "body": "On another state-run television channel, a Russian anchor argued that Ukraine was doing the West's bidding.\n\nMoskva is moored in the Ukrainian Black Sea port of Sevastopol. (Reuters File Photo)\n\nRussian state television has declared that World War III has already started after the sinking of its naval vessel Moskva in the Ukraine war. Though Russia said this was damaged after a fire, Ukraine claimed the credit of destroying the flagship vessel of Moscow's Black Sea Fleet through its Neptune missile.\n\nBut the sinking of the ship led to meltdown on the Kremlin's main propaganda mouthpiece Russia 1. Presenter Olga Skabeyeva made the chilling statement, informing the viewers that \"what it's escalated into can safely be called World War III\" and insisted \"that's entirely for sure.\"\n\nWatch the video:\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that,\" Skabeyeva further said, according to Metro.\n\nA guest on the show compared the sinking of Moskva to an attack on Russian soil, despite Kremlin insisting that it went down because of a fire.\n\nThe man was reminded that instead of calling it a war, the government-approved phrase to be used for Russia's invasion of Ukraine is \"special military operation\".\n\nThe clip of the show is going wildly viral on social media.\n\n\"They are poking the bear (pardon the pun) but in this case the NATO bear,\" a Twitter user commented.\n\n\"They've lost 500 tanks, another 2,000 other vehicles, 82 aircraft, 18,000+ soldiers and a battlecruiser. NATO hasn't even arrived yet. It is fair to say that this war against NATO is not going well for Russia,\" another user tweeted.\n\nOn another state-run television channel, an anchor argued that Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nPromotedListen to the latest songs, only on JioSaavn.com\n\nOlesya Loseva, the host of Vremya Pokazhet on Channel One, said the West was now supplying \"zillions of weapons\" to Ukraine.\n\nMeanwhile, Russian news agencies reported late on Thursday that warship Moskva sank in rough weather while being towed back to port.", "source": {"uri": "ndtv.com", "dataType": "news", "title": "NDTV"}, "authors": [{"uri": "amit_chaturvedi@ndtv.com", "name": "Amit Chaturvedi", "type": "author", "isAgency": false}], "image": "https://c.ndtvimg.com/2022-04/ue9q9geo_moskva-sinking-afp-650_625x300_15_April_22.jpg?ver-20220411.01", "eventUri": "eng-7641352", "sentiment": -0.3254901960784313, "wgt": 185, "relevance": 1, "stanza_neg": 8, "stanza_neu": 12, "stanza_pos": 1, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005080945", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "13:42:00", "dateTime": "2022-04-15T13:42:00Z", "dateTimePub": "2022-04-15T13:15:00Z", "dataType": "news", "sim": 0.7058823704719543, "url": "https://www.buzz.ie/news/world-news/russian-propaganda-world-war-three-26721716", "title": "Watch: Russian TV host says Ukraine 'has already escalated into World War Three'", "body": "A Russian state TV host has announced that the Third World War has begun following the sinking of the Moskva, the flagship of Russia's Black Sea Fleet.\n\nIn a nutshell\n\nOlga Skabeyeva, known as one of the Kremlin's top propagandists, told Rossiya One viewers that the reason the \"special operation\" Vladimir Putin announced in Ukraine is taking so long is due to the fact that Russia is now \"fighting against NATO infrastructure, if not NATO itself.\"\n\nThese remarks come following what could be considered one of Ukraine's largest military successes since the invasion by Russia began, the sinking of Russia's Moskva - A 510-crew missile cruiser that was considered to be a symbol of Russia's military might.\n\nRussian officials have yet to accept Ukraine's claims that Neptune missiles sunk the ship, instead suggesting that ammunition on board caused the ship to explode and then sink.\n\nWhat has been said?\n\n\"Many are saying 'could it not be done more quickly?' Everyone wants it to happen more quickly. Everyone would like a conclusive victory. Everyone would like all the objectives set to be implemented,\" Skabeyeva said speaking about the invasion of Ukraine. Russian president Vladimir Putin has called the war in Ukraine a \"special operation\".\n\n\"Otherwise, on the whole, it's impossible to accept the special operation which we started - Russia's special operation in Ukraine. One can safely call what it has escalated into World War Three. That's absolutely for sure,\" the presenter added.\n\n\"Right now, we're definitely fighting against NATO infrastructure, if not NATO itself. We need to recognise that.\"\n\nBlow to Russian morale\n\nYet another blow to Russian morale came on Friday when it was reported that Captain Alexey Bogomolov, of the 25th separate regiment of GRU special forces, was killed in action.\n\nThe GRU special forces are the foreign military intelligence agency of the Russian armed forces. It was reported that the death of Bogomolov represents a significant hit to the unit.", "source": {"uri": "buzz.ie", "dataType": "news", "title": "Buzz.ie"}, "authors": [{"uri": "cathal_ryan@buzz.ie", "name": "Cathal Ryan", "type": "author", "isAgency": false}], "image": "https://i2-prod.buzz.ie/incoming/article26721725.ece/ALTERNATES/s1200/0_russia-1-Skabeyeva-vladimir-putin-ukraine-4022781.jpg", "eventUri": "eng-7641352", "sentiment": null, "wgt": 180, "relevance": 1, "stanza_neg": 5, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005919274", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "09:47:00", "dateTime": "2022-04-16T09:47:00Z", "dateTimePub": "2022-04-16T09:46:00Z", "dataType": "news", "sim": 0.7058823704719543, "url": "https://saharareporters.com/2022/04/16/world-war-iii-has-already-started-russian-state-tv-declares", "title": "0 Comments", "body": "The Kremlin's main propaganda mouthpiece went off on a rant last night after the flagship of the Black Sea Fleet was taken out.\n\nRussian state TV propagandists have declared that World War III had already started after Ukrainian forces managed to sink Vladimir Putin's Black Sea flagship, the Moskva.\n\nThe Kremlin's main propaganda mouthpiece went off on a rant last night after the flagship of the Black Sea Fleet was taken out.\n\nThe flagship sank while being towed to port yesterday after suffering heavy damage under circumstances that remained in dispute, Daily Mail reports.\n\nKyiv said it was struck by two Neptune cruise missiles fired by a coastal battery, which struck the port side of the vessel, causing it to roll over.\n\nOlga Skabeyeva, one of Putin's leading propagandists said Western support for Ukraine amounted to direct conflict with Russia.\n\nShe said, \"What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.\"\n\nMilitary commentator Dmitry Drozdenko said on separate state-run Channel 1: \"In actual fact a full-scale multi-level war is underway with the collective West. And the West has long been preparing for the war.\"\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine.\n\nShe claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nSkabeyeva also claimed that Ukrainians were delighted to see Russian troops in their country.\n\nShe said, \"for some reason ordinary Ukrainians themselves aren't noticing any genocide.\n\n\"In the Kharkiv region, they're welcoming our soldiers like real liberators.\n\n\"People are coming out with Russian tricolours onto the streets where our military kit is.\n\n\"The people of Kharkiv are accusing not the Russian army of genocide, but the Ukrainian armed forces.\"", "source": {"uri": "saharareporters.com", "dataType": "news", "title": "Sahara Reporters"}, "authors": [], "image": null, "eventUri": "eng-7641352", "sentiment": -0.2705882352941177, "wgt": 180, "relevance": 1, "stanza_neg": 7, "stanza_neu": 14, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005833710", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "07:58:00", "dateTime": "2022-04-16T07:58:00Z", "dateTimePub": "2022-04-16T07:29:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://www.walesonline.co.uk/news/uk-news/russian-state-tv-presenters-say-23706597", "title": "Russian state TV presenters say World War Three has started", "body": "A leading presenter on Russia's state TV has told the watching public that World War Three has started following the sinking of the Moskva. Officials have not acknowledged Ukraine's claims that it struck the flagship of the Black Sea Fleet with cruise missiles.\n\nThe sinking of the Russian ship has sent the Kremlin's main channels into meltdown last night. Olga Skabeyeva told Rossiya 1 channel viewers that \"what it's escalated into can safely be called World War Three\" and insisted \"that's entirely for sure.\"\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that,\" reports the Mirror.\n\nMilitary commentator Dmitry Drozdenko said on separate state-run Channel 1: \"In actual fact a full-scale multi-level war is underway with the collective West. And the West has long been preparing for the war.\" Anchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine.\n\nShe argued that Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\" These will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nSkabeyeva claimed Ukrainians were delighted to see Russian troops in their country. They blamed the Ukrainians for \"genocide, not the Russians, she claimed.\n\n\"For some reason ordinary Ukrainians themselves aren't noticing any genocide. In Kharkiv region they're welcoming our soldiers like real liberators,\" she said. \"People are coming out with Russian tricolours onto the streets where our military kit is. The people of Kharkiv are accusing not the Russian army of genocide, but the Ukrainian armed forces.\"", "source": {"uri": "walesonline.co.uk", "dataType": "news", "title": "WalesOnline"}, "authors": [{"uri": "daniel_smith@walesonline.co.uk", "name": "Daniel Smith", "type": "author", "isAgency": false}], "image": "https://i2-prod.walesonline.co.uk/incoming/article23706156.ece/ALTERNATES/s1200/0_PA-66394174.jpg", "eventUri": "eng-7641352", "sentiment": -0.2784313725490196, "wgt": 177, "relevance": 1, "stanza_neg": 3, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005126073", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "14:25:00", "dateTime": "2022-04-15T14:25:00Z", "dateTimePub": "2022-04-15T13:31:00Z", "dataType": "news", "sim": 0.6901960968971252, "url": "https://www.dnaindia.com/world/report-world-war-iii-has-begun-russian-state-tv-anchor-s-chilling-statement-after-sinking-of-moskva-ukraine-2946501", "title": "'World War III has begun': Russian State TV anchor's CHILLING statement after sinking of Moskva", "body": "Russia-Ukraine War, Russian TV, russian tv anchor, Olga Skabeyeva, Russia 1, Channel One, Russia war, World War III\n\nA day after Moscow suffered a stinging symbolic defeat with the loss of the flagship of its Black Sea fleet, Russia's Defense Ministry promised Friday to ramp up missile attacks in Kyiv.\n\nIn addition to this, Russian state television has declared that World War III has already started after the sinking of its naval vessel Moskva. Ukraine had claimed the credit for destroying the flagship vessel as President Zelenskyy, without mentioning Moskva, said \"those who showed that Russian warships can sail away, even if it's to the bottom of the sea\" while listing the ways Ukraine has defended against the onslaught.\n\nREAD | Imran Khan sold gifts from Toshakhana for Rs 14 crore in Dubai, claims Pakistan PM Shehbaz Sharif\n\nThe sinking of the Russian ship has now led to the meltdown of the Kremlin's main propaganda mouthpiece Russia 1. Presenter Olga Skabeyeva made a chilling statement and said \"what it's escalated into can safely be called World War III\" and insisted \"that's entirely for sure.\"\n\nAccording to a report in Metro, Skabeyeva further said, \"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.\"\n\nMeanwhile, Ukraine's defence ministry spokesman Oleksandr Motuzyanyk said on Friday that for, the first time since the start of its invasion, Russia used long-range bombers to attack the besieged port city of Mariupol.\n\nMotuzyanyk said Russia was concentrating its efforts on seizing the cities of Rubizhne, Popasna, and Mariupol.", "source": {"uri": "dnaindia.com", "dataType": "news", "title": "Daily News and Analysis (DNA) India"}, "authors": [], "image": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/04/15/1491122-russia-ukraine.jpg", "eventUri": "eng-7641352", "sentiment": -0.2941176470588235, "wgt": 176, "relevance": 1, "stanza_neg": 2, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7006124414", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "14:05:00", "dateTime": "2022-04-16T14:05:00Z", "dateTimePub": "2022-04-16T13:26:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.thetrentonline.com/russian-state-tv-declares-world-war-3-has-started-after-sinking-moskva/", "title": "Russian TV Declares Start Of World War 3 - The Trent", "body": "Russian state TV says World War Three has already started after the sinking of the Moskva.\n\nThe Kremlin's main propaganda mouthpiece went into meltdown last night after the flagship of the Black Sea Fleet was taken out.\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation that would be one of Kyiv's biggest military successes since the invasion began.\n\nBut despite Russia's insistence it sunk because of fire, the Ukrainian capital was struck by rockets overnight, a sign Vladimir Putin wants revenge for the downing of the prized naval asset.\n\nThe city has been spared arial bombardment since Russian troops pulled out of the north but there were strikes against Kyiv, Kharkiv, and locations further west.\n\nRussia 1, a Kremlin mouthpiece that has championed the war, came close to acknowledging Ukraine sunk the Moskva by demanding a crushing response.\n\nOlga Skabeyeva, one of Vladimir Putin's leading propagandists, told viewers Western support for Ukraine amounted to direct conflict with Russia, saying: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nThis slideshow requires JavaScript.\n\nA guest on the show likened the sinking of the Moskva to an attack on Russian soil, despite the Kremlin's insistence it went down because of a fire.\n\nHe also used the word 'war', banned in Russia, and had to be reminded of the government-approved terminology 'special military operation', adding Kyiv should be destroyed.\n\nRussia has previously said it considers arms being delivered to Ukraine legitimate targets.\n\nThe Kremlin has also responded furiously to the news Sweden and Finland are set to apply to join Nato in response to the invasion.\n\nPro-Ukraine sources say the Moskva was taken out in an operation using drones to confuse its anti-missile defence systems.\n\nWith its guns distracted by the unmanned aircraft hovering above it, two Neptune cruise missiles were fired from land and hit the port side of the warship.\n\nThe strike triggered an explosion in the ammunition store and a fire, a detail confirmed in part by the Kremlin.\n\nRussia said all 500 crew on board were evacuated but it's likely there were fatalities.\n\nIt is the largest vessel to be sunk in combat since the Royal Navy took out the Belgrano during the Falkland's War and the most significant naval casualty since the Second World War.", "source": {"uri": "thetrentonline.com", "dataType": "news", "title": "The Trent"}, "authors": [], "image": "https://www.thetrentonline.com/wp-content/uploads/2022/03/Putin-scaled-e1647858031290.jpg", "eventUri": "eng-7641352", "sentiment": -0.1764705882352942, "wgt": 170, "relevance": 1, "stanza_neg": 11, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005100941", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "14:02:00", "dateTime": "2022-04-15T14:02:00Z", "dateTimePub": "2022-04-15T13:36:00Z", "dataType": "news", "sim": 0.6627451181411743, "url": "https://expressdigest.com/world-war-three-has-already-started-say-russian-state-tv-propagandists/", "title": "World War Three has already STARTED, say Russian state TV propagandists | Express Digest", "body": "Russian state TV propagandists last night claimed that World War Three had already started in a furious chat show exchange after Ukrainian forces managed to sink Vladimir Putin's Black Sea flagship, the Moskva.\n\nRossiya 1 presenter Olga Skabeyeva, who stuck to the Kremlin's official line that the warship suffered a 'fire' despite heading a segment which blamed the vessel's demise on Ukraine, said the 'escalation' could 'safely be called World War Three' and warned Russians 'we are we're definitely fighting against... NATO itself'.\n\nSkabeyeva was joined by pundits who branded the sinking of the Moskva an 'an absolute cause for war, 100 per cent' and said there's 'nothing to think about, there has to be a response' as they appeared to suggest Putin should use nuclear weapons on the Ukrainian capital Kyiv so Russia could 'bomb them once and that's it'.\n\nA separate Russian state TV show Vremya Pokazhet last night claimed that the West was supplying 'zillions of weapons' to Ukraine and that, at the suppliers bidding, Kyiv was carrying 'yet more provocations, bloody, horrible, completely unthinkable'.\n\nHost Olesya Loseva told viewers that the West believes that 'Russia is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth' hours after it was confirmed that the Moskva had sunk.\n\nShe also said Ukrainians were delighted to see Moscow's troops in their country, waving the Russian tricolour and treating them 'like real liberators' in Kharkiv and claimed that Kyiv 'not the Russians' were carrying out a 'genocide'.\n\nSeparate state-run Channel 1 ran comments by military commentator Dmitry Drozdenko who claimed 'the West has long been preparing for the war' and that Russia faces 'a full-scale multi-level war' against the 'collective West'.\n\nThe flagship sank while being towed to port yesterday after suffering heavy damage under circumstances that today remained in dispute. Kyiv said it was struck with two Neptune cruise missiles fired by a coastal battery, which struck the port side of the vessel, causing it to roll over.\n\nRussian military sources admitted the ship had rolled on to its side and caught fire after the blast, while US intelligence sources said the vessel suffered a 'large' explosion that left it heavily damaged before it sank.\n\nAside from providing Ukraine with a propaganda victory, Moskva's sinking also has practical implications for Russia. As flagship, the vessel was likely tasked with coordinating the movements of other ships in the Black Sea which may cause further confusion among Russia's already-strained command structure.\n\nIts role was also to provide cover for Russia's other ships using its anti-air missiles while they launched cruise missiles attacks against cities and military sites. Its loss will make them more-vulnerable to Ukrainian strikes, including by fast jets or drones.\n\nRossiya 1 presenter Olga Skabeyeva told viewers: 'What it's escalated into can safely be called World War Three. That's entirely for sure. Now we're definitely fighting against NATO infrastructure, if not NATO itself. We need to recognise that'\n\nVremya Pokazhet host Olesya Loseva said in a segment that the West was supplying 'zillions of weapons' to Ukraine and that, at the suppliers bidding, Kyiv was carrying 'yet more provocations, bloody, horrible, completely unthinkable'\n\nRossiya 1's Skabeyeva lamented that 'ordinary Ukrainians' are not 'noticing any genocide... for some reason' - but also claimed Kharkiv residents 'are accusing not the Russian army of genocide, but the Ukrainian armed forces'.\n\nThe chilling statements came amid fears the Moskva may have been carrying nuclear warheads, as a Russian politician said more than 400 sailors could have gone down with the ship.\n\nToday, Mykhailo Samus, director of a Lviv-based military think-tank; Andriy Klymenko, editor of Black Sea News; and Ukrainian newspaper Defence Express all warned that the Moskva could have been carrying two nuclear warheads designed to be fitted to its P-1000 'carrier killer' missiles.\n\nIf true, the loss of the warheads into the Black Sea could spark a 'Broken Arrow' incident - American military slang for potentially lethal accidents involving nuclear weapons.\n\n'On board the Moskva could be nuclear warheads - two units,' Samus said, while Klymenko called on other Black Sea nations - Turkey, Romania, Georgia, and Bulgaria - to insist on an explanation. 'Where are these warheads? Where were they when the ammunition exploded,' he asked.\n\nMeanwhile Ilya Ponomarev, a politician exiled from Russia for opposing Putin's 2014 annexation of Crimea, said just 58 of the 510-strong crew have since been accounted for - raising the prospect that 452 men went down with the ship in what would be a bitter loss for Putin's already beleaguered army.\n\nThe figure, while unconfirmed, is consistent with losses suffered on exploding warships. During the Russian Navy's infamous defeat at the Battle of Tsushima against Japan, an explosion on board the Borodino - slightly smaller than the Moskva - saw all-but one of her 855 crew killed.\n\nRussia claims all the Moskva's sailors were 'successfully evacuated' but video taken in Sevastopol overnight shows dozens of cars purportedly belonging to the sailors still parked in the port - suggesting their owners had not returned to collect them.\n\nElsewhere today, rumours began circulating in Ukrainian media that Admiral Igor Osipov - the commander of Russia's Black Sea fleet which the Moskva led - has been arrested in what would be the latest in a string of detentions linked to the bungled invasion.\n\nMoskva could have been carrying warheads to fit into the tip of its Moskva's P-1000 supersonic cruise missiles, which are designed to take out American aircraft carriers\n\nRussian Telegram accounts with links to the Wagner Group claim Bayraktar drones were used to distract the Moskva's radar systems before a coastal battery opened fire somewhere near Odesa, hitting the ship with two Neptune missiles\n\nThe flagship of Russia's Black Sea fleet - the Soviet-era guided missile destroyer Moskva - has suffered heavy damage and may have sunk after Ukraine claimed to have shot it with two anti-ship cruise missiles\n\nIt emerged this morning that Moscow has lost another high-flying GRU military intelligence agent in Ukraine in the latest blow to the Kremlin's 'elite' spy service.\n\nCaptain Alexey Bogomolov, of the 25th separate regiment of GRU special forces was reportedly killed in action. His funeral will be held tomorrow in Tambov region.\n\nIt follows the deaths of 31-year-old GRU agent Captain Alexey Glushchak in mid-March as well as Senior Lieutenant Anton Volkov, Captain Konstantin Druzhkov and GRU operatives Islam Abduragimov and Shamil Aselderov.\n\nSeparately, a video that emerged last week appeared to show multiple graves of recently killed GRU military intelligence special forces officers.\n\nThey were from the 10th Separate Order of Zhukov Special Purpose Brigade. The GRU is seen as Russia's most secretive and - until recently - most effective service.\n\nBritain says a GRU hit squad was behind the poisoning with Novichok of Sergei Skripal - who had defected to Britain - and his daughter Yulia in 2018.\n\nIn the Cold War, a GRU agent under diplomatic cover in London, Captain Yevgeny Ivanov triggered the fall of a Tory government after he seduced Christine Keeler, the lover of British war minister John Profumo.\n\nThe funeral of 31-year-old GRU agent Captain Alexey Glushchak, who was killed during the Russian invasion of Ukraine\n\nIt follows the deaths of Senior Lieutenant Anton Volkov, (right) Captain Konstantin Druzhkov and GRU operatives Islam Abduragimov (left) and Shamil Aselderov\n\nVideo that emerged last week appeared to show multiple graves of recently killed GRU military intelligence special forces officers. They were from the 10th Separate Order of Zhukov Special Purpose Brigade. The GRU is seen as Russia's most secretive and - until recently - most effective service", "source": {"uri": "expressdigest.com", "dataType": "news", "title": "expressdigest.com"}, "authors": [], "image": null, "eventUri": "eng-7641352", "sentiment": -0.5372549019607843, "wgt": 169, "relevance": 1, "stanza_neg": 20, "stanza_neu": 26, "stanza_pos": 2, "swn_neg": 48, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7005960659", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "10:40:00", "dateTime": "2022-04-16T10:40:00Z", "dateTimePub": "2022-04-16T10:22:00Z", "dataType": "news", "sim": 0.658823549747467, "url": "https://www.naijanews.com/?p=500552", "title": "Ukraine Crisis: Russian TV Declares World War III", "body": "A Russian State television has announced the beginning of 'World War III.'\n\nThe Kremlin's main propaganda mouthpiece revealed how the flagship of the Black Sea Fleet was defeated.\n\nOlga Skabeyeva, a leading propagandist for Vladimir Putin told viewers that Western support for Ukraine amounted to direct conflict with Russia, saying: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nDmitry Drozdenko, military commentator said on separate state-run Channel 1: \"In actual fact a full-scale multi-level war is underway with the collective West.\n\n\"And the West has long been preparing for the war\".\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told her viewers that the West was providing \"zillions of weapons\" to Ukraine.\n\nShe stated that Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".", "source": {"uri": "naijanews.com", "dataType": "news", "title": "Naija News"}, "authors": [{"uri": "justina_otio@naijanews.com", "name": "Justina Otio", "type": "author", "isAgency": false}], "image": "https://www.naijanews.com/wp-content/uploads/2022/02/Russian-President-Vladimir-Putin-.jpg", "eventUri": "eng-7641352", "sentiment": -0.2627450980392156, "wgt": 168, "relevance": 1, "stanza_neg": 3, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005212512", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "15:51:00", "dateTime": "2022-04-15T15:51:00Z", "dateTimePub": "2022-04-15T15:50:00Z", "dataType": "news", "sim": 0.6549019813537598, "url": "https://www.starspost.com/definitely-fighting-nato-putin-mouthpiece-declares-world-war-3-started-after-ship-sunk/", "title": "'Definitely fighting NATO' Putin mouthpiece declares World War 3 started after ship sunk - The Stars Post", "body": "Russian broadcaster Olga Skabeyeva, a vocal supporter of Vladimir Putin and a backer of Russia's invasion of Ukraine, insisted Moscow is now effectively at war with NATO. She suggested the sinking of the cruiser Moskva in the Black Sea signalled the \"special military operation\" Putin launched in February had escalated to a new level. The Russia 1 presenter said the hit showed Russia is now fighting not only against NATO-provided weaponry but the alliance itself in what she called \"World War 3.\"", "source": {"uri": "starspost.com", "dataType": "news", "title": "The Stars Post"}, "authors": [], "image": "https://www.starspost.com/wp-content/uploads/2022/04/039Definitely-fighting-NATO039-Putin-mouthpiece-declares-World-War-3-started.jpg", "eventUri": "eng-7641352", "sentiment": -0.0980392156862745, "wgt": 167, "relevance": 1, "stanza_neg": 2, "stanza_neu": 0, "stanza_pos": 1, "swn_neg": 3, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005114409", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "14:15:00", "dateTime": "2022-04-15T14:15:00Z", "dateTimePub": "2022-04-15T14:14:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://www.indy100.com/news/russian-tv-fighting-nato", "title": "Russian state TV host says World War 3 has already started", "body": "Russian State TV Suggests U.S. Should Have a 'Regime Change' Not Russia\n\nOn a recent airing of a Russian state TV show, host Olga Skabeyeva told Russian citizens the reason the 'special operation' is taking so long is because World War III has started and Russia is 'fighting NATO'.\n\nBBC reporter Francis Scarr shared a clip of Skabeyeva, 37, on Channel 1 explaining the reason the 'special military operation' is taking so long.\n\n\"One can safely call what has been escalated into World War Three,\" Scarr translated Skabeyeva's report. \"That's absolutely for sure. Right now, we are fighting NATO infrastructure, if not NATO itself.\"\n\nSign up for our new free Indy100 weekly newsletter\n\nAs Russia takes more hits from the Ukrainian military, they're being forced to come up with excuses as to why they have not dominated Ukraine.\n\nOn Thursday, a Russian military cruiser ship, Moskva, was hit by a Ukrainian missile which caused a fire and sank the ship. Although the Kremlin refused to acknowledge Ukraine's missile caused the cruiser to sink, they announced the ship had experienced a fire and sank.\n\nHowever, the result of Moskva's sinking has started a fury in Russian propaganda commentators who say it is a cause for a full-blown world war.\n\nDespite the threat that Russia is at war with NATO, commenters on Scarr's post reminded people that there is no World War III thus far.\n\n\"Ha. Last i checked there is literally not one (1) single NATO boot on the ground in ukraine and not one (1) single NATO pilot in ukrainian airspace and not one (1) single NATO sailor in UKR or RU waters or firing on RU ships, but sure, RU-NATO WW3 , lol,\" Sully wrote.\n\n\"They've lost 500 tanks, another 2,000 other vehicles, 82 aircraft, 18,000+ soldiers and a battlecruiser. NATO hasn't even arrived yet. It is fair to say that this war against NATO is not going well for Russia,\" another Twitter user commented.\n\nStrangely, following the sinking of Moskva, a news report from Russia says the Russian Ministry of Defense will answer any attack or sabotage of Kyiv.", "source": {"uri": "indy100.com", "dataType": "news", "title": "indy100.com"}, "authors": [], "image": "https://www.indy100.com/media-library/russian-state-tv-suggests-u-s-should-have-a-regime-change-not-russia.png?id=29685486&width=1200&coordinates=209%2C0%2C209%2C0&height=600", "eventUri": "eng-7641352", "sentiment": -0.2705882352941177, "wgt": 166, "relevance": 1, "stanza_neg": 10, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005662598", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "03:34:00", "dateTime": "2022-04-16T03:34:00Z", "dateTimePub": "2022-04-16T02:59:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://www.ibtimes.sg/russian-state-tv-says-world-war-iii-has-begun-after-moskva-sinking-wants-putin-use-nuclear-weapon-64025", "title": "Russian State TV Says World War III Has Begun After Moskva Sinking; Wants Putin to Use Nuclear Weapon", "body": "Russian state TV propagandist Olga Skabeyeva has claimed that World War III has now started after Ukraine hit Moscow's warship Moskva in the Black Sea. Rossiya 1 presenter Skabeyeva claimed that the 'escalation' could 'safely be called World War Three', claiming that 'we are definitely fighting against... NATO itself'.\n\nSkabeyeva stuck to the Kremlin's official line that the warship suffered a 'fire' despite heading a segment that blamed the vessel's demise on Ukraine, according to the Daily Mail.\n\nSkabeyeva's Panel Expert Suggests Russia to Use Nukes\n\nSome experts had also joined Skabeyeva's chat show, claiming that Moskva's sinking will be the absolute cause of a more intense war. Experts also vowed that there has to be a response to the vessel's sinking even they suggested Russian President Vladimir Putin use nuclear weapons on Kyiv to 'bomb them once and that's it'.\n\nSkabeyeva even went on to say that ordinary people in Ukraine are not mentioning any genocide. She also claimed that Kharkiv residents are accusing Ukrainian armed forces of genocide, not the Russian troops.\n\nLast night, another Russian state TV show Vremya Pokazhet claimed that the West was supplying a massive number of weapons to Ukraine and that, at the suppliers bidding, Kyiv was carrying 'yet more provocations, bloody, horrible, completely unthinkable'.\n\nOlesya Loseva, the host of the show, claimed that the West wants all Russians to be simply wiped off the face of the earth'.\n\nFalse Claims\n\nThe host continued to make false claims stating that Ukrainians were delighted to see Russian troops in their country. She maintained that civilians were waving the Russian tricolor and treating Putin's troops as real liberators in Kharkiv.\n\nAnother state-run Channel 1 ran remarks of military commentator Dmitry Drozdenko, who claimed the Western powers have long been preparing for the war. The expert also made claims that Moscow faces 'a full-scale multi-level war' against the 'collective West'.\n\nRead more", "source": {"uri": "ibtimes.sg", "dataType": "news", "title": "International Business Times, Singapore Edition"}, "authors": [{"uri": "prabhat_ranjan_mishra@ibtimes.sg", "name": "Prabhat Ranjan Mishra", "type": "author", "isAgency": false}], "image": "https://data.ibtimes.sg/en/full/56941/olga-skabeyeva.jpg", "eventUri": "eng-7641352", "sentiment": -0.3960784313725491, "wgt": 165, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005786471", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "06:57:00", "dateTime": "2022-04-16T06:57:00Z", "dateTimePub": "2022-04-16T06:54:00Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://thestreetjournal.org/russian-state-tv-announces-military-operation-in-ukraine-has-escalated-into-world-war-three/", "title": "Russian state TV announces military operation in Ukraine has escalated into World War three - The Street Journal", "body": "My stepdad sexually molested me for 6 years yet my mum did nothing - Singer, Temmie Ovwasa\n\nA Russian state TV host has said the reason president Vladimir Putin's military operation in Ukraine is taking so long is because the country has commenced World War Three.\n\nThe Kremlin's main propaganda mouthpiece went off on a rant last night after a prized warship, Moskva was taken out and allowed to sink.\n\nOlga Skabeyeva, one of Vladimir Putin's leading propagandists, stated that the Western support for Ukraine amounted to direct conflict with Russia, saying: \"What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n\"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.\"\n\nMilitary commentator Dmitry Drozdenko said on a separate state-run Channel: \"In actual fact a full-scale multi-level war is underway with the collective West. And the West has long been preparing for the war.\"\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine. She claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth.\"\n\nSkabeyeva also claimed that Ukrainians were delighted to see Russian troops in their country. She said: \"For some reason ordinary Ukrainians themselves aren't noticing any genocide.\n\n\"In Kharkiv region they're welcoming our soldiers like real liberators.\n\n\"People are coming out with Russian tricolours onto the streets where our military kit is.\n\n\"The people of Kharkiv are accusing not the Russian army of genocide, but the Ukrainian armed forces.\"\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation which would be one of Kyiv's biggest military successes since the invasion began.\n\nBut despite Russia's insistence it sunk because of fire, the Ukrainian capital was struck by rockets overnight, a sign Vladimir Putin wants revenge for the downing of the prized naval asset.\n\nThe city has been spared arial bombardment since Russian troops pulled out of the north but there were strikes against Kyiv, Kharkiv and locations further west.", "source": {"uri": "thestreetjournal.org", "dataType": "news", "title": "Breaking News"}, "authors": [{"uri": "jenny_ese_obukohwo@thestreetjournal.org", "name": "Jenny Ese Obukohwo", "type": "author", "isAgency": false}], "image": "https://thestreetjournal.org/wp-content/uploads/2022/04/Ruassia-Ukraine.jpeg", "eventUri": "eng-7641352", "sentiment": -0.2392156862745098, "wgt": 164, "relevance": 1, "stanza_neg": 8, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005192257", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "15:31:00", "dateTime": "2022-04-15T15:31:00Z", "dateTimePub": "2022-04-15T15:30:00Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://www.kyivpost.com/world/russian-state-tv-invasion-of-ukraine-already-escalated-into-world-war-three.html", "title": "Russian State TV: Invasion of Ukraine 'Already Escalated Into World War Three' - KyivPost - Ukraine's Global Voice", "body": "Russia's Moskva cruiser vessel, the Black Sea Fleet's flagship, which sank in the early hours of April 15.\n\nA Russian state TV host has said the reason President Putin's \"special operation\" in Ukraine is taking so long is because the country has entered World War Three against Nato, the Independent newspaper has reported in its rolling coverage of the war.\n\nThe remarks from one of Russia's most prominent television presenters - Olga Skabeyeva - follow a symbolic defeat for Moscow with today's sinking of the Moskva, the flagship of its Black Sea fleet.", "source": {"uri": "kyivpost.com", "dataType": "news", "title": "KyivPost"}, "authors": [], "image": "https://www.kyivpost.com/wp-content/uploads/2022/04/Moskva-cruiser-ship.jpg", "eventUri": "eng-7641352", "sentiment": -0.207843137254902, "wgt": 164, "relevance": 1, "stanza_neg": 1, "stanza_neu": 2, "stanza_pos": 0, "swn_neg": 3, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005481720", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "21:32:00", "dateTime": "2022-04-15T21:32:00Z", "dateTimePub": "2022-04-15T21:15:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://howafrica.com/russian-state-tv-declares-world-war-3-has-begun/", "title": "Russian State TV Declares World War 3 Has Begun", "body": "A Russian state TV has declared that World War 3 has begun following the sinking of the prized warship, Moskva.\n\nThe Kremlin's main propaganda mouthpiece went off on a rant last night after the flagship of the Black Sea Fleet was taken out.\n\nOlga Skabeyeva, one of Vladimir Putin's leading propagandists, told viewers Western support for Ukraine amounted to direct conflict with Russia, saying: 'What it's escalated into can safely be called World War Three. That's entirely for sure.\n\n'Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.'\n\nMilitary commentator Dmitry Drozdenko said on separate state-run Channel 1:\n\n\"In actual fact a full-scale multi-level war is underway with the collective West.\n\n\"And the West has long been preparing for the war\".\n\nLoading...\n\nAnchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine. She claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\"\n\nThese will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nSkabeyeva also claimed that Ukrainians were delighted to see Russian troops in their country. She said:\n\n\"For some reason ordinary Ukrainians themselves aren't noticing any genocide.\n\n\"In Kharkiv region they're welcoming our soldiers like real liberators.\n\n\"People are coming out with Russian tricolours onto the streets where our military kit is.\n\n\"The people of Kharkiv are accusing not the Russian army of genocide, but the Ukrainian armed forces.\"\n\nOfficials have refused to acknowledge Ukraine's claims it struck the ship with cruise missiles, an operation which would be one of Kyiv's biggest military successes since the invasion began.\n\nBut despite Russia's insistence it sunk because of fire, the Ukrainian capital was struck by rockets overnight, a sign Vladimir Putin wants revenge for the downing of the prized naval asset.\n\nThe city has been spared arial bombardment since Russian troops pulled out of the north but there were strikes against Kyiv, Kharkiv and locations further west.\n\nLoading...", "source": {"uri": "howafrica.com", "dataType": "news", "title": "How Africa News"}, "authors": [], "image": "https://howafrica.com/wp-content/uploads/2022/04/6259ca89601fe.jpg", "eventUri": "eng-7641352", "sentiment": -0.2235294117647059, "wgt": 163, "relevance": 1, "stanza_neg": 6, "stanza_neu": 18, "stanza_pos": 0, "swn_neg": 24, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7007265118", "lang": "eng", "isDuplicate": false, "date": "2022-04-17", "time": "20:03:00", "dateTime": "2022-04-17T20:03:00Z", "dateTimePub": "2022-04-17T19:57:00Z", "dataType": "news", "sim": 0.615686297416687, "url": "https://endtimeheadlines.org/2022/04/russian-supporters-claim-wwiii-has-been-triggered-by-the-sinking-warship-zelensky-warns-of-nuclear-attack-calls-for-stockpile-of-radiation-pills/", "title": "Russian supporters claim WWIII has been triggered by the sinking of warship, Zelensky warns of nuclear attack, calls for stockpile of radiation pills", "body": "Russian state TV propagandists outrageously claimed World War III had begun as they ranted at the West after the sinking of prized warship Moskva. Hundreds of sailors were believed to have died after 12,500-ton Moskva was hit by a devastating missile strike, The Sun reported.\n\nThere were rumours the missiles were provided by NATO supporters of Ukraine, and Britain has sent anti-ship weapons. But sources insisted the Slava-class cruiser was sunk by Ukraine-made Neptune missiles after its radar was distracted by a Turkish-made Byraktar drone.\n\nA Pentagon official briefing reporters said Ukraine had hit the Moskva with two Neptunes -- contradicting Russia's claim that the ship lost balance in rough seas as it was towed to port after ammunition exploded.\n\nIt is the first time the Russian navy has lost a flagship since battleship Knyaz Suvorov was torpedoed by Japan in the war of 1905. It is also the largest warship lost since World War II. Russian President Vladimir Putin's mouthpiece Olga Skabeyeva said on state-run Rossiya 1 TV station: \"It can safely be called World War Three. That's entirely for sure.\n\nPutin's propagandists are now desperately trying to distract from the tyrant's military's failures in a war which was sold the Russian people as being a quick victory in a matter of days.\n\nAnd so, Russia is trying to blame the West - despite nations like the US and UK staying out of the war beyond sending aide and weapons to Kyiv. Military commentator Dmitry Drozdenko said on separate state-run Channel 1: \"In actual fact a full-scale multi-level war is underway with the collective West.\n\n\"And the West has long been preparing for the war\". Anchor Olesya Loseva, host of Vremya Pokazhet, told viewers that the West was now supplying \"zillions of weapons\" to Ukraine.\n\nShe claimed Ukraine was doing the West's bidding by carrying out \"yet more provocations, bloody, horrible, completely unthinkable.\" These will \"force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\".\n\nMeanwhile, Volodymyr Zelensky has warned Ukrainians to prepare for a possible Russian nuclear attack and called for a stockpile of radiation pills. He told the world \"we must prepare for\" the bleak scenario and get hold of medicine that would help curb radiation sickness.\n\nZelkensky made the grim warning in an interview before sharing the clip on his Telegram channel on Saturday evening. On Friday he made a similar announcement and said nuclear weapons could not be ruled out with Vladimir Putin considering the move as Russia's war with Ukraine stalls.\n\nPutin ramped up his offensive after the sinking of the Moskva battleship on Thursday and attacked eight towns including Kyiv, Kharkiv, and Lviv. A British fighter, meanwhile, was paraded on TV after being captured by Russian forces in Mariupol.", "source": {"uri": "endtimeheadlines.org", "dataType": "news", "title": "End Time Headlines"}, "authors": [], "image": "https://endtimeheadlines.org/wp-content/uploads/2022/04/shutterstock_2136303241.jpg", "eventUri": "eng-7641352", "sentiment": null, "wgt": 157, "relevance": 1, "stanza_neg": 7, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7005550499", "lang": "eng", "isDuplicate": false, "date": "2022-04-15", "time": "23:36:00", "dateTime": "2022-04-15T23:36:00Z", "dateTimePub": "2022-04-15T22:40:00Z", "dataType": "news", "sim": 0.6039215922355652, "url": "https://www.smalljoys.tv/news-world-war-3-russia-t-zan/", "title": "BREAKING: World War 3 Has Already Started, Russia Warns", "body": "World War 3 has already begun according to Russian state TV.\n\nAs Kremlin mouthpieces said on state TV, the invasion of Ukraine has \"escalated\" into World War Three after NATO decided to intervene by supplying the nation with weapons and resources to fight off the invaders.\n\nSpeaking on Rossiya 1, Russian propagandist Olga Skabeyeva said the current state of global affairs can \"safely be called World War Three.\"\n\nShe also insisted that Russia is \"definitely fighting against... NATO itself.\"\n\nFlanking Skabeyeva were other Russian propagandists who called for President Vladimir Putin to strike Kyiv with nuclear weapons and \"bomb them once and that's it.\"\n\nAs Kremlin mouthpieces suggested, the sinking of Russia's Black Fleet flagship Moskva, which was severely damaged after allegedly being struck by two Ukrainian missiles, was \"an absolute cause for war, 100 per cent.\"\n\n\"[There's nothing to think about, there has to be a response,\" they said.\n\nWaging anti-West propaganda, Olesya Loseva then told the viewers that NATO and EU countries think of Russia as \"unworthy\" of being on the planet.\n\n\"[They believe] Russia is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth,\" Loseva said.\n\nDespite the atrocities that Russian soldiers are committing in Ukraine, the state TV host claimed that their army was being treated like \"real liberators\" in occupied Kharkiv.\n\nMeanwhile, Russia's Channel 1 presented comments of military commentator Dmitry Drozdenko who accused the West of \"preparing for the war\" for a long time.\n\nDrozdenko also insisted that Russia now faces \"a full-scale multi-level war.\"\n\nWhat are your thoughts on this matter? Let us know in the comments and don't forget to SHARE this post with your family and friends. For more news and stories, follow us on Facebook!", "source": {"uri": "smalljoys.tv", "dataType": "news", "title": "Small Joys"}, "authors": [], "image": "https://static.smalljoys.me/2022/04/untitled-design-84.jpg", "eventUri": "eng-7641352", "sentiment": -0.3490196078431372, "wgt": 154, "relevance": 1, "stanza_neg": 4, "stanza_neu": 10, "stanza_pos": 1, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005781992", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "06:49:00", "dateTime": "2022-04-16T06:49:00Z", "dateTimePub": "2022-04-16T06:49:00Z", "dataType": "news", "sim": 0.5960784554481506, "url": "https://www.khaleejtimes.com/world/ukraine-crisis-has-escalated-into-world-war-3-says-russian-state-tv", "title": "Ukraine crisis has escalated into World War 3, says Russian state TV ", "body": "The remarks follow a symbolic defeat for Moscow with the sinking of Moskva\n\nRussia's military operation in Ukraine 'is taking long' because the country has entered World War Three against Nato, a state TV host said.\n\nPresenter Olga Skabeyeva's statements came after the Russian missile cruiser Moskva sank in a symbolic defeat for Moscow. The vessel was struck by two Ukrainian missiles, a senior US official confirmed on Friday.\n\nSkabeyeva urged Rossiya 1 viewers to 'recognise' that the country was now 'fighting against Nato infrastructure, if not Nato itself', according to Independent.\n\n\"Many are saying 'could it not be done more quickly?' Everyone wants it to happen more quickly. Everyone would like a conclusive victory. Everyone would like all the objectives set to be implemented,\" she was quoted as saying.\n\nShe added: \"One can safely call what it has escalated into World War Three. That's absolutely for sure.\"\n\nRussian news agencies cited the defence ministry on Thursday as saying that the missile cruiser Moskva sunk in stormy seas after what it said was a fire and explosions involving ammunition stowed onboard.\n\nALSO READ:\n\nUkraine said it launched a missile strike on the Moskva from the coast, which ripped open the Soviet-era ship.", "source": {"uri": "khaleejtimes.com", "dataType": "news", "title": "Khaleej times"}, "authors": [], "image": "https://image.khaleejtimes.com?uuid=3754e51f-7c53-55e8-b726-8a227c5da801&function=cropresize&type=preview&source=false&q=75&crop_w=0.99999&crop_h=0.95425&x=0&y=0&width=1200&height=675", "eventUri": "eng-7641352", "sentiment": -0.1294117647058823, "wgt": 152, "relevance": 1, "stanza_neg": 2, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7005777894", "lang": "eng", "isDuplicate": false, "date": "2022-04-16", "time": "06:44:00", "dateTime": "2022-04-16T06:44:00Z", "dateTimePub": "2022-04-16T06:27:00Z", "dataType": "news", "sim": 0.5882353186607361, "url": "https://www.oneindia.com/international/world-war-iii-has-begun-declares-russian-state-media-3396759.html", "title": "World War III has begun declares Russian State Media", "body": "Moscow, Apr 16: The Russian State television has said that World War III has already begun following the sinking of its naval vessel Moskva in the Ukraine war. Russia however had said that the vessel was damaged in a dire, but Ukraine claimed credit for destroying the ship.\n\nKremlin's mouthpiece Russia 1 informed viewers that what it has escalated into can safety be called World War III and insisted that entirely for sure. Now we are definitely fighting against NATO infrastructure, if not NATO itself. We need to recognise that.\n\nA guest on the show compared the sinking of the vessel to an attack on Russian soil despite Kremlin insisting that the vessel went down due to a fire.\n\n\"They've lost 500 tanks, another 2,000 other vehicles, 82 aircraft, 18,000+ soldiers and a battlecruiser. NATO hasn't even arrived yet. It is fair to say that this war against NATO is not going well for Russia,\" wrote one user on Twitter", "source": {"uri": "oneindia.com", "dataType": "news", "title": "Oneindia"}, "authors": [], "image": "https://www.oneindia.com/img/2022/04/russia-military1-1650090381.jpg?16042022121213", "eventUri": "eng-7641352", "sentiment": -0.3254901960784313, "wgt": 150, "relevance": 1, "stanza_neg": 5, "stanza_neu": 4, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7006723387", "lang": "eng", "isDuplicate": false, "date": "2022-04-17", "time": "07:25:00", "dateTime": "2022-04-17T07:25:00Z", "dateTimePub": "2022-04-17T07:17:00Z", "dataType": "news", "sim": 0.47843137383461, "url": "https://tfipost.com/2022/04/has-the-third-world-war-already-started/", "title": "Has the third world war already started?", "body": "Slowly, the crisis seems to be turning into a world war engulfing the globe\n\nAs soon as it was confirmed during the late 1940s that the world is divided into capitalist and communist blocks, the tremors of the third world war were nightmares for the people. The world was lucky for nearly 70 years as no war escalated so much that it could polarise the world. But, the all-knowing nation USA seems to have accidentally done it through the Russia-Ukraine war.\n\nIf Russian state media and its experts are to be believed then even people living outside both countries should start arranging resources for emergency use. According to them, the war has now converted into a full-blown world war. On one side, there is Putin led Russia while on another side there is NATO, primarily a military organisation of 30 countries.\n\nRecently, the Moskova, a Russian flagship vessel, sank in the Black Sea. While Russians claimed that it caught fire due to a technical glitch. Ukraine claimed that it was its Neptune missile that destroyed the Russian flagship.\n\nAt the time of writing, Russians have refrained from using any war measure which could be termed as a counter to sinking Moskova, its information network has responded fiercely. Russia 1, a 66-year-old Russian state-owned channel stated that the war has finally escalated into a full-blown world war. \"What it is escalated into can safely be called world war three\" and insisted \"that's entirely for sure.\" said Olga Skabeyeva\n\nRead more: What Makes PM Modi and President Putin's friendship so special\n\nOlga pressed on the need to recognise that now NATO has become more insidious in its approach. \"Now we're definitely fighting against Nato infrastructure, if not Nato itself. We need to recognise that.\" added Olga. In one of the videos circulating on the Internet, it is being claimed that Russian commentators are now asking Putin to declare a war on Ukraine. They also hinted at bombing Ukraine with a Nuclear bomb.\n\nhttps://twitter.com/NowInUkraine/status/1514870832970960896\n\nDmitry Drozdenko, another military commander opined, \"In actual fact, a full-scale multi-level war is underway with the collective West. And the West has long been preparing for the war.\" Olesya Loseva, another anchor, said that the West is supplying zillions of weapons to Ukraine to fight against Russia. She accused the Ukrainian administration of being an active NATO supporter as they are now committing more heinous crimes against Russia.\n\nRead more: Jaishankar explains the difference between Cold War-era NATO the futuristic QUAD\n\n\"These will force people to shudder once again and say that Russia Is a country which is unworthy of even being on the world map and that all Russians should simply be wiped off the face of the earth\", added Olesya.\n\nNo one knows in which way the war will take shape, but initial indications are all signalling toward a completely bipartisan tilt, which was the basis of former two world wars. Ukraine is enjoying overwhelming support from the USA, UK and other countries supporting the so-called 'liberal world order'. These countries are actively providing both financial and military support to Ukraine. On the back of these supports, Ukraine has been able to resurrect itself to a certain level. Ukraine's assertion on the sinking of the Russian vessel should also be seen in this regard.\n\nRussia on the other hand has got its own sets of allies. The countries which are fed up with USA and its constant backstabbing have either decided to overtly go with Russia or have taken a neutral stand in the ongoing crisis. India is one of the neutral countries, but it has taken advantage of the ongoing crisis by increasing economic cooperation with the Putin administration. Basically, it has indicated that it is not going to be dictated by the US' stand on any issue. However, if the call arrives, India will be reluctant to send its soldiers to the war zone.\n\nRead more: Despite India's tacit support to Russia, EU can't do without India\n\nRussia is getting tacit support from its fellow oil-producing nations. Russia knows that it can anytime choke Europe's fuel supply, but that won't be enough. This is the reason why Putin administration has been proactive in pulling Oil Producing Cartel called Organisation of Petroleum Exporting Countries (OPEC) under its fold. In what is being seen as tacit support to Russia, Saudi Arabia led cartel has refused to ramp up the oil production to provide relief to US and its allies.\n\nThe western world may claim that they are actively pursuing betrayal of Russia, but effectively they are funding the war against Ukraine. On the diplomatic channels they claim that Russia is committing a crime against humanity, but when it comes to reality, most of Europe is dependent on Russian gas. However, Europe has claimed that it is planning to rid itself of Russian gas.\n\nSlowly but steadily, a polarization is taking place. The trends suggest that anti-west countries like Russia, OPEC etc will be on one side, while the US and its allies on the other. It may sound premature for some. But, the world war is not declared in a day, it takes months and sometimes years to develop into a full-fledged war engulfing the globe.", "source": {"uri": "tfipost.com", "dataType": "news", "title": "TFIPOST"}, "authors": [], "image": "https://tfipost.com/wp-content/uploads/2022/04/ww3.jpg", "eventUri": "eng-7641352", "sentiment": -0.4666666666666667, "wgt": 122, "relevance": 1, "stanza_neg": 6, "stanza_neu": 40, "stanza_pos": 2, "swn_neg": 48, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7008784859", "lang": "eng", "isDuplicate": false, "date": "2022-04-19", "time": "05:17:00", "dateTime": "2022-04-19T05:17:00Z", "dateTimePub": "2022-04-19T05:16:00Z", "dataType": "news", "sim": 0.47843137383461, "url": "https://www.lewrockwell.com/?post_type=pending-article&p=839461", "title": "Russian TV Anchor Says We're Now IN World War 3 - LewRockwell", "body": "Need further proof that this war is only going to escalate? How about a Russian state-sponsored TV anchor now saying that we're in World War 3?\n\nFor those unaware, it was late last week that the Russian Black Sea flagship, the Moskva (named after Moscow), was sunk. Ukraine claims that they sunk the ship with Neptune missiles. Russia claims that the ship was sunk by a fire.\n\nHowever, we now have the Russian state media claiming that the sinking of the Moskva is cause for war (which, to me, means that the whole \"it caught fire\" story is nonsense.) It was on the Russian-sponsored Rossiya 1 (Russia 1) TV show that well-known Russian journalist Olga Skabeyeva hosted a pundit talk session.\n\nRegarding the current war, Skabeyeva said during the interview that \"One can safely call what it has escalated into World War 3. That's absolutely for sure.\" She went on to say, \"Right now, we're definitely fighting against NATO infrastructure, if not NATO itself. We need to recognize that.\"\n\nSkabeyeva also referred to Russia, in reality, being in a war against the United States of America, as she said that America is supplying large amounts of weapons to the Ukrainians.\n\nDuring the episode, one of the pundits claimed that what Russia needed to do was to bomb Kiev. \"Bomb them once, and that's it,\" the man said. What kind of bomb the guest on the show (it's very difficult to find his name) was referring to isn't clear. Does he mean nuclear? That's a one-and-done response.\n\nSkabeyeva is one of the top media figures in Russia. At 37-years-old, she is an incredibly popular journalist within Russia, gaining fame after her coverage of the Pussy Riot trial from 2012 to 2013, in which a female punk rock band was arrested and tried after performing an anti-Putin song at a cathedral in Russia.\n\nIt was after 2016 that Skabeyeva started a talk show with her husband Yevgeny Popov called 60 Minutes. The couple is well known for being very hardcore towards anybody who says anything remotely anti-Putin.\n\nIf Skabeyeva has said it, this means that she does so with the blessing of the Kremlin. While there is the chance that the Kremlin wants its people to engage in this type of hardline talk, as Moscow knows that it will result in widespread fear amongst outsiders, I doubt that this is simple saber-rattling. Things are too heated right now for me to believe so. The man who is already swinging is more apt to swing again than the man who hasn't begun.\n\nWhile a single journalist doesn't necessarily speak for an entire country, it is worth pointing out that Russia 1 is state-sponsored. What is said on the show has to match up with what the Kremlin approves of. Otherwise, you end up sharing the same fate as particular punk rockers. This could very well mean that we are looking at the imminent expansion of this war.\n\nWe've already pointed out here before that there have been other rhetoric in the past that is clearing the way for more countries to become involved in a potential World War 3. The likelihood of this type of event, or at the very least an attack against American soil, only increases as politicians continue to pump billions of American taxpayer dollars into Ukraine in the form of weaponry, funds, and equipment.\n\nIf we look back through recent history, we find that Russia seems to prefer utilizing cyber-attacks and sabotage before they engage in anything conventional. Prior to the invasion, Ukraine experienced the largest cyber-attack they'd ever seen.\n\nThree weeks before the Russo-Georgian war of 2008 ever \"officially\" began, Russia engaged in a series of cyberattacks against the finance, government, and communications sectors of Georgia.\n\nEstonia had largescale cyberattacks for three weeks in 2007 perpetrated against them by the Russians after the Estonians moved a statue of a Soviet World War 2 memorial. It is highly likely that any direct action against America by Russia would first start off with a cyberattack as a result.\n\nActs of sabotage on American soil would likely occur at the same time.\n\nIt's worth noting that numerous alphabet soup agencies have been warning about the threat of cyberattacks against Americans just within the past three weeks.\n\nPrepare for disruptions to daily life. Do you have enough food?\n\nIf Americans are forced into World War 3 by the actions of NATO, modern Americans are going to see things unfold that they've only read about in their lifetime. I'm growing more and more of the mind that Americans urgently need to focus on their food storage.\n\nIn the event of a nuclear strike, Cresson Kearney points out that it's not until two weeks after a blast that people can begin to wander out of a fallout shelter for a few hours. This means you would be in that fallout shelter for much longer than two weeks, and would need that much food. And even if it's not a nuclear strike that we see, but a cyberattack, don't forget that the banking systems seem to be a prime target in recent history.\n\nIf you can't get cash out to buy food and your credit card won't work, what do you do? Put away enough food for your family now rather than later.\n\nWhen somebody you don't exactly have the best of histories with begins to talk about openly fighting with you, it's best to pay attention.", "source": {"uri": "lewrockwell.com", "dataType": "news", "title": "Lew Rockwell"}, "authors": [], "image": "https://lrc-cdn.s3.amazonaws.com/assets/2021/02/LRC-share.jpg", "eventUri": "eng-7641352", "sentiment": -0.3098039215686275, "wgt": 122, "relevance": 1, "stanza_neg": 9, "stanza_neu": 37, "stanza_pos": 2, "swn_neg": 48, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]