[{"uri": "7115142027", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "00:46:00", "dateTime": "2022-07-15T00:46:00Z", "dateTimePub": "2022-07-15T00:41:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://qtelegram.com/rocket-attack-on-vinnitsa-details-video-photo-18/25582/", "title": "Rocket attack on Vinnitsa: details (video, photo +18) - The Quebec provincial newspaper", "body": "The tragic morning of July 14: as a result of Russian rocket attacks on Vinnitsa, dozens of people were injured of varying degrees of complexity, the city of - massive destruction of civilian infrastructure. But the worst - these are the dead civilians, among which - children. Three \"arrivals\" recorded missiles of the Caliber class, and all three - on civilian objects.\n\nThe Vinnitsa City Council was the first and officially confirmed the information about the explosions in the Telegram channel. \"Explosions were heard in Vinnitsa. Don't come out of hiding. Don't distribute photos and videos,\" authorities wrote.\n\nThe head of the Vinnytsia regional state administration, Sergei Borzov, also confirmed the attacks on the city: \"There is an arrival in Vinnytsia. There are dead and wounded. Quantity is being specified. 4 missiles over the region shot down air defense forces.\n\nIn turn, the head of the National Police of Ukraine Igor Klymenkoreported the following information: in Vinnitsa on July 14, 2022, three Russian missiles hit a building with office space. The House of Officers and nearby residential buildings were also damaged by the blows.\n\n\"Now (at the time of \"arrival\" - around 11:00, -ed.) it is known about six wounded and two dead, among who were a small child. A fire broke out at the place of arrival, the fire overturned into the parking lot. There are currently about 50 vehicles on fire. Rescuers are working to put out the fire.\n\nA specialized investigative group of the Main Investigation Department and a forensic laboratory were urgently sent to Vinnytsia,\" the report says.\n\nThe head of the Office of the President of Ukraine Andriy Yermak also confirmed the hit of missiles on a civilian object >, calling the attack on Vinnytsia a \"terrorist act of the Russian Federation\".\n\n\"Killing civilians on the streets of Ukrainian cities, rocket attacks on residential buildings, a bombed-out drama theater in Mariupol, a shopping center in the city of Kremenchug... Russia should be recognized as a sponsor of terrorism...\", - wrote Andriy Yermak in his Telegram -channel under the video with the consequences of \"arrival\" in Vinnitsa.\n\nAdviser to the head of the Ministry of Internal Affairs of Ukraine Anton Gerashchenko wrote in his Telegram channel that one of the rockets fell near the new maternity hospital and posted a video. However, this information has not yet been confirmed:\n\n13:13As of 13:00, the death toll in Vinnitsa has risen to 12 people, including a small child. At least 30 wounded are known. Rescue work underway.\n\n13:46As of 13:40, 17 dead and at least 50 injured were reported. 90 people applied for medical help. The total number of victims of the missile attack is being specified.\n\n13:56The Russian Federation attacked Vinnitsa with Kalibr-type missiles, launching them from a submarine in the water area Yury Gnat, representative of the Ukrainian Air Force Command.\n\n14:00As of this hour, 20 dead are already known, including 3 children, about 90 people turned to medical institutions for help. Rescue operations continue, the number of victims is being specified.\n\n14:59\"Tonight the Armed Forces of Ukraine will ask them (Russian Federation - ed.) for Vinnitsa, Nikolaev and Kharkov... We will hit them. They are after us...\", - Written by Advisor to the Office of the President of Ukraine Oleksiy Arestovichin your Telegram channel. - ...Shooting cruise missiles in the city center during the day - this is not just a violation of the rules of war - it is a denial of the logic and conquests of civilization as such... And civilization gives the answer...\"\n\n16:46As of as of 16:35 : 21 people died (including 3 children), 91 people sought medical help, 52 people were hospitalized (of which 4 children), 34 people are in serious condition. The search continues for 42 people with whom there is no connection.\n\n< br /> 16:58The Russians committed the terrorist attacks in Vinnitsa at the same time that a conference was held in The Hague on the responsibility of the Russian Federation for the crimes it committed on the territory of Ukraine. this is how Foreign Minister Dmytro Kuleba commented on the tragedy.\n\n17:57As of 17:00, rescuersdiscovered 22 dead . Only 6 of them have been identified.\n\n20:07The death toll from the rocket attack on Vinnitsa has increased to 23. This was reported in the State Emergency Service, emphasizing that the rescuers spoke about the ongoing search for 42 people. The doctors hospitalized 64 victims: five are in critical condition, 34 people - in serious condition. A total of 115 people sought medical help.\n\nJuly 15 was declared a Day of Mourning in Vinnitsa and the region.\n\nPHOTOREPORT FROM VINNITSA (the site of the tragedy : photo +18,© State Emergency Service of Ukraine)\n\n(photo © State Emergency Service of Ukraine)\n\nMignews.ua continues to monitor events in Vinnitsa and Ukraine", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-7868051", "sentiment": -0.3176470588235294, "wgt": 192, "relevance": 1, "stanza_neg": 12, "stanza_neu": 40, "stanza_pos": 0, "swn_neg": 52, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7117184687", "lang": "eng", "isDuplicate": false, "date": "2022-07-16", "time": "19:24:00", "dateTime": "2022-07-16T19:24:00Z", "dateTimePub": "2022-07-16T19:23:00Z", "dataType": "news", "sim": 0.7490196228027344, "url": "https://www.freedomsphoenix.com/Article/328797-2022-07-16-imperial-tool-antonio-guterres-reinvents-reality-on-vinnitsa-ukraine.htm", "title": "Imperial Tool Antonio Guterres Reinvents Reality on Vinnitsa, Ukraine", "body": "Imperial Tool Antonio Guterres Reinvents Reality on Vinnitsa, Ukraine\n\nOn July 14, Russia's Foreign Ministry said \"Kalibr high-precision sea-based missiles attacked the building of the House of Officers in the city of Vinnitsa.\"\n\n\"At the time of the strike, a meeting was taking place in the facility between the command of the Ukrainian air force and representatives of foreign arms suppliers about the next batch of aircraft and weapons to the Ukrainian military, as well as organizing the repair of the Ukrainian aviation fleet.\"\n\nEveryone involved in the meeting was eliminated.\n\nOn Thursday, Russia's UN mission senior councilor, Yevgeny Varganov, said the following about the Vinnitsa strike.\n\nThroughout its SMO, \"Russia str(uk) only at military targets in Ukraine.\"\n\n\"The attack on Vinnitsa hit the House of Officers, which the armed forces of Ukraine used for training.\"\n\nYet once again, imperial tool UN secretary general Guterres turned reality on its head through his spokesman, as follows, saying:\n\nHe's \"appalled by today's missile attack against the city of Vinnitsa in central Ukraine that reportedly killed at least 22 people, including three children and wounded more than 100 others (sic).\"\n\nHe \"condemns any attacks against civilians or civilian infrastructure and reiterates his call for accountability for such violations (sic).\"\n\nFact: No Russian attack on civilians or nonmilitary infrastructure occurred at any time throughout its liberating SMO.\n\nFact: No Vinnitsa civilians were killed by Russian forces.\n\nFact: Yet in cahoots with his US master, he pretended otherwise by falsely and maliciously making phony accusations about Russia's Vinnitsa strike.\n\nIn response, Russia's Foreign Ministry spokeswoman, Maria Zakharova, said the following:\n\n\"(C)ontrary to the requirements of the UN Charter, (Guterres) fail(ed) to take an equidistant stance, which is what one would expect from the UN) secretariat...particularly designed to help resolve disputes.\"\n\n\"(T)he UN secretariat('s) goal is not to take anyone's side in controversial situations but to facilitate efforts to maintain peace and stability.\"\n\n\"This is what they are paid for and what they are mandated to do.\"\n\nRussia's Vinnitsa strike \"targeted a garrison officers' club where consultations between the command of the Ukrainian air forces and representatives of foreign weapons suppliers were underway.\"\n\n\"Guterres (failed) to ask Ukraine why the Kiev regime keeps establishing military facilities in close proximity to civilian ones.\"\n\nWhile falsely accusing Russia of attacking civilians, he turned a blind eye to over 8 years of Kiev aggression on Donbass residential areas, killing around 14,000 civilians, along with destroying or damaging civilian infrastructure.\n\nLike most of his predecessors, imperial tool Guterres disgraces the office he holds time and again.\n\nMost everything claimed about Russia's SMO by US/Western regimes, Nazi-infested Ukraine, their MSM press agents and imperial tool Guterres have been bald-faced Big Lies.\n\nCollectively, their rubbish has been the most outrageous perversions of reality in modern memory.\n\nWith no end of it any time soon, they and the rogue regimes they represent risk unthinkable US/NATO aggression against Russia by accident or design.\n\nIf occurs, chances of hostilities going nuclear will be ominously high, an armageddon scenario if things turn out this way.\n\nSeparately in response to hegemon USA's delivery of multiple-launch rocket systems (HIMARS) to Ukrainian Nazis, Zakharova, said the following:\n\nThe US-controlled, Nazi-infested Kiev regime is \"us(ing) (them) against civilians\" -- with intent to kill, wound or maim maximum numbers of Donbass noncombatants in harm's way.\n\nAt the same time, the Pentagon and CIA are selecting civilian and other targets for Ukrainian Nazis to terror-shell, including with intent to kill or otherwise harm Donbass children.\n\nIn early July, Vladimir Putin said \"Russia and the Russian government, the country's leadership will do everything to help the people who live and work\" in Donbass.\n\nTake off the gloves. Strike all Ukrainian decision-making centers everywhere, including the regime's HQ in Kiev.\n\nEliminate them, including the regime's high command and US/Western officials operating in Ukraine with them.\n\nThen go all-out to smash the made-in-the-USA Ukrainian monster once and for all.\n\nTreat the empire of lies and its Western vassals with toughness -- the only language they understand.\n\nWhenever undertaken by Russia with the US-dominated West, betrayal follows every time.\n\nTheir regimes are not partners, their officials not colleagues.", "source": {"uri": "freedomsphoenix.com", "dataType": "news", "title": "freedomsphoenix.com"}, "authors": [{"uri": "stephen_lendman@freedomsphoenix.com", "name": "Stephen Lendman", "type": "author", "isAgency": false}], "image": "https://www.FreedomsPhoenix.com/Uploads/Pix/533/07/533-0716063044.jpg", "eventUri": "eng-7868051", "sentiment": -0.4117647058823529, "wgt": 191, "relevance": 1, "stanza_neg": 7, "stanza_neu": 28, "stanza_pos": 2, "swn_neg": 37, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115586709", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "09:44:00", "dateTime": "2022-07-15T09:44:00Z", "dateTimePub": "2022-07-15T09:35:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.rt.com/russia/559038-russia-comments-airstrike-vinnitsa/", "title": "Russia comments on deadly strike on Ukrainian city  --  RT Russia & Former Soviet Union", "body": "The Russian military has confirmed launching a missile attack at a target in the city of Vinnitsa in Ukraine. It denied claims that it was a deliberate strike on civilians, stating that it hit Ukrainian military commanders as they negotiated with foreign arms suppliers.\n\nRussia attacked the House of Military Officers in Vinnitsa with sea-launched Kalibr cruise missiles, the Defense Ministry said on Friday during a daily briefing. The statement claimed that the attack happened when a group of Ukrainian senior military officers were holding a meeting with foreign arms suppliers. The discussion was about the \"transfer of more warplanes and weapons systems as well as the repair of the Ukrainian military air fleet,\" the ministry said. The Russian strike killed all participants at the gathering.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.07/article/62d1366485f5405e415e9b09.jpg", "eventUri": "eng-7868051", "sentiment": -0.4745098039215686, "wgt": 184, "relevance": 1, "stanza_neg": 1, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115911350", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "14:19:00", "dateTime": "2022-07-15T14:19:00Z", "dateTimePub": "2022-07-15T14:01:00Z", "dataType": "news", "sim": 0.6823529601097107, "url": "https://tass.com/politics/1480647", "title": "UN fails to take balanced stance on situation around Vinnitsa  --  Russian diplomat", "body": "MOSCOW, July 15. /TASS/. The UN Secretariat has failed to take an balanced stance on the developments in the Ukrainian city of Vinnitsa, Russian Foreign Ministry Spokeswoman Maria Zakharova said.\n\nWhen asked to comment on UN Secretary General Antonio Guterres's statments about developments in Vinnitsa, she said that \"contrary to the requirements of the UN Charter, the Secretariat fails to take an equidistant stance, which is what one would expect from the secretariat of the most reputable international organization, particularly designed to help resolve disputes.\"\n\n\"I would like to remind my respected colleagues at the UN Secretariat that their goal is not to take anyone's side in controversial situations but to facilitate efforts to maintain peace and stability. This is what they are paid for and what they are mandated to do,\" Zakharova pointed out.\n\nShe also emphasized that the United Nations should know from the Russian Defense Ministry's reports that a strike on Vinnitsa, which involved Kalibr high-precision missiles, \"targeted a garrison officers' club where consultations between the command of the Ukrainian air forces and representatives of foreign weapons suppliers were underway.\" \"We recommend that Guterres ask Ukraine why the Kiev regime keeps establishing military facilities in close proximity to civilian ones,\" the Russian diplomat maintained.\n\nBesides, in Zakharova's words, neither Guterres nor any other official from the UN Secretariat condemned \"an attack on civilians and civilian infrastructure\" when it came to the shelling of Kursk, Belgorod or Novaya Kakhovka.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20220715/1360107.jpg", "eventUri": "eng-7868051", "sentiment": 0.03529411764705892, "wgt": 174, "relevance": 1, "stanza_neg": 3, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7116188406", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "18:45:00", "dateTime": "2022-07-15T18:45:00Z", "dateTimePub": "2022-07-15T18:45:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.plenglish.com/news/2022/07/15/russia-confirms-attack-on-ukrainian-base-in-vinnitsa/", "title": "Russia confirms attack on Ukrainian base in Vinnitsa", "body": "Spokesman for the ministry, Major General Igor Konashenkov said that, on July 14, an attack was carried out with high-precision Kalibr missiles launched from the sea against a military house in the city of Vinnitsa.\n\nIn the usual military update, the spokesman explained that, at the time of the attack, a meeting was taking place in the building between senior officials of the Ukrainian air force and foreign arms suppliers.\n\nKonashenkov said that the Ukrainian soldiers and their foreign suppliers were discussing new supplies of aircraft, air defense systems and the repair of Kiev's air fleet.\n\nThe major general reported that those assembled were eliminated in the attack.\n\nOn Thursday, Director of the RT television network and the Rossiya Segodnya media group, Margarita Simonian, reported, citing Russia's Ministry of Defense, that the Russian Armed Forces carried out an attack on a provisional deployment point for nationalists in the Ukrainian city of Vinnitsa.\n\nFor their part, Kiev authorities denounced that the attack affected, in addition to this military facility, several buildings in the area.\n\nAccording to the latest assessment of the Ukrainian police, this action killed 23 people, including three children; 14 people went missing and another 82 were hospitalized.", "source": {"uri": "plenglish.com", "dataType": "news", "title": "Agencia Informativa Latinamericana Prensa Latina"}, "authors": [], "image": "https://www.plenglish.com/wp-content/uploads/2021/11/4._Identificador_Vertical_Color-Institucional-1.png", "eventUri": "eng-7868051", "sentiment": -0.4196078431372549, "wgt": 170, "relevance": 1, "stanza_neg": 1, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 7, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7114753285", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "16:42:00", "dateTime": "2022-07-14T16:42:00Z", "dateTimePub": "2022-07-14T16:40:00Z", "dataType": "news", "sim": 0.6196078658103943, "url": "https://qtelegram.com/rocket-strikes-on-vinnitsa-bodies-of-22-dead-found/25539/", "title": "Rocket strikes on Vinnitsa: bodies of 22 dead found - The Quebec provincial newspaper", "body": "Rocket strikes on Vinnitsa: as of 17:00, the bodies of 22 dead were found. Only 6 of them were identified.\n\n▪️DNA tests may be needed to identify the dead, so investigators are asking direct relatives (parents and children) of the missing to get in touch and provide biological samples.\n\nIn total, 39 people remain on the list of missing people as a result of rocket attacks on Vinnitsa. In addition, about a hundred people received damage of various degrees of severity.\n\n▪️More than 50 buildings for various purposes and more than 40 cars were damaged by strikes.", "source": {"uri": "qtelegram.com", "dataType": "news", "title": "The Quebec provincial newspaper"}, "authors": [{"uri": "elizabeth_stone@qtelegram.com", "name": "Elizabeth Stone", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-7868051", "sentiment": -0.5529411764705883, "wgt": 158, "relevance": 1, "stanza_neg": 3, "stanza_neu": 3, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]