[{"uri": "7258693506", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "17:44:00", "dateTime": "2022-11-10T17:44:00Z", "dateTimePub": "2022-11-10T17:27:00Z", "dataType": "news", "sim": 0.800000011920929, "url": "https://censor.net/en/news/3379699/enemy_is_continuing_to_equip_defenses_on_left_bank_of_dnipro_and_is_conducting_offensive_operations", "title": "Enemy is continuing to equip defenses on left bank of Dnipro and is conducting offensive operations in Bakhmut, Avdiivka and Novopavlivsk directions, - General Staff", "body": "Operational information of the General Staff of the Armed Forces of Ukraine regarding the Russian invasion as of 6:00 p.m. on November 10, 2022.\n\nThis is reported by Censor.NET with reference to the page of the General Staff of the Armed Forces of Ukraine.\n\n\"Glory to Ukraine! It has been 260 days of heroic resistance of the Ukrainian nation to the Russian large-scale invasion. The enemy is trying to hold the temporarily captured territories, is concentrating its efforts on restraining the actions of the Defense Forces in certain directions, and is continuing the equipment of defensive lines on the left bank of the Dnipro River. At the same time, it is conducting offensive operations on the Bakhmut, Avdiivka and Novopavlivsk directions.\n\nAccording to the Commander-in-Chief of the Armed Forces of Ukraine, during the past day, in the direction of Petropavlivka-Novoraisk, units of the Defense Forces of Ukraine advanced 7 kilometers and took control of 6 settlements. The situation is similar in the direction of Pervomaiske-Kherson, where our troops also took control of 6 settlements.\n\nAreas of populated areas of Donetsk, Luhansk, Dnipropetrovsk, and Zaporizhzhia regions were hit by the enemy.\n\nIn the Volyn and Polissia directions, the situation remains without significant changes. The Republic of Belarus continues to support the armed aggression of the Russian Federation against Ukraine, providing it with infrastructure, territory and airspace. The formation of the Russian-Belarusian grouping of troops on the territory of the Republic of Belarus continues.\n\nThe enemy shelled in other directions:\n\nIn order to replenish current losses and strengthen the group of occupiers in the Kherson direction, in the temporarily occupied territory of the Donetsk region, military personnel who retreated from the Kharkiv direction are being searched and detained. As a feature, the sending of groups of invaders without warm clothes, equipment, means of protection and weapons is noted - they are promised to be delivered directly to the area of hostilities.\n\nThe training of those mobilized in military educational institutions on the territory of the Russian Federation continues. So, according to available information, the next batch of the specified category of persons is expected to be sent from Smolensk in the second decade of November. This group was trained at the Air Defense Military Academy of the Armed Forces of the Russian Federation.\n\nDuring the current day, the aviation of the Defense Forces of Ukraine struck the enemy 8 times. 7 areas of concentration of personnel, weapons and military equipment, as well as the position of the enemy's anti-aircraft defenses, were affected. During the day, soldiers of the missile forces and artillery hit the command post, 8 areas of concentration of manpower, weapons and military equipment, 2 ammunition depots, 5 air defense systems and other important military objects of the Russian occupiers.\n\nWe believe in the Armed Forces! Together we will win! \"Glory to Ukraine!\" - says the information of the General Staff of the Armed Forces of Ukraine.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/c/f/b/4/cfb4f44b4e82ca523027cba5f9ff517e/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": 0.0117647058823529, "wgt": 204, "relevance": 1, "stanza_neg": 5, "stanza_neu": 18, "stanza_pos": 2, "swn_neg": 25, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258326510", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "12:39:00", "dateTime": "2022-11-10T12:39:00Z", "dateTimePub": "2022-11-10T12:18:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.ukrinform.net/rubric-ato/3611471-general-staff-armed-forces-of-ukraine-had-347-clashes-with-enemy-this-week.html", "title": "General Staff: Armed Forces of Ukraine had 347 clashes with enemy this week", "body": "This week, there have been 347 armed clashes between the Armed Forces of Ukraine and the enemy.\n\n\"A total of 347 armed clashes have taken place during the operation of the Defense Forces this week. The enemy has launched 32 missile strikes and 134 airstrikes on our territory,\" Brigadier General Oleksiy Hromov, Deputy Chief of the Main Operational Department of the General Staff of the Armed Forces of Ukraine, said at a briefing.\n\nAccording to him, the situation in Volyn, Zhytomyr, and Kyiv directions is stable. At the same time, the Russian troops continue to build up in the territory of Belarus.\n\n\"In the territory of the Republic of Belarus, measures to deploy a regional group of troops of the so-called allied state, which can operate in Volyn and Polissia operational areas, are taken. The relevant law enforcement agencies and local self-government bodies of the Republic of Belarus train and receive the Russian military contingent from among the persons mobilized in the territory of the Russian Federation,\" the Brigadier General said.\n\nIn Chernihiv and Sumy directions, the enemy has launched more than 40 disturbing strikes on the territory of Ukraine since the beginning of the week. The civilian infrastructure objects were hit in the areas of three settlements of Chernihiv region and 13 settlements of Sumy region.\n\nIn Kharkiv direction, the enemy has made futile attempts to go on the offensive in the areas of several settlements, Hromov informed.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_09/thumb_files/630_360_1664538053-815.jpg", "eventUri": "eng-8169941", "sentiment": -0.2470588235294118, "wgt": 184, "relevance": 1, "stanza_neg": 1, "stanza_neu": 8, "stanza_pos": 1, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7260614023", "lang": "eng", "isDuplicate": false, "date": "2022-11-12", "time": "05:25:00", "dateTime": "2022-11-12T05:25:00Z", "dateTimePub": "2022-11-12T05:18:00Z", "dataType": "news", "sim": 0.6901960968971252, "url": "https://www.ukrinform.net/rubric-ato/3612630-ukrainian-forces-repel-enemy-attacks-near-14-settlements.html", "title": "Ukrainian forces repel enemy attacks near 14 settlements", "body": "That's according to the General Staff of the Armed Forces of Ukraine, Ukrinform reports.\n\n\"In the liberated settlements of the Kherson region, units of the Defense Forces of Ukraine are conducting stabilization measures. The enemy is improving the fortification equipment of the defensive lines on the left bank of the Dnipro River and is trying to hold the temporarily captured territories. At the same time, it is conducting offensive operations in the Bakhmut, Avdiivka and Novopavlivka directions,\" the report said.\n\nOver the past 24 hours, units of the Defense Forces have repelled Russian attacks outside the settlements of Masiutivka and Orlianka in the Kharkiv region, Novoselivske, Miasozharivka, Makiivka and Bilohorivka in the Luhansk region and Soledar, Bakhmut, Krasnohorivka, Verkhnokamianske, Pervomaiske, Nevelske, Marinka and Pavlivka in the Donetsk region.\n\nThe enemy continues to shell units of the Defense Forces along the entire contact line and conducts aerial reconnaissance. The enemy continues to strike critical infrastructure and civilian homes in violation of international humanitarian law, the laws and customs of war.\n\nOver the past 24 hours, the enemy has launched four missile attacks and 23 air strikes, using MLRS more than 70 times. More than 25 settlements in the Kharkiv, Luhansk, Donetsk, Vinnytsia, Zaporizhzhia, Kherson and Mykolaiv regions came under fire.\n\nIn the temporarily occupied territories of the Donetsk, Luhansk and Zaporizhzhia regions, the enemy continues to use the buildings and territory of religious organizations, educational and health care institutions for the accommodation of military personnel, military equipment and the construction of firing positions for mortars and artillery.\n\nIn the temporarily occupied territory of the Donetsk region, relations between mobilized Russian soldiers and the occupiers from the Chechen Republic remain tense. Three people were wounded in another skirmish in the city of Makiivka, Donetsk region.\n\nIt was confirmed that Ukraine's Defense Forces had hit an area of concentration of the occupiers in the Zaporizhzhia region on November 10. As a result, the enemy lost more than 100 people wounded. Information about those killed is being clarified.\n\nOver the past 24 hours, Ukrainian aircraft have launched 16 strikes against the enemy, hitting 13 areas of concentration of personnel, weapons and military equipment, as well as three positions of the enemy's anti-aircraft missile systems.\n\n\"Over the past 24 hours, our soldiers have shot down at least one hostile Orlan UAV. Units of the rocket forces and artillery of the Defense Forces hit two control points, nine areas of concentration of manpower, weapons and military equipment, and two other important military targets of the occupiers,\" the General Staff of the Armed Forces of Ukraine added.\n\nThe Defense Forces of Ukraine eliminated about 79,400 Russian invaders from February 24 to November 11.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_10/thumb_files/630_360_1667121417-169.jpg", "eventUri": "eng-8169941", "sentiment": -0.388235294117647, "wgt": 176, "relevance": 1, "stanza_neg": 6, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7260175583", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "18:17:00", "dateTime": "2022-11-11T18:17:00Z", "dateTimePub": "2022-11-11T17:54:00Z", "dataType": "news", "sim": 0.6823529601097107, "url": "https://www.ukrinform.net/rubric-ato/3612486-ukrainian-forces-reach-right-bank-of-dnieper-in-certain-areas-of-kherson-region.html", "title": "Ukrainian forces reach right bank of Dnieper in certain areas of Kherson region", "body": "As a result of successful offensive actions in the Kherson direction, Ukraine's Defense Forces have already reached the right bank of the Dnieper in certain areas.\n\nThe relevant statement was made by the General Staff of the Armed Forces of Ukraine on Facebook, an Ukrinform correspondent reports.\n\n\"The Defense Forces continue to liberate the Ukrainian land in the Kherson direction. As part of successful offensive actions, the forward units of our forces have already reached the right bank of the Dnieper in certain areas,\" the report states.\n\nIn a number of settlements, measures are being taken to reveal and neutralize enemy units. For security reasons, the details will be officially provided later.\n\nAccording to the General Staff, at the moment Russian troops are focusing efforts on restraining the actions of Ukraine's Defense Forces in certain areas, improving fortifications within the defense frontiers on the left bank of the Dnieper and in the north of the temporarily occupied Crimea.\n\nAt the same time, Russian invaders are conducting offensive actions in the Bakhmut, Avdiivka and Novopavlivka directions.\n\nOver the past day, the enemy has launched three missile strikes and nine air strikes, and opened fire with multiple launch rocket systems (MLRS) over 10 times. Settlements in such regions as Kharkiv, Donetsk, Vinnytsia, Kherson and Mykolaiv came under enemy fire.\n\nIn the Volyn and Polissia directions, the situation remained rather unchanged. Belarus continues to support Russia's armed aggression against Ukraine, providing the enemy with its infrastructure, territory and airspace.\n\nThe formation of the Russian-Belarusian grouping of troops is underway in Belarus. The threat of missile and air strikes from the territory of Belarus is persisting.\n\nIn the Slobozhanskyi direction, Russian invaders opened fire near the Kharkiv region's Anyskyne, Bolohivka, Vilkhuvatka, Ohirtseve and Strilecha with different artillery systems.\n\nIn the Kupiansk and Lyman directions, Russian troops used tanks and different artillery systems to strike the Kharkiv region's Berestove and the Luhansk region's Miasozharivka, Novoselivske, Nevske and Stelmakhivka.\n\nIn the Bakhmut direction, the enemy opened fire near the Donetsk region's Andriivka, Bakhmut, Bakhmutske, Bilohorivka, Maiorsk, New York and Yakovlivka with tanks, mortars, cannon and rocket artillery.\n\nIn the Avdiivka direction, Russian occupiers used tanks and the whole range of artillery to strike the Donetsk region's Avdiivka, Vesele, Krasnohorivka, Marinka, Nevelske and Pervomaiske.\n\nIn the Novopavlivka and Zaporizhzhia directions, Russian troops struck over 30 settlements with tanks, mortars, cannon and rocket artillery, including the Donetsk region's Bohoiavlenka, Velyka Novosilka, Vodiane, Vuhledar and Novopil, and the Zaporizhzhia region's Huliaipole, Mali Shcherbaky and Olhivske.\n\nAccording to the confirmed data, Russia's Mi-8 helicopter was destroyed near the Zaporizhzhia region's Dniprovka.\n\nNear Enerhodar, Ukrainian forces hit an enemy command post. Russian troops lost over 50 soldiers in killed and over 40 in wounded. Additionally, a Russian Ka-52 helicopter was destroyed.\n\nFollowing the strikes launched by Ukraine's Defense Forces on a headquarters of Russian troops in the Kherson region's Chervonyi Maiak, over 30 Russian invaders were reported killed. Two enemy tanks and four trucks were destroyed.\n\nOver the past day, Ukrainian air forces have launched five strikes on enemy personnel, ammunition and military equipment clusters.\n\nUkraine's missile and artillery units struck a Russian command post, two personnel, ammunition and military equipment clusters, two ammunition depots, and three other important enemy targets.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_10/thumb_files/630_360_1664922796-691.jpg", "eventUri": "eng-8169941", "sentiment": -0.02745098039215688, "wgt": 174, "relevance": 1, "stanza_neg": 10, "stanza_neu": 16, "stanza_pos": 1, "swn_neg": 27, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7260106561", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "17:10:00", "dateTime": "2022-11-11T17:10:00Z", "dateTimePub": "2022-11-11T17:02:00Z", "dataType": "news", "sim": 0.6823529601097107, "url": "https://censor.net/en/news/3379973/in_some_places_armed_forces_have_already_reached_right_bank_of_dnipro_general_staff", "title": "In some places, Armed Forces have already reached right bank of Dnipro, - General Staff", "body": "Operational information as of 6:00 p.m. on 11.11.2022 regarding the Russian invasion.\n\nThis is reported by Censor.NET with reference to the page of the General Staff of the Armed Forces of Ukraine.\n\n\"The two hundred and sixty-first day of the heroic resistance of the Ukrainian nation to the large-scale Russian invasion continues.\n\nDefense forces continue to liberate Ukrainian lands in the Kherson direction. In the course of successful offensive actions, advanced units of our troops have already reached the right bank of the Dnipro in some places. Measures to identify and destroy the enemy in a number of settlements are ongoing. Due to the safety of the operation, the official release of the results will be provided at a later date.\n\nThe enemy is concentrating its efforts on restraining the actions of the Defense Forces in certain directions, improving the fortification equipment of the defensive lines on the left bank of the Dnipro and in the north of the temporarily occupied territory of the Autonomous Republic of Crimea. At the same time, it conducts offensive operations in the Bakhmut, Avdiivka and Novopavliv directions.\n\nDuring the current day, the enemy launched 3 missiles and 9 air strikes, carried out more than 10 attacks from rocket salvo systems.\n\nAreas of populated areas of Kharkiv, Donetsk, Vinnytsia, Kherson, and Mykolaiv regions suffered enemy attacks.\n\nThe situation in the Volyn and Polissia directions has not changed significantly. The Republic of Belarus continues to support the armed aggression of the Russian Federation against Ukraine, providing it with infrastructure, territory and airspace. The formation of the Russian-Belarusian grouping of troops on the territory of the Republic of Belarus continues. There is still a threat of the enemy launching missiles and air strikes from the territory and airspace of this country.\n\nThe enemy shelled in other directions:\n\nAccording to detailed information, the destruction of an enemy Mi-8 helicopter was confirmed in the area of the settlement of Dniprovka, Zaporizhzhia region.\n\nIn the area of the city of Enerhodar, an enemy control post was hit - more than 50 occupants were killed and more than 40 were wounded. A Ka-52 helicopter was also destroyed.\n\nAs a result of accurate strikes by the Defense Forces on the headquarters of the Russian occupying forces in the settlement of Chervony Maiak, Kherson Region, more than 30 occupants were killed, 2 tanks and 4 trucks were destroyed.\n\nDuring the current 24 hours, the Ukrainian aviation carried out 5 strikes on areas where the enemy's personnel, weapons and military equipment are concentrated.\n\nSoldiers of missile troops and artillery of the Defense Forces during the current day hit the command post, 2 areas of concentration of manpower, weapons and military equipment, 2 ammunition warehouses and 3 other important military objects of the enemy,\" the message reads.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/e/b/7/9/eb79cbfdae1ae76d6b966b91a69e714e/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": -0.01960784313725494, "wgt": 174, "relevance": 1, "stanza_neg": 8, "stanza_neu": 14, "stanza_pos": 1, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259414903", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "07:24:00", "dateTime": "2022-11-11T07:24:00Z", "dateTimePub": "2022-11-11T07:24:00Z", "dataType": "news", "sim": 0.6705882549285889, "url": "https://censor.net/en/news/3379778/ukrainian_defenders_repelled_attacks_by_occupiers_in_areas_of_14_settlements_in_donetsk_and_luhansk", "title": "Ukrainian defenders repelled attacks by occupiers in areas of 14 settlements in Donetsk and Luhansk regions, - General Staff", "body": "Last day, the Armed Forces of Ukraine repelled the attacks of the occupiers in the areas of 10 settlements in the Donetsk region and 4 in the Luhansk region.\n\nThis is reported by Censor.NET with reference to the summary of the General Staff of the Armed Forces of Ukraine as of 06:00 a.m. on November 11 regarding the Russian invasion.\n\nThe two hundred and sixty-first day of the heroic resistance of the Ukrainian nation to the large-scale Russian invasion has begun.\n\nDefense forces continue to liberate Ukrainian lands. During the successful offensive of our troops in the Kherson direction, on November 9 this year, 12 settlements were liberated: Dudchany, Piatykhatky, Borozenske, Sadok, Bezvodne, Ishchenka, Kostromka, Krasnoliubetsk, Kalinivske, Bobrovy Kut, Bezimenne and Blahodatne. Offensive actions in the specified direction continue. Therefore, due to the safety of the operation, the official announcement of the results will be made later.\n\nOver the past day, units of the Defense Forces have repelled attacks by the occupiers in the areas of the settlements of Novoselivske, Miasozharivka, Makiivka, and Bilohorivka in the Luhansk region and Vesele, Soledar, Bakhmut, Andriivka, Krasnohorivka, Opytne, Pervomaiske, Nevelske, Mariinka, and Pavlivka in the Donetsk region.\n\nThe enemy does not stop shelling units of the Defense Forces along the entire contact line, conducts aerial reconnaissance. It continues to strike critical infrastructure and civilian homes in violation of International Humanitarian Law, the laws and customs of war.\n\nOver the past 24 hours, the Russian occupiers have launched one missile and 17 airstrikes, launched almost 100 attacks from multiple rocket launchers. About 20 settlements in the Kharkiv, Luhansk, Donetsk, Dnipropetrovsk, Zaporizhzhia, and Mykolaiv regions were affected by these criminal actions.\n\nThe situation in the Volyn and Polissia directions has not changed significantly. The formation of a Russian-Belarusian grouping of troops on the territory of the Republic of Belarus continues. There is still a threat of the enemy launching missile and air strikes, including using strike UAVs from the territory and airspace of the Republic of Belarus.\n\nThe enemy shelled in other directions:\n\nin the Siversk direction - from mortars, in the areas of the settlements of Gremiach in the Chernihiv region and Kindrativka in the Sumy region;\n\nin the Slobozhansk direction - from mortars, rocket, and barrel artillery, in the areas of the settlements of Strilecha, Starytsa, Ohirtseve, Anyskyne, Vilkhuvatka;\n\nin the Kupiansk and Lyman directions - from tanks and artillery of various calibers, in the areas of the settlements of Ivanivka, Kyslivka, Tabaiivka, Berestovka, Stelmakhivka, Miasozharivka, Novoselivske, Makiivka, and Nevske;\n\nin the Bakhmut direction - from tanks and the entire spectrum of artillery, in the areas of the settlements of Bilohorivka, Rozdolivka, Yakovlivka, Soledar, Bakhmutske, Bakhmut, Opytne, Andriivka, Kurdiumivka, Toretsk, New York and Mayorsk;\n\nin the Avdiivka direction - from tanks and artillery of various types, in the areas of the settlements of Vesele, Avdiivka, Vodiane, Pervomaiske, Nevelske, Krasnohorivka, Mariinka, Paraskoviivka, and Novomykhailivka;\n\nin the Novopavlivka and Zaporizhzhia directions - from tanks, mortars, barrel and jet artillery, in the areas of the settlements of Vuhledar, Bohoiavlenka, Pavlivka, Prechystivka, Velyka Novosilka, Neskuchne, Bilohiria, Stepove, and Shevchenko.\n\nIn the South Buh direction, Novokyivka, Dobra Nadia, Illinka, Marhanets, Nikopol, and Musiivka of the Dnipropetrovsk region were hit by artillery fire.\n\nThe Russian invaders continue to loot the settlements from which they are retreating. The enemy is also trying to damage power lines and other elements of the transport and critical infrastructure of the Kherson region as much as possible.\n\nThe forced eviction of local residents from separate settlements in the territories temporarily occupied by the enemy in the Kherson region continues. In the village of Zelenivka, the enemy forbade residents to move around the settlement and is refurbishing the system of defensive lines. In Tiahinka and Kozatske, the occupiers mined roads and infrastructure elements, there are facts of the detonation of the civilian population.\n\nDuring the past day, the aviation of the Defense Forces struck the enemy 10 times. 7 areas of concentration of personnel, weapons, and military equipment, as well as 3 positions of the enemy's anti-aircraft missile systems, were affected.\n\nOver the past day, the Defense Forces shot down an enemy Ka-52 helicopter. Soldiers of the missile forces and artillery struck 2 control points, 10 areas of concentration of manpower, weapons, and military equipment, 3 ammunition depots, 5 air defense facilities, and 2 other important military facilities of the Russian occupiers.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/e/4/f/9/e4f920db36109c29dbddf74259bb9654/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": -0.09019607843137256, "wgt": 171, "relevance": 1, "stanza_neg": 5, "stanza_neu": 26, "stanza_pos": 2, "swn_neg": 33, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7257514019", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "21:22:00", "dateTime": "2022-11-09T21:22:00Z", "dateTimePub": "2022-11-09T20:59:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://censor.net/en/news/3379436/during_current_day_enemy_carried_out_8_missile_and_10_air_strikes_carried_out_more_than_4_attacks_from", "title": "During current day, enemy carried out 8 missile and 10 air strikes, carried out more than 4 attacks from anti-aircraft missiles, - General Staff", "body": "The General Staff of the Armed Forces of Ukraine released operational information regarding the Russian invasion as of 6:00 p.m. on November 9.\n\nAs Censor.NET informs, this was reported on the official Facebook page of the General Staff.\n\nThe evening summary reports: \"The two hundred and fifty-ninth day of the heroic resistance of the Ukrainian nation to the Russian large-scale invasion continues.\n\nDuring the current day, the enemy launched 8 missiles and 10 air strikes, carried out more than 4 attacks from rocket salvo systems.\n\nAreas of more than 15 settlements of the Dnipropetrovsk, Donetsk, Mykolaiv, and Sumy regions were hit by the enemy.\n\nIn the Volyn and Polissia directions, the situation remains without significant changes. The Republic of Belarus continues to support the armed aggression of the Russian Federation against Ukraine, accepts and hosts Russian servicemen, and provides training grounds. The formation of a joint Russian-Belarusian grouping of troops is underway. The threat of enemy strikes and the use of attack UAVs from the territory and airspace of the Republic of Belarus remains.\n\nThe enemy shelled in other directions:\n\nThe moral and psychological condition of mobilized Russian citizens undergoing training in the Kursk and Bryansk regions is significantly deteriorating due to the difference between the picture of Russian propaganda and the actual situation, inhumane conditions of stay and lack of promised payments.\n\nRussian units undergoing training in the area of the city of Baranovichi, Brest region, were issued obsolete weapons and property - metal helmets of the Second World War model and means of protection from the period of the 60-70 years of the last century. In addition, a large part of small arms, namely AK-74 assault rifles, are in non-working condition due to poor storage conditions.\n\nAccording to detailed information, the Russian occupiers are taking away looted property and stolen cars from the city of Severodonetsk, Luhansk region. Looting takes place under cover and accompanied by representatives of the occupation's so-called state security agencies.\n\nDuring the current day, the aviation of the Defense Forces of Ukraine struck the enemy 4 times. 2 areas of concentration of personnel, weapons and military equipment, as well as 2 positions of the enemy's anti-aircraft defense equipment, were damaged.\n\nAlso, our soldiers shot down 5 \"Shakhed\" and 2 \"Orlany\" UAVs in different directions.\n\nDuring the current day, units of missile forces and artillery of the Defense Forces hit 6 areas of concentration of manpower, weapons and military equipment, 2 electronic warfare stations and other important military objects of the enemy.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/e/a/e/9/eae93f7a06475dc386840eb956e3979e/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": -0.207843137254902, "wgt": 170, "relevance": 1, "stanza_neg": 7, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7260420710", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "23:31:00", "dateTime": "2022-11-11T23:31:00Z", "dateTimePub": "2022-11-11T23:30:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2022-11-11.htm", "title": "\nUkraine", "body": "A number of claims and counterclaims are being made on the Ukraine-Russia conflict on the ground and online. While GlobalSecurity.org takes utmost care to accurately report this news story, we cannot independently verify the authenticity of all statements, photos and videos.\n\nOn 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War. Russian President Vladimir Putin announced a \"special military operation\" (SVO - spetsialnaya voennaya operatsiya) in Ukraine in response to the appeal of the leaders of the \"Donbass republics\" for help. That attack is a blatant violation of the territorial integrity, sovereignty and independence of Ukraine. Putin stressed that Moscow's goal is the demilitarization and denazification of the country. The military buildup in preceeding months makes it obvious that the unprovoked and dastardly Russian attack was deliberately planned long in advance. During the intervening time, the Russian government had deliberately sought to deceive the world by false statements and expressions of hope for continued peace.\n\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\" [Judgment of the International Military Tribunal]\n\nThe UK Ministry of Defence reported that since 10 October, Russia has attacked Ukraine with a campaign of strikes targeting electric power infrastructure. To date, this action has come in waves. The most recent intense strikes were on 31 October, which involved targeting hydroelectric dam facilities for the first time. The strikes have resulted in widespread damage to transmission stations and power plants. Scheduled and emergency blackouts have become routine in parts of Ukraine, with Kyiv notably impacted.\n\nRecoverability varies, and the impacts of strikes are unlikely to be felt uniformly. Continued degradation of networks by Russian strikes will almost certainly have consequences for interlinked water and heating systems, that will be most significantly felt by the civilian population during winter, as demand increases.\n\nRussian strikes on power generation and transmission are having a disproportionate effect upon civilians in Ukraine, indiscriminately impacting critical functions such as healthcare and heating. The continued prioritisation of critical national infrastructure over military targets strongly implies Russian intent to strike at civilian morale.\n\nThe General Staff of the Armed Forces of Ukraine reported that Ukrainian defense forces continue to liberate Ukrainian lands in the Kherson direction. In the course of successful offensive actions, advanced units of Ukrainian troops have already reached the right bank of the Dnieper in some places. Measures to identify and destroy Russian forces in a number of settlements are ongoing. Due to the safety of the operation, the official release of the results will be provided at a later date.\n\nRussia is concentrating its efforts on restraining the actions of the Defense Forces in certain directions, improving the fortification equipment of the defensive lines on the left bank of the Dnieper and in the north of the temporarily occupied territory of the Autonomous Republic of Crimea. At the same time, it conducts offensive operations in the Bakhmut, Avdiivka and Novopavlivka directions.\n\nDuring the current day, Russian forces launched 3 missile and 9 air strikes, carried out more than 10 attacks from rocket salvo systems. Areas of populated areas of Kharkiv, Donetsk, Vinnytsia, Kherson and Mykolaiv oblasts suffered Russian attacks.\n\nThe situation in the Volyn and Polissya directions has not changed significantly. The Republic of Belarus continues to support the armed aggression of the russian federation against Ukraine, providing it with infrastructure, territory and airspace. The formation of the russian-belarusian grouping of troops on the territory of the Republic of Belarus continues. There is still a threat of the Russian forces launching missile and air strikes from the territory and airspace of Ukraine.\n\nThe enemy shelled in such other directions:\n\nAccording to detailed information, the destruction of a Russian Mi-8 helicopter was confirmed in the area of the settlement of Dniprovka, Zaporizhzhia oblast. In the area of the city of Enerhodar, a Russian control post was hit - more than 50 occupants were killed and more than 40 were wounded. A Ka-52 helicopter was also destroyed.\n\nAs a result of accurate strikes by the Ukrainian Defense Forces on the headquarters of the Russian occupying forces in the settlement of Chervony Mayak, Kherson oblast, more than 30 occupants were killed, 2 tanks and 4 trucks were destroyed.\n\nDuring the current 24 hours, the Ukrainian aviation carried out 5 strikes on areas where Russia personnel, weapons and military equipment are concentrated. During the current day, soldiers of the missile troops and artillery of the Ukrainian Defense Forces hit the command post, 2 areas of concentration of manpower, weapons and military equipment, 2 ammunition warehouses and 3 other important Russian military objects.\n\nThe Ministry of Defense of the Russian Federation announced the completion of the withdrawal of military units to the left bank of the Dnieper at 5 am on November 11. The Russian fighters did not leave a single piece of military equipment behind them, and also did not suffer losses despite shelling from the enemy. Assistance was provided to all civilians who wished to cross to the left bank.\n\nThe armed forces of Ukraine fired five times at the crossings across the Dnieper. As a result of the work of the air defense forces (Air Defense), 28 shells were shot down. The movement of advanced enemy units at that moment was stopped 30-40 kilometers from the coast due to mine barriers, as well as the work of artillery and aviation.\n\nIn total, more than 30,000 people and over 5,000 units of military equipment, including those that are subject to repair, have been withdrawn. On the accumulations of the Armed Forces of Ukraine on the right bank, a fire defeat was inflicted.\n\nMeanwhile, in the Kupyansky, Limansky and Donetsk directions, the Armed Forces of Ukraine lost more than 275 soldiers, 3 tanks, 10 units of light armored vehicles and 5 vehicles during the day.\n\nAlso hit were 9 command posts of the Armed Forces of Ukraine, an ammunition depot, 52 artillery units and 176 areas of accumulation of manpower and equipment. In the Zolochev area, the M777 battery was suppressed, and near Nevsky, the Akatsy platoon was suppressed. Ukrainian Air Force Mi-8 was shot down over Mirovka.\n\nAir defense forces intercepted 7 drones, 32 rockets and 5 anti-radar missiles.\n\nMeanwhile, in the border regions of the Russian Federation, the construction of defensive fortifications, called the \"Wagner Line\", continues. These defensive structures stretch from the territory of the Donbass to the Belgorod region and are necessary in case of an unforeseen breakthrough by the enemy. The military correspondents of the FAN visited the construction site and learned from the fighters of the PMC \"Wagner\" details about the progress of the work.\n\nThe situation in the Donbass\n\nThe Armed Forces of Ukraine attempted an attack on Zaitsevo and Otradovka, using drones for reconnaissance in the area of Klescheevka-Zaitsevo-Experimental. However, this outing was not successful.\n\nThe command of the Ukrainian grouping in Soledar is expecting a further offensive by the RF Armed Forces, and mobilized people have been transferred to Toretsk to hold the lines.\n\nMeanwhile, the artillery of the 4th brigade of the 2nd corps of the LPR systematically strikes at enemy positions in the area of Disputed.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8169941", "sentiment": -0.1215686274509804, "wgt": 170, "relevance": 1, "stanza_neg": 19, "stanza_neu": 39, "stanza_pos": 1, "swn_neg": 59, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259511718", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "05:13:16", "dateTime": "2022-11-11T05:13:16Z", "dateTimePub": "2022-11-11T05:13:16Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://www.pravda.com.ua/eng/news/2022/11/11/7375868/", "title": "General Staff names 12 settlements liberated in Kherson offensive on 9 November", "body": "The General Staff of the Armed Forces of Ukraine has confirmed that Ukraine regained control over 12 cities, towns and villages on 9 November as a result of a successful offensive on the Kherson front.\n\nSource: General Staff of the Armed Forces of Ukraine on Facebook, information as of 06:00 on 11 November\n\nQuote: \"A total of 12 cities, towns and villages have been liberated as a result of our forces' successful offensive on the Kherson front on 9 November this year, including Dudchany, Piatykhatky, Borozenske, Sadok, Bezvodne, Ishchenka, Kostromka, Krasnoliubetsk, Kalynivske, Bobrovyi Kut, Bezimenne and Blahodatne.\"\n\nDetails: The General Staff has reported that the offensive on the Kherson front is still underway and promised to share official information about its results with time, due to \"concerns about the security of the operation\".\n\nOver the course of the past 24 hours, the Ukrainian Armed Forces have repelled Russian attacks in the vicinity of Novoselivske, Miasozharivka, Makiivka and Bilohorivka in Luhansk Oblast, and Vesele, Soledar, Bakhmut, Andriivka, Krasnohorivka, Opytne, Pervomaiske, Nevelske, Marinka and Pavlivka in Donetsk Oblast.\n\nMeanwhile, Russian forces have continued to fire on units of Ukraine's defence forces along the entire line of contact and are conducting aerial reconnaissance. The Russians are continuing to strike critical infrastructure and civilian homes in violation of international humanitarian law and the laws and customs of war.\n\nOver the course of the past 24 hours, Russian forces carried out 1 missile strike and 17 airstrikes, as well as almost 100 attacks using multiple-launch rocket systems (MLRS). More than 20 Ukrainian cities, towns and villages in Kharkiv, Luhansk, Donetsk, Dnipropetrovsk, Zaporizhzhia and Mykolaiv oblasts came under Russian fire.\n\nWe have launched English Twitter! Follow us!\n\nThere were no significant changes on the Volyn and Polissia fronts. Belarus and Russia are continuing to form a joint military unit on Belarusian ground. There is an ongoing threat of missile and airstrikes (including combat drone attacks) from the territory and airspace of the Republic of Belarus.\n\nOn other fronts, the Russians continued to fire on military and civilian targets:", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [{"uri": "ukrainska_pravda@pravda.com.ua", "name": "Ukrainska Pravda", "type": "author", "isAgency": false}], "image": "https://img.pravda.com/images/doc/1/0/10c0bec-zsu33.jpg", "eventUri": "eng-8169941", "sentiment": -0.0980392156862745, "wgt": 164, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 1, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257474344", "lang": "eng", "isDuplicate": false, "date": "2022-11-09", "time": "20:33:00", "dateTime": "2022-11-09T20:33:00Z", "dateTimePub": "2022-11-09T20:33:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.pravda.com.ua/eng/news/2022/11/9/7375660/", "title": "Mobilised Russian reservists in Belarus supplied with WW2 weapons", "body": "Mobilised Russian reservists near the Belarusian city of Baranovichi have been supplied with WW2 weapons and helmets, some machine guns are out of order.\n\nSource: General Staff of the Armed Forces of Ukraine\n\nQuote: \"Russian units that are undergoing training near the city of Baranovichi in Brest Oblast have been provided with old weapons and metal helmets from the Second World War and protective equipment from the 1960 and 1970s. In addition, most firearms, in particular AK-74 machine guns, are out of service due to bad storage conditions.\"\n\nDetails: Over the course of the day, the Russians carried out eight missile and 10 aviation attacks, as well as more than four attacks using multiple launch rocket systems (MLRS). More than 15 settlements in Dnipropetrovsk, Donetsk, Mykolaiv and Sumy oblasts came under Russian fire.\n\nThere were no sufficient changes on the Volyn and Polissia fronts.\n\nOn other fronts, the Russians continued to fire on military and civilian targets:\n\nThe General Staff of the Armed Forces of Ukraine states that Belarus is continuing to aid and support Russia's military aggression against Ukraine by allowing Russian forces to use its territory, airspace and infrastructure. Belarus and Russia are continuing to form a joint military unit. There is an ongoing threat of missile and airstrikes from the territory of Belarus, including with the use of attack UAVs.\n\nSponsored contentNew Unit.City campuses by Kovalska Industrial and Construction Group. Aesthetics, Innovation and Energy Efficiency in Wartime\n\nThe moral and psychological state of mobilised Russian reservists who are being trained in Kursk and Briansk oblasts in Russia is significantly deteriorating due to the difference between the picture of Russian propaganda and the real situation, inhumane conditions of deployment and absence of promised payments.\n\nAccording to the information updated, the Russian occupiers are taking looted property and stolen cars from the city of Sievierodonetsk in Luhansk Oblast. Looting is taking place under cover and under the guidance of representatives of the occupying \"state security agencies\".\n\nThe Air Force of Ukraine carried out four attacks on the Russians over the course of the day. Two clusters of military personnel, weapons and military equipment, as well as two positions of the Russian anti-aircraft defence systems of the occupiers were struck.\n\nThe Ukrainian forces also shot down five Shahed-136 drones and two Orlan drones on different fronts.\n\nUkrainian Rocket Forces and Artillery struck six clusters of military personnel, weapons and military equipment, two electronic warfare stations and other important sites used by the Russian invaders.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/0/2/02c61d1-630-360-1638226066-564.png", "eventUri": "eng-8169941", "sentiment": -0.3960784313725491, "wgt": 163, "relevance": 1, "stanza_neg": 3, "stanza_neu": 19, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7255161056", "lang": "eng", "isDuplicate": false, "date": "2022-11-08", "time": "07:19:00", "dateTime": "2022-11-08T07:19:00Z", "dateTimePub": "2022-11-08T07:07:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://censor.net/en/news/3378993/on_territory_of_belarus_formation_of_joint_group_of_troops_with_russia_continues_general_staff", "title": "On territory of Belarus, formation of joint group of troops with Russia continues, - General Staff", "body": "In Belarus, together with the Russians, the formation of a group of troops continues.\n\nThis is reported by Censor.NET with reference to the General Staff of the Armed Forces of Ukraine.\n\n\"The situation in the Volyn and Poliske directions has not changed significantly.\n\nThe Republic of Belarus continues to support the armed aggression of the Russian Federation against Ukraine, providing the Russian Federation with infrastructure, territory, and airspace.\n\nThe formation of a Russian-Belarusian grouping of troops on the territory of the Republic of Belarus is underway.\"", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/0/a/9/4/0a94f05c0ec5d981c70a0ed3a0fcabbb/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": 0.02745098039215677, "wgt": 163, "relevance": 1, "stanza_neg": 1, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259075192", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "00:00:00", "dateTime": "2022-11-11T00:00:00Z", "dateTimePub": "2022-11-11T00:00:00Z", "dataType": "news", "sim": 0.6313725709915161, "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2022-11-10.htm", "title": "\nUkraine", "body": "A number of claims and counterclaims are being made on the Ukraine-Russia conflict on the ground and online. While GlobalSecurity.org takes utmost care to accurately report this news story, we cannot independently verify the authenticity of all statements, photos and videos.\n\nOn 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War. Russian President Vladimir Putin announced a \"special military operation\" (SVO - spetsialnaya voennaya operatsiya) in Ukraine in response to the appeal of the leaders of the \"Donbass republics\" for help. That attack is a blatant violation of the territorial integrity, sovereignty and independence of Ukraine. Putin stressed that Moscow's goal is the demilitarization and denazification of the country. The military buildup in preceeding months makes it obvious that the unprovoked and dastardly Russian attack was deliberately planned long in advance. During the intervening time, the Russian government had deliberately sought to deceive the world by false statements and expressions of hope for continued peace.\n\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\" [Judgment of the International Military Tribunal]\n\nThe UK Ministry of Defence reported that on 09 November 2022, Russian Defence Minister Sergey Shoygu ordered the withdrawal of Russian forces from the west bank of the Dnipro river in Kherson, southern Ukraine. General Sergei Surovikin, commander of the Russian forces in Ukraine, confirmed they will withdraw to defensive positions along the Dnipro River, citing re-supply issues as the primary reason for the decision.\n\nRussia's ability to sustain its forces on the west bank of the Dnipro river had been placed under pressure by Ukrainian strikes on Russia's resupply routes. In retreating, Russian forces have destroyed multiple bridges and likely laid mines to slow and delay advancing Ukrainian forces. The loss of Kherson's west bank will likely prevent Russia from achieving its strategic aspiration of a land bridge reaching Odesa.\n\nWith limited crossing points, Russian forces will be vulnerable in crossing the Dnipro River. It is likely that the withdrawal will take place over several days with defensive positions and artillery fires covering withdrawing forces.\n\nThe General Staff of the Armed Forces of Ukraine reported that according to the Commander-in-Chief of the Armed Forces of Ukraine, during the past day, in the direction of Petropavlivka-Novoraisk, units of the Defense Forces of Ukraine advanced 7 kilometers and took control of 6 settlements. The situation is similar in the direction of Pervomaiske-Kherson, where Ukrainian troops also took control of 6 settlements.\n\nRussia is trying to keep the temporarily captured territories, is concentrating its efforts on restraining the actions of the Defense Forces in certain directions, and is continuing the equipment of defensive lines on the left bank of the Dnipro River. At the same time, it conducts offensive operations in the Bakhmut, Avdiivka and Novopavlivka directions. Areas of populated areas of Donetsk, Luhansk, Dnipropetrovsk, and Zaporizhzhia regions were hit by Russian forces.\n\nIn the Volyn and Polissya directions, the situation remains without significant changes. The Republic of Belarus continues to support the armed aggression of the russian federation against Ukraine, providing it with infrastructure, territory and airspace. The formation of the Russian-Belarusian grouping of troops on the territory of the Republic of Belarus continues.\n\nRussian forces shelled in such other directions:\n\nin the Siversky direction - from mortars, in the area of the village of Hremyach, Chernihiv oblast;\n\nin the Slobozhansky direction - from mortars, rocket and barrel artillery, in the areas of the settlements of Strilecha, Ternova, Starytsa, Ohirtseve, Vovchansk and Kolodyazne;\n\non the Kupyansk and Lyman directions - from artillery of various types, in the areas of the settlements of Kislivka, Tabaivka, Berestovka, Lisna Stinka, Stelmakhivka, Myasozharivka, Makiivka, Nevske, Yampolivka and Lyman;\n\nin the Bakhmut direction - from tanks and the entire range of artillery, in the areas of Rozdolivka, Yakovlivka, Soledar, Bakhmutske, Bakhmut, Opytne, Kurdyumivka, Toretsk, New York and Mayorsk settlements;\n\nin the Avdiivka direction - from tanks, mortars, barrel and jet artillery, in the areas of Avdiivka, Opytne, Vodyane, Pervomaiske, Nevelske, Maryinka, Paraskoviivka and Novomykhailivka settlements;\n\nin the Novopavlivsk and Zaporizhzhia directions - from tanks and artillery of various calibers, in the areas of the settlements of Vuhledar, Pavlivka, Novosilka, Neskuchne, Novopil, Temyrivka, Olhivske, Uspenivka, Chervone, Hulyaipole, Zaliznychne, Hulyaipilske, Charivne, Orihiv and Stepove.\n\nMusiiivka, Illinka, and Novokiivka of the Dnipropetrovsk oblast were directly hit by artillery fire in the South Buh direction.\n\nIn order to prevent the advance of units of the Ukrainian Defense Forces, the Russian occupying forces are increasing the fortification equipment of the positions in the temporarily occupied territory of the Zaporizhzhia oblast. In order to speed up the pace of engineering works, the Russian occupiers are trying to involve the civilian local population.\n\nIn order to replenish current losses and strengthen the group of occupiers in the Kherson direction, in the temporarily occupied territory of the Donetsk region, military personnel who retreated from the Kharkiv direction are being searched and detained. As a feature, the sending of groups of invaders without warm clothes, equipment, means of protection and weapons is noted - they are promised to be delivered directly to the area of hostilities.\n\nThe training of those mobilized in military educational institutions on the territory of the Russian Federation continues. So, according to available information, the next batch of the specified category of persons is expected to be sent from Smolensk in the second decade of November. This group was trained on the basis of the Air Defense Military Academy of the Armed Forces of the Russian Federation.\n\nDuring the current day, the aviation of the Defense Forces of Ukraine struck the enemy 8 times. 7 areas of concentration of personnel, weapons and military equipment, as well as the position of Russia's anti-aircraft defenses, were affected. During the day, soldiers of the Ukrainian missile forces and artillery hit the command post, 8 areas of concentration of manpower, weapons and military equipment, 2 ammunition depots, 5 air defense systems and other important military objects of the Russian occupiers.\n\nStatements of the Ministry of Defense of the Russian Federation\n\nDuring the briefing, the Russian Ministry of Defense reported that at the moment in the Nikolaev-Krivoy Rog direction, units of the Russian Armed Forces are maneuvering to prepared positions on the left bank of the Dnieper River.\n\nThe Ministry of Defense also stated that during the day in the Kupyansky direction, the Armed Forces of Ukraine made unsuccessful attempts to attack in the direction of Kuzemovka (Lugansk People's Republic, LPR), but were stopped and dispersed at distant approaches. More than 90 Ukrainian fighters, a tank and 4 armored fighting vehicles were destroyed.\n\nIn the Limansky direction, an attempt by the Armed Forces of Ukraine to attack in the direction of Stelmakhivka and Ploshchanka (LPR) was thwarted. Enemy losses amounted to 70 people killed and wounded.\n\nA counterattack of the Armed Forces of Ukraine in the direction of Nikolsky (Donetsk People's Republic, DPR) was repulsed in the South-Donetsk direction. Up to 55 militants, a tank and 2 armored fighting vehicles were destroyed.\n\nAviation, rocket troops and artillery hit 2 command posts of the Armed Forces of Ukraine and foreign mercenaries in the areas of Nikolaev and the village of Dry Stavok (Kherson region), 46 artillery units, manpower and military equipment in 153 districts. In the areas of Liman (DPR), Novogrigorovka (Kherson region) and Novopoltavka (Nikolaev region), 3 AN / TPQ-50 counter-battery radar stations were destroyed. In the area of Annovka (Dnepropetrovsk region) a fuel storage facility for the Armed Forces of Ukraine equipment was destroyed, in the area of Novoaleksandrivka (Mykolaiv region) -- a depot of artillery ammunition of the Armed Forces of Ukraine.\n\nFighter aircraft of the Russian Aerospace Forces in the Nikolaev region shot down a Su-25 of the Ukrainian Air Force. A Ukrainian Mi-8 was destroyed in the air over Rizdvyanka (Zaporozhye region).\n\nAir defense systems shot down 9 unmanned aerial vehicles (UAVs) in the LPR, DPR, Zaporozhye and Kherson regions. 21 shells of HIMARS and Alder multiple launch rocket systems (MLRS), 3 HARM anti-radar missiles were intercepted.\n\nKherson region\n\nThe possibility of the population leaving the right-bank part of the Kherson region remains, said the deputy head of the regional administration Ekaterina Gubareva. According to her, this can now be done only in private. The entrance to the right bank is closed.\n\nZaporozhye region\n\nA major terrorist attack at a youth forum was prevented in Berdyansk. 2 Ukrainian saboteurs were detained, who tried to bring explosives to the event, they resisted during the arrest. According to RT, during interrogation, the attackers admitted that they loaded the bombs with striking elements so that more citizens would suffer.\n\nVladimir Rogov, a member of the main council of the administration of the Zaporozhye region, announced Kyiv's plans to attack the Zaporozhye nuclear power plant again. According to him, at least 700 Ukrainian militants may take part in the capture attempt.\n\n\"They are now training in forcing the Dnieper, taking a bridgehead and capturing large objects of man-made origin,\" Rogov emphasized.\n\nDNR\n\nDuring the day, Ukrainian troops shelled Donetsk, as well as the settlements of Yasinovataya, Aleksandrovka, Makeevka, Gorlovka, Kremenets, Zhovanka, Mineralnoe, Zaitsevo. As a result of the attacks, a civilian was killed in Makiivka, and 3 were also reported wounded in Donetsk, Yasinovataya and Horlivka. Fixed damage to residential buildings and civil infrastructure. In Makiivka, a shell hit a residential building, and in Gorlovka, an administrative building.\n\nRussian units have taken control of the village of Pavlovka in the Ugledar direction, the Rybar Telegram channel reports.\n\nThe Commissioner for Human Rights in the DPR, Daria Morozova, said that Ukraine, after the start of a special operation by the RF Armed Forces, abandoned its spies and military personnel arrested in previous years in the republic. According to her, recently these people have begun to increasingly turn to the authorities of the DPR in order to understand what awaits them.\n\nActing head of the DPR Denis Pushilin said that everyone who was there was tortured in Ukrainian captivity. A group of servicemen who returned in early November was in a particularly bad condition: 4 out of 19 fighters were hospitalized in a critical condition.\n\nPushilin also said that due to the inaction of a number of officials in the DPR, the structure of the government is being reformed, some of its members will be empowered with the powers of deputy prime ministers. He added that an analysis of the activities of officials at various levels will be carried out, after which the authorities will make appropriate decisions \"up to dismissal with a wolf ticket.\"\n\nLC\n\nDuring the day, Ukrainian troops opened fire on Stakhanov, Artemovsk, Krinichny and Svatovo, using HIMARS MLRS. As a result of attacks in Krinichnoye, 2 employees of the mine were killed, 4 more people were injured, mine structures were damaged. In Svatovo, 6 residential buildings, workshops of a construction company, a gas pipeline and a power line were damaged.\n\n35 servicemen of the NM LNR returned to the republic from Ukrainian captivity. According to Ombudsman Victoria Serdyukova, the condition of the fighters is unsatisfactory.", "source": {"uri": "globalsecurity.org", "dataType": "news", "title": "GlobalSecurity.org"}, "authors": [{"uri": "john_pike@globalsecurity.org", "name": "John Pike", "type": "author", "isAgency": false}], "image": null, "eventUri": "eng-8169941", "sentiment": -0.1529411764705882, "wgt": 161, "relevance": 1, "stanza_neg": 28, "stanza_neu": 58, "stanza_pos": 1, "swn_neg": 87, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7255202100", "lang": "eng", "isDuplicate": false, "date": "2022-11-08", "time": "08:03:00", "dateTime": "2022-11-08T08:03:00Z", "dateTimePub": "2022-11-08T07:57:00Z", "dataType": "news", "sim": 0.6196078658103943, "url": "https://www.pravda.com.ua/eng/news/2022/11/8/7375405/", "title": "Belarus and Russia form a joint military unit - General Staff", "body": "Belarus and Russia are continuing to form a joint military unit.\n\nSource: General Staff of the Armed Forces of Ukraine on Facebook\n\nQuote: \"There were no significant changes on the Volyn and Polissia fronts.\n\nThe Republic of Belarus is continuing to aid and support the Russian Federation's military aggression against Ukraine by allowing it to use Belarusian infrastructure, territory and airspace.\n\nBelarus and Russia are continuing to form a joint military unit on the territory of the Republic of Belarus.\"", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/f/3/f39f85a-7765a1a-bilorus690-.jpg", "eventUri": "eng-8169941", "sentiment": 0.003921568627450966, "wgt": 158, "relevance": 1, "stanza_neg": 0, "stanza_neu": 5, "stanza_pos": 0, "swn_neg": 5, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7260631746", "lang": "eng", "isDuplicate": false, "date": "2022-11-12", "time": "05:56:00", "dateTime": "2022-11-12T05:56:00Z", "dateTimePub": "2022-11-12T05:55:00Z", "dataType": "news", "sim": 0.615686297416687, "url": "https://censor.net/en/news/3380041/enemy_attacks_were_repulsed_in_area_of_14_settlements_in_three_regions_general_staff", "title": "Enemy attacks were repulsed in area of 14 settlements in three regions, - General Staff", "body": "The two hundred and sixty-second day of the Ukrainian nation's resistance to a large-scale Russian invasion has begun. In the liberated settlements of the Kherson region, units of the Defense Forces of Ukraine are carrying out stabilization measures.\n\nThis is reported by Censor.NET with reference to the press center of the General Staff of the Armed Forces of Ukraine.\n\nAs noted, the enemy is improving the fortification equipment of the defensive lines on the left bank of the Dnieper and is trying to hold the temporarily captured territories. At the same time, he conducts offensive operations in the Bakhmut, Avdiivka, and Novopavlivka directions.\n\n\"During the past day, units of the Defense Forces repelled the attacks of the occupiers in the areas of Masiutivka and Orlianka in the Kharkiv region; Novoselivske, Miasozharivka, Makiivka, and Bilohorivka in the Luhansk region, and Soledar, Bakhmut, Krasnohorivka, Verkhniokamianske, Pervomaiske, Nevelske, Mariinka and Pavlivka of the Donetsk region,\" the report says.\n\nIt is also noted that the enemy does not stop shelling units of the Defense Forces along the entire line of contact, conducts aerial reconnaissance. It continues to strike critical infrastructure and civilian homes in violation of International Humanitarian Law, the laws and customs of war.\n\nOver the past day, the enemy launched 4 missiles and 23 air strikes, launched more than 70 attacks from rocket salvo systems. More than 25 settlements in the Kharkiv, Luhansk, Donetsk, Vinnytsia, Zaporizhzhia, Kherson, and Mykolaiv regions were hit.\n\nThe situation in the Volyn and Polissia directions has not changed significantly. The formation of the Russian-Belarusian grouping of troops on the territory of the Republic of Belarus continues. The threat of missile and air strikes by the enemy remains.\n\nAccording to the General Staff, the enemy fired in other directions:\n\nin the Slobozhansk direction - from mortars and barrel artillery, in the areas of the settlements of Bolohorivka, Vilkhuvatka, Krasne, Ohirtseve, and Starytsia of the Kharkiv region;\n\nin the Kupyansk and Lyman directions - from tanks and artillery of various calibers, in the areas of the settlements of Bilohorivka, Kyslivka, Krokhmalne, Makiivka, Nevske, Novoselivske and Stelmakhivka of the Luhansk region; Berestove, Kupiansk, and Tabaivka in Kharkiv region and Serebrianka and Terny in Donetsk region;\n\nin the Bakhmut direction - from tanks and the entire range of artillery, in the areas of Andriivka, Bakhmut, Bakhmutske, Verkhnyokamianske, Zalizne, Klishchiivka, Mayorsk, Opytne, Soledar, and Yakovlivka settlements of the Donetsk region;\n\nin the Avdiivka direction - from tanks, mortars, barrel and jet artillery, in the areas of Avdiivka, Vesele, Vodiane, Kamianka, Kostiantynivka, Krasnohorivka, Mariinka, Nevelske and Novomykhailivka settlements in Donetsk region;\n\nin the Novopavlivka direction - from tanks and artillery of various types, in the areas of Bohoiavlenka, Velyka Novosilka, Vremivka, Vuhledar, Neskuchne, Pavlivka, and Prechistivka settlements of the Donetsk region;\n\nin the Zaporizhzhia region - from tanks and the entire range of artillery, in the areas of the settlements of Dorozhnianka, Huliaypole, Zeleny Hay, Malynivka, Olhivske, Stepove, Charivne, Chervone, and Shcherbaky of the Zaporizhzhia region;\n\nin the South Buh direction - from the artillery of various types, in the areas of the settlements of Vyshchetarasivka in the Dnipropetrovsk region and Havrylivka, Dudchany, Zolota Balka, Mykhailivka and Novooleksandrivka in the Kherson region.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/c/4/5/7/c457a4dda8f67d48722890b6e148138b/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": -0.2784313725490196, "wgt": 157, "relevance": 1, "stanza_neg": 3, "stanza_neu": 18, "stanza_pos": 1, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7257952441", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "07:25:00", "dateTime": "2022-11-10T07:25:00Z", "dateTimePub": "2022-11-10T05:31:00Z", "dataType": "news", "sim": 0.6000000238418579, "url": "https://www.pravda.com.ua/eng/news/2022/11/10/7375711/", "title": "Ukrainian Armed Forces repel Russian attacks near 12 cities and villages - General Staff report", "body": "Over the course of the past 24 hours, the Armed Forces of Ukraine have repelled Russian attacks in the vicinity of Novoselivske and Makiivka in Luhansk Oblast and Soledar, Klishchiivka, Maiorsk, Yakovlivka, Andriivka, Bilohorivka, Vesele, Nevelske, Pervomaiske and Novomykhailivka in Donetsk Oblast.\n\nSource: General Staff of the Armed Forces of Ukraine on Facebook, information as of 06:00 on 10 November\n\nQuote: \"Enemy forces are firing on units of [Ukraine's] defence forces along the line of contact, reinforcing defence lines on several fronts and conducting aerial reconnaissance. They are continuing to carry out attacks on critical infrastructure and civilian homes in violation of the norms of international humanitarian law and the laws and customs of war.\"\n\nDetails: Over the course of the past 24 hours, Russian forces carried out 11 missile strikes and 22 airstrikes, as well as over 35 attacks using multiple-launch rocket systems (MLRS). More than 30 Ukrainian cities, towns and villages in Donetsk, Luhansk, Dnipropetrovsk, Zaporizhzhia, Mykolaiv, Sumy and Kherson oblasts came under Russian fire.\n\nThere were no significant changes on the Volyn and Polissia fronts. The Republic of Belarus is continuing to aid and support Russia's military aggression against Ukraine, including by accommodating Russian forces on its territory and offering Belarusian military training grounds for their training. Belarus and Russia are continuing to form a joint military unit. There is an ongoing threat of Russia deploying combat drones from Belarusian territory and the airspace.\n\nOn other fronts, the Russians continued to fire on military and civilian targets:\n\nJournalists fight on their own frontline. Support Ukrainska Pravda or become our patron!", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/f/c/fcd87fb-zsu2.jpg", "eventUri": "eng-8169941", "sentiment": -0.3019607843137255, "wgt": 153, "relevance": 1, "stanza_neg": 1, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258354057", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "13:02:00", "dateTime": "2022-11-10T13:02:00Z", "dateTimePub": "2022-11-10T13:02:00Z", "dataType": "news", "sim": 0.6000000238418579, "url": "https://censor.net/en/news/3379620/during_week_there_were_347_combat_clashes_between_armed_forces_of_ukraine_and_occupiers_general_staff", "title": "During week, there were 347 combat clashes between Armed Forces of Ukraine and occupiers, - General Staff", "body": "During the current week, 347 combat clashes with the Russian occupiers took place during the operation of the Defense Forces.\n\nThis was announced by the Deputy Chief of the Main Operational Department of the General Staff of the Armed Forces of Ukraine, Brigadier General Oleksiy Hromov, Censor.NET reports with reference to Ukrinform.\n\n\"In general, during the current week, during the operation of the Defense Forces, 347 combat clashes took place. The enemy launched 32 missile and 134 air strikes on our territories,\" Hromov said.\n\nAccording to him, the situation is stable in the Volyn, Zhytomyr, and Kyiv directions. At the same time, the concentration of Russian troops continues on the territory of Belarus.\n\nIn the Chernihiv and Sumy directions since the beginning of the week, the enemy has carried out more than 40 disturbing shelling of the territory of Ukraine: on civil infrastructure objects in the areas of three settlements of the Chernihiv region and 13 settlements of the Sumy region.\n\nIn the Kharkiv direction, the enemy made offensive attempts in the areas of a number of settlements, but was unsuccessful, informed Hromov.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1a.censor.net/images/0/c/a/7/0ca706f48a0c0794a1222a45ac6f6f34/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": -0.2941176470588235, "wgt": 153, "relevance": 1, "stanza_neg": 2, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 9, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258791905", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "19:22:00", "dateTime": "2022-11-10T19:22:00Z", "dateTimePub": "2022-11-10T18:51:00Z", "dataType": "news", "sim": 0.5803921818733215, "url": "https://www.ukrinform.net/rubric-ato/3611782-enemy-fortifying-positions-in-zaporizhzhia-region-on-left-bank-of-kherson-region.html", "title": "Enemy fortifying positions in Zaporizhzhia region, on left bank of Kherson region", "body": "The General Staff of the Armed Forces of Ukraine said this in its latest operational update, Ukrinform reports.\n\nIt is noted that during the past day in the Petropavlivka-Novoraisk direction, units of the Defense Forces of Ukraine advanced 7 kilometers and regained control over six settlements. The situation is similar in the Pervomaiske-Kherson direction, where Ukrainian troops also regained control over six settlements.\n\nAccording to the General Staff, the enemy is trying to hold the temporarily captured territories, focusing its efforts on attempts to disrupt the actions of the Defense Forces in certain directions, fortifying defensive positions on the left bank of the Dnipro River. At the same time, the enemy is conducting offensive operations in the Bakhmut, Avdiivka and Novopavlivka directions.\n\nIt is noted that settlements of Donetsk, Luhansk, Dnipropetrovsk, and Zaporizhzhia regions came under enemy fire over the past day.\n\nIn particular, in the Volyn and Polissia directions, the situation has not changed significantly. The Republic of Belarus continues to support the Russian armed aggression against Ukraine, providing it with access to infrastructure, territory and airspace. The formation of a joint Russian-Belarusian group of troops is currently underway.\n\nIn other directions, the enemy used tanks, mortars and artillery of various types to shell settlements:\n\nin the Severskyi direction, the enemy struck the area of Hremiach settlement in Chernihiv region;\n\nin the Slobozhanske direction - the areas of Strelecha, Ternova, Starytsa, Ohirtseve, Vovchansk and Kolodyazne;\n\nin the Kupiansk and Lyman directions - the areas of Kyslivka, Tabaivka, Berestovka, Lisna Stinka, Stelmakhivka, Miasozharivka, Makiivka, Nevske, Yampolivka and Lyman;\n\nin the Bakhmut direction - the areas of Rozdolivka, Yakovlivka, Soledar, Bakhmutske, Bakhmut, Opytne, Kurdiumivka, Toretsk, New York and Mayorsk;\n\nin the Avdiivka direction - the areas of Avdiivka, Opytne, Vodiane, Pervomaiske, Nevelske, Maryinka, Paraskoviivka and Novomykhailivka;\n\nin the Novopavlivske and Zaporizhzhia directions - the areas of Vuhledar, Pavlivka, Novosilka, Neskuchne, Novopil, Temyrivka, Olhivske, Uspenivka, Chervone, Huliaipole, Zaliznychne, Huliaipilske, Charivne, Orikhiv and Stepove;\n\nin the Southern Buh direction - the areas of Musiiivka, Illinka and Novokyivka of Dnipropetrovsk region.\n\nAccording to the General Staff, to prevent the advance of units of the Defense Forces, the occupying forces are increasing fortification equipment of their positions in the temporarily occupied territory of Zaporizhzhia region. To speed up the pace of engineering works, the occupiers are trying to involve the civilian local population.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_11/thumb_files/630_360_1668103324-122.jpg", "eventUri": "eng-8169941", "sentiment": -0.2, "wgt": 148, "relevance": 1, "stanza_neg": 4, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 19, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259383841", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "06:15:00", "dateTime": "2022-11-11T06:15:00Z", "dateTimePub": "2022-11-11T06:15:00Z", "dataType": "news", "sim": 0.5764706134796143, "url": "https://www.ukrinform.net/rubric-ato/3611922-ukraine-army-liberates-12-settlements-in-kherson-region.html", "title": "Ukraine Army liberates 12 settlements in Kherson region", "body": "On November 9, 2022, as part of successful offensive actions, the Armed Forces of Ukraine liberated 12 settlements in the Kherson direction, namely Dudchany, Piatykhatky, Borozenske, Sadok, Bezvodne, Ishchenka, Kostromka, Krasnoliubetsk, Kalynivske, Bobrovyi Kut, Bezimenne and Blahodatne.\n\nThe relevant statement was made by the General Staff of the Armed Forces of Ukraine on Facebook, an Ukrinform correspondent reports.\n\nOver the past day, Ukrainian forces have repelled enemy attacks near such settlements as the Luhansk region's Novoselivske, Miasozharivka, Makiivka and Bilohorivka, and the Donetsk region's Vesele, Soledar, Bakhmut, Andriivka, Krasnohorivka, Opytne, Pervomaiske, Nevelske, Marinka and Pavlivka.\n\nRussian invaders continue to strike critical infrastructure and civilian houses in violation of international humanitarian law, and the laws and customs of war.\n\nOver the past day, Russian occupiers have launched one missile strike and 17 air strikes, and opened fire with multiple launch rocket systems (MLRS) about 100 times. Nearly 20 settlements came under enemy fire in such regions as Kharkiv, Luhansk, Donetsk, Dnipropetrovsk, Zaporizhzhia and Mykolaiv.\n\nIn the Volyn and Polissia directions, the situation remained rather unchanged. The formation of the Russian-Belarusian grouping of troops continues. The threat of missile and air strikes from the territory of Belarus, including with unmanned combat aerial vehicles (UCAVs), continues.\n\nIn other directions, Russian troops opened fire as follows:\n\nin the Siverskyi direction - near the Chernihiv region's Hremiach and the Sumy region's Kindrativka, with mortars;\n\nin the Slobozhanskyi direction - near such settlements as Strilecha, Starytsia, Ohirtseve, Anyskyne and Vilkhuvatka, with mortars, cannon and rocket artillery;\n\nin the Kupiansk and Lyman directions - near Ivanivka, Kyslivka, Tabaivka, Berestove, Stelmakhivka, Miasozharivka, Novoselivske, Makiivka and Nevske, with tanks and different artillery systems;\n\nin the Bakhmut direction - near Bilohorivka, Rozdolivka, Yakovlivka, Soledar, Bakhmutske, Bakhmut, Opytne, Andriivka, Kurdiumivka, Toretsk, New York and Maiorsk, with tanks and all the available artillery;\n\nin the Avdiivka direction - near Vesele, Avdiivka, Vodiane, Pervomaiske, Nevelske, Krasnohorivka, Marinka, Paraskoviivka and Novomykhailivka, with tanks and different artillery systems;\n\nin the Novopavlivka and Zaporizhzhia directions - near Vuhledar, Bohoiavlenka, Pavlivka, Prechystivka, Velyka Novosilka, Neskuchne, Bilohiria, Stepove and Shevchenko, with tanks, mortars, cannon and rocket artillery;\n\nin the Southern Bug direction - near the Dnipropetrovsk region's Novokyivka, Dobra Nadiia, Illinka, Marhanets, Nikopol and Musiivka, with artillery systems.\n\nRussian invaders continue looting across Ukrainian settlements they are retreating from. In the Kherson region, the enemy makes attempts to damage power transmission lines, transport and critical infrastructure as much as possible.\n\nAdditionally, Russian troops are forcibly relocating residents within the temporarily occupied areas of the Kherson region. In the village of Zelenivka, the enemy is preventing any movement of local residents and setting up defense frontiers. In Tiahynka and Kozatske, Russian invaders planted mines on roads and infrastructure elements. Civilians were reported blown up.\n\nOver the past day, Ukrainian air forces have launched 10 strikes on enemy positions. Seven Russian personnel, ammunition and military equipment clusters were struck, as well as three air defense system positions.\n\nOn November 10, 2022, Ukraine's Defense Forces shot down one Russian Ka-52 helicopter. Ukrainian missile and artillery units struck two enemy command posts, 10 personnel, ammunition and military equipment clusters, three ammunition depots, five air defense systems, and two more important military targets.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_10/thumb_files/630_360_1667121417-169.jpg", "eventUri": "eng-8169941", "sentiment": -0.3568627450980392, "wgt": 147, "relevance": 1, "stanza_neg": 4, "stanza_neu": 22, "stanza_pos": 1, "swn_neg": 27, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258708199", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "17:58:00", "dateTime": "2022-11-10T17:58:00Z", "dateTimePub": "2022-11-10T16:24:00Z", "dataType": "news", "sim": 0.5647059082984924, "url": "https://www.pravda.com.ua/eng/news/2022/11/10/7375818/", "title": "Russian forces reinforce positions in Zaporizhzhia Oblast and on Dnipro's left bank in Kherson Oblast - General Staff report", "body": "Russian forces are attempting to advance on three fronts - Bakhmut, Avdiivka and Novopavlivka - and are reinforcing their positions on the occupied territory of Zaporizhzhia Oblast and on the left (eastern) bank of the River Dnipro in Kherson Oblast, to the east of the city of Kherson.\n\nSource: General Staff of the Armed Forces of Ukraine on Facebook, information as of 18:00 on 10 November\n\nQuote: \"Commander-in-Chief of the Armed Forces of Ukraine has said that over the course of the past 24 hours, units of Ukraine's defence forces have advanced by 7 kilometres and regained control over six villages on the Petropavlivka-Novoraisk axis. This is similar to what happened on the Pervomaiske-Kherson axis, where our troops have also regained control over six villages.\n\nEnemy forces are attempting to maintain control over the temporarily occupied territories; they are focusing their efforts on holding back [Ukraine's] defence forces on several fronts; and they are reinforcing defence lines on the left bank of the Dnipro River.\n\nAt the same time, [Russian forces] are conducting an offensive on the Bakhmut, Avdiivka and Novopavlivka fronts [...]\n\nIn order to prevent units of [Ukraine's] defence forces from advancing, occupation forces are reinforcing their positions on the temporarily occupied territory of Zaporizhzhia Oblast. They are trying to enlist the help of local residents in order to speed up the pace with which military engineering tasks are being carried out.\"\n\nDetails: Over the course of Thursday, 10 November, cities, towns and villages in Luhansk, Donetsk, Dnipropetrovsk and Zaporizhzhia oblasts came under Russian fire.\n\nWe have launched English Twitter! Follow us!\n\nThere were no significant changes on the Volyn and Polissia fronts. The Republic of Belarus and Russia are continuing to form a joint military force.\n\nOn other fronts, the Russians continued to fire on military and civilian targets:\n\nOver the past 24 hours, Ukrainian aircraft carried out 8 strikes on Russian forces, hitting 7 clusters of military personnel, weapons and equipment and 1 anti-aircraft defence system.\n\nUkraine's Rocket Forces and Artillery struck 1 Russian command post, 8 clusters of Russian military personnel, weapons and equipment, 2 ammunition storage points, 5 anti-aircraft defence systems and several other critical military targets.\n\nToday is the 260th day of Ukraine's fight against Russia's full-scale invasion.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/7/3/7375818_fb_image_eng_2022_11_10_19_44_17.png", "eventUri": "eng-8169941", "sentiment": -0.003921568627450966, "wgt": 144, "relevance": 1, "stanza_neg": 3, "stanza_neu": 15, "stanza_pos": 0, "swn_neg": 18, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7259859754", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "13:38:00", "dateTime": "2022-11-11T13:38:00Z", "dateTimePub": "2022-11-11T12:12:00Z", "dataType": "news", "sim": 0.5607843399047852, "url": "https://en.interfax.com.ua/news/general/871449.html", "title": "AFU repels enemy attacks in 14 settlements, 33 strikes inflicted on enemy positions - General Staff", "body": "Over the past day, the Ukrainian servicemen repelled an attack by Russian invaders in the region of 14 settlements of Donbas. Aviation, missile and artillery troops of the Armed Forces of Ukraine delivered 33 strikes on enemy positions and targets, the General Staff said.\n\nAviation of the Defense Forces inflicted ten strikes on the enemy over the past day. Seven areas of concentration of personnel, weapons and military equipment, as well as three positions of enemy anti-aircraft missile systems were hit.\n\nOver the past day, the Defense Forces shot down an enemy Ka-52 helicopter. Warriors of missile troops and artillery hit two command posts, ten areas of concentration of manpower, weapons and military equipment, three ammunition depots, five air defense systems and two other important military facilities of the Russian invaders.\n\nThe General Staff said the Defense Forces continue to liberate Ukrainian lands. During the successful offensive operations of our troops in the Kherson direction, on November 9, 2022, some 12 settlements were liberated.", "source": {"uri": "en.interfax.com.ua", "dataType": "news", "title": "Interfax-Ukraine"}, "authors": [], "image": "https://interfax.com.ua/media/thumbs/images/2022/04/OXi2G8srBk7X.jpg", "eventUri": "eng-8169941", "sentiment": -0.3490196078431372, "wgt": 143, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7260017125", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "15:51:00", "dateTime": "2022-11-11T15:51:00Z", "dateTimePub": "2022-11-11T15:50:00Z", "dataType": "news", "sim": 0.5607843399047852, "url": "https://censor.net/en/video_news/3379947/general_staff_of_armed_forces_of_ukraine_appealed_to_military_of_russian_federation_and_belarus_in_case", "title": "General Staff of Armed Forces of Ukraine appealed to military of Russian Federation and Belarus: In case of order to invade - surrender. VIDEO", "body": "The Armed Forces of Ukraine appealed to the servicemen of the joint group of troops of the Republic of Belarus and the Russian Federation\n\nThis is reported by Censor.NET with reference to the press service of the General Staff of the Armed Forces of Ukraine.\n\n\"Military personnel of the Republic of Belarus, if you are forced to take part in Putin's war against the people of Ukraine, and if you cannot help but carry out this criminal order by crossing the state border of Ukraine, stop as part of a unit. Shut down your engines, spread your weapons, raise your white flags and wait for the meeting with the representatives of the command of the Armed Forces,\" the appeal states.\n\nThe General Staff of the Armed Forces of Ukraine emphasized that the refusal to kill Ukrainians will be regarded as an act of friendly and neighborly relations.\n\n\"We will be grateful for this. In this case, we guarantee you the possibility of an immediate, free return to the territory of the Republic of Belarus. If you are afraid of persecution by the current Belarusian authorities, we will offer you a dignified stay on the territory of Ukraine in specially equipped military towns. We will provide you with the necessary household conditions, food and medical care in accordance with the norms of the Armed Forces of Ukraine,\" the command noted.\n\nAlso, Belarusians who refuse to fight against Ukraine will be given the opportunity to call their relatives, as well as 24-hour access to the Internet.\n\nThe General Staff also appealed to representatives of the Russian occupation forces.\n\n\"If you decide to become part of the Russian army of occupation, you have only two options:\n\n- surrender. In this case, we guarantee you compliance with all international conventions regarding prisoners of war. ...\n\n- otherwise, inevitable death awaits you,\" the Armed Forces added.", "source": {"uri": "censor.net", "dataType": "news", "title": "Цензор.НЕТ"}, "authors": [], "image": "https://storage1b.censor.net/images/4/3/c/a/43ca2418d4d17a813fc26c938fbd9ee2/censor_social.jpg", "eventUri": "eng-8169941", "sentiment": 0.04313725490196085, "wgt": 143, "relevance": 1, "stanza_neg": 1, "stanza_neu": 14, "stanza_pos": 2, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258280431", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "12:03:00", "dateTime": "2022-11-10T12:03:00Z", "dateTimePub": "2022-11-10T12:03:00Z", "dataType": "news", "sim": 0.5490196347236633, "url": "https://en.interfax.com.ua/news/general/871185.html", "title": "Belarus conducts activities to prepare, receive Russian mobilized - AFU General Staff", "body": "Belarus' law enforcement agencies and local self-government bodies are taking measures to prepare and receive the Russian military contingent from among those mobilized on the Russian territory, Deputy Chief of the Main Operational Directorate of the General Staff of the Armed Forces of Ukraine (AFU), Brigadier General Oleksiy Hromov said.\n\n\"On the territory of the Republic of Belarus, measures are being taken to deploy a regional grouping of troops of the so-called union state, which can operate in Volyn and Polissia operational areas. The relevant law enforcement agencies and local governments of the Republic of Belarus are taking measures to prepare and receive the Russian military contingent from among those mobilized on the Russian territory persons,\" Hromov said at a briefing at the Military Media Center on Thursday.\n\nAccording to him, at this time, the clarification of places for the deployment of personnel continues.\n\nHromov said that, despite the Kremlin's public statements, covert mobilization activities continue in the aggressor country.\n\n\"In some regions of Russia, employees of military commissariats hand out summonses to men, offering to come to the commissariat to clarify personal data. Enterprises are required to form a mobilization reserve,\" he said.\n\nDeputy Minister of Defense of Ukraine Hanna Maliar, in turn, said that as of the first ten days of November, more than 270,000 people out of 300,000 planned were called up in Russia.", "source": {"uri": "en.interfax.com.ua", "dataType": "news", "title": "Interfax-Ukraine"}, "authors": [], "image": "https://interfax.com.ua/media/thumbs/images/2022/11/VaHQaeq_b02b.jpg", "eventUri": "eng-8169941", "sentiment": 0.05098039215686279, "wgt": 140, "relevance": 1, "stanza_neg": 1, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7258769472", "lang": "eng", "isDuplicate": false, "date": "2022-11-10", "time": "18:59:00", "dateTime": "2022-11-10T18:59:00Z", "dateTimePub": "2022-11-10T17:59:00Z", "dataType": "news", "sim": 0.529411792755127, "url": "https://www.pravda.com.ua/eng/news/2022/11/10/7375830/", "title": "In Donetsk Oblast, Russian invaders are looking for replenishment on Kherson front - General Staff of Armed Forces of Ukraine", "body": "The General Staff of the Armed Forces of Ukraine has information that in Donetsk Oblast, Russians are looking for replenishment for the fighting on the Kherson front, and new conscripts will soon arrive from Smolensk, Russia.\n\nSource: evening report by the General Staff of the Armed Forces of Ukraine on 10 November\n\nQuote by the General Staff: \"Search and detention of servicemen who retreated from the Kharkiv front are being conducted, in the temporarily occupied territory of Donetsk Oblast, to replenish the current losses and strengthen the group of invaders on the Kherson front.\n\nAs a special feature, it is noted that groups of invaders are sent without warm clothes, equipment, protective equipment and weapons; these are promised to be handed over directly in the area of combat operations.\"\n\nDetails: In addition, training of conscripts in military educational institutions on the territory of the Russian Federation is underway.\n\nSo, according to the information available to the General Staff of the Armed Forces of Ukraine, the next batch of this category of people is expected to be sent from Smolensk in the second decade of November.\n\nThis group was trained at the Military Academy of Air Defence of the Armed Forces of the Russian Federation.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/f/9/f9e0670-mobilization-russia-getty2.jpg", "eventUri": "eng-8169941", "sentiment": -0.1450980392156863, "wgt": 135, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7260332230", "lang": "eng", "isDuplicate": false, "date": "2022-11-11", "time": "21:19:00", "dateTime": "2022-11-11T21:19:00Z", "dateTimePub": "2022-11-11T21:18:00Z", "dataType": "news", "sim": 0.5058823823928833, "url": "https://www.pravda.com.ua/eng/news/2022/11/11/7375982/", "title": "Ukraine hits Russian command post near Enerhodar, losses among occupiers - General Staff", "body": "Ukrainian defenders have hit a Russian command post near the occupied city of Enerhodar in Zaporizhzhia Oblast, as well as the occupation headquarters in the village of Chervonyi Maiak in Kherson Oblast. The Russians have suffered losses.\n\nSource: General Staff of the Armed Forces of Ukraine, information as of 18:00, Friday, 11 November\n\nQuote: \"As per clarified information, destruction of the enemy's Mi-8 helicopter near the settlement of Dniprovka in Zaporizhzhia Oblast has been confirmed.\n\nThe enemy's command post near the city of Enerhodar was damaged; more than 50 occupiers were killed and more than 40 were injured. Additionally, a Ka-52 helicopter was destroyed.\n\nAs a result of precise strikes by the defence forces on the headquarters of the Russian occupation forces in the settlement of Chervonyi Maiak in Kherson Oblast, more than 30 occupiers died, 2 tanks and 4 lorries were destroyed.\"\n\nDetails: Moreover, Ukrainian aircraft carried out five strikes on clusters of occupation manpower, weapons, and military equipment today.\n\nSoldiers of Ukraine's Rocket Forces and Artillery hit a command post, two clusters of manpower, weapons, and military equipment, two ammunition storage points, and three other crucial Russian military facilities today.\n\nWe have launched English Twitter! Follow us!\n\nIn turn, the Russian Federation carried out 3 missile strikes and 9 air strikes, and fired from multiple-launch rocket systems more than 10 times.\n\nSettlements in Kharkiv, Donetsk, Vinnytsia, Kherson, and Mykolaiv oblasts came under occupation fire.\n\nThere are no significant changes on the Volyn and Polissia fronts.\n\nThe Russian Federation opened fire on other fronts:\n\nThis is the 261st day of Ukraine opposing the Russian full-scale invasion.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/4/d/4da8197-tank-jide--genshtab-.jpg", "eventUri": "eng-8169941", "sentiment": -0.388235294117647, "wgt": 129, "relevance": 1, "stanza_neg": 6, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]