[{"uri": "7093780529", "lang": "eng", "isDuplicate": false, "date": "2022-06-27", "time": "16:36:00", "dateTime": "2022-06-27T16:36:00Z", "dateTimePub": "2022-06-27T16:24:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.rt.com/russia/557922-zelensky-no-talks-russia/", "title": "Zelensky refuses to negotiate - French media  --  RT Russia & Former Soviet Union", "body": "Ukraine's President Volodymyr Zelensky has said his country was not prepared to hold peace talks with Russia, a source in the French government told AFP. He reportedly made the position clear when speaking to leaders of the G7 on Monday.\n\n\"President Zelensky gave a very clear response that now is not the time for negotiations. Ukraine will negotiate when it is in a position to do so, that is, when it has basically re-established a position of strength,\" a French official cited by AFP said.\n\n\"In the meantime, he needs to end the war as quickly as possible,\" the official added.\n\nThe Ukrainian president has repeatedly rejected calls to negotiate with Russia, claiming that the time for diplomacy will only come after Russian troops are pushed out of Ukraine entirely.\n\nHe stuck to that uncompromising position even as Ukrainian troops suffered several defeats on the battlefield in Donbass. Ukraine has lost roughly a quarter of its territory in the east and south since late February when Russia launched its offensive.\n\nIn March, an attempt to negotiate a peaceful solution was made with Turkey's mediation. Moscow says Kiev offered several concessions on Ukraine's future neutral status and that the Kremlin penned a formal document based on those suggestions, but Kiev has ignored it.\n\nMoscow said Ukraine was emboldened by the supplies of heavier Western arms and encouragement from politicians like UK Prime Minister Boris Johnson, who told it to fight on. This won't change the course of the Russian campaign in Ukraine, Moscow stated, so the delays only prolong the conflict and cause unnecessary casualties and damage for the parties involved.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b9b72c2030271d497d9262.jpg", "eventUri": "eng-7821909", "sentiment": -0.1058823529411764, "wgt": 188, "relevance": 1, "stanza_neg": 8, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7094563847", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "08:59:00", "dateTime": "2022-06-28T08:59:00Z", "dateTimePub": "2022-06-28T08:47:00Z", "dataType": "news", "sim": 0.7372549176216125, "url": "https://www.rt.com/news/557955-ukraine-redefine-victory-biden/", "title": "US presidential advisers debate Ukraine's chances of success - CNN  --  RT World News", "body": "Some people in the Biden administration are skeptical about Kiev's ability to turn the tide of war against Russia and mount an effective counteroffensive to retake the territories lost in the past four months, CNN reported on Tuesday. They believe Ukrainian President Volodymyr Zelensky should moderate his expectations and redefine what he would consider victory against Russia, the news outlet said.\n\nOthers in the US government remain hopeful that Kiev can defy the odds, if provided enough Western weapons.\n\n\"Whether Ukraine can take back these territories is in large part, if not entirely, a function of how much support we give them,\" a US congressional aide was cited as saying.\n\nThe skeptics are concerned that even with Western military aid, Kiev will not be able to effectively take on Russia on the battlefield, the report said. Ukraine has suffered heavy losses both in manpower and weapons, as its forces have been repelled from key areas in the east in recent weeks.\n\nThe more advanced arms that Kiev's backers can provide are NATO-standard and not familiar to Ukrainian troops, who need time to train and learn how to use them. Meanwhile, the stockpile of Soviet-era weapons that nations in Eastern Europe possess has been dwindling.\n\nZelensky pledged to continue fighting until Russian troops are pushed back to where they were before the offensive started in late February. Kiev expected the Western support to give it a stronger position to eventually negotiate a peace settlement, and Washington believed it would ensure a strategic defeat for Russia.\n\nCNN's sources say the Biden administration did not intend to put pressure on Kiev to adjust its policies, mirroring public statements by US officials. Even if the advice of the skeptics is heeded, Zelensky is not expected to formally relinquish Ukrainian claims on lost territory, the report said.\n\nRussia attacked the neighboring state following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62babf2a85f54063a32e3e12.jpg", "eventUri": "eng-7821909", "sentiment": -0.08235294117647063, "wgt": 188, "relevance": 1, "stanza_neg": 8, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7092484952", "lang": "eng", "isDuplicate": false, "date": "2022-06-26", "time": "14:45:00", "dateTime": "2022-06-26T14:45:00Z", "dateTimePub": "2022-06-26T14:41:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.rt.com/russia/557859-kiev-buildings-shelled-civilians/", "title": "Civilians hurt by Russian shelling of Kiev - Ukraine  --  RT Russia & Former Soviet Union", "body": "Ukrainian officials have claimed that Russia shelled a residential building and a kindergarten in Kiev on Sunday.\n\nA Russian missile hit an apartment complex in western Kiev, Mayor Vitaly Klitschko wrote on his Telegram channel on Sunday. He said one person died and four people were hospitalized, including a seven-year-old girl. The mayor added that 24 residents were evacuated.\n\nEmergency services said a nine-story building was shelled by \"the enemy,\" and that \"a Russian bomb\" left a large crater on the grounds of a kindergarten. Officials said that there were no children in the kindergarten at the time.\n\nYury Ignat, a spokesperson for the Ukrainian Air Force, said that Russian aircraft launched up to six missiles at Kiev on Sunday, two of which were intercepted mid-air.\n\nThe Russian Defense Ministry did not report any airstrikes on Kiev in its daily press briefing. Moscow previously said that it only hits military targets, such as artillery pieces and weapons depots.\n\nIn late April, Russian missiles hit the Artem missile development and production plant, located in the same Shevchenko district of Kiev.\n\nDonbass officials have accused Kiev of shelling Donetsk and other cities since the start of Russia's military campaign in Ukraine, which was launched in late February. The Donetsk People's Republic said this week that 188 civilians have been killed in DPR over the last four months.\n\nUkraine also claims that it only strikes military targets.\n\nRussia attacked the neighboring state following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b861a420302730275505c3.jpg", "eventUri": "eng-7821909", "sentiment": -0.1764705882352942, "wgt": 184, "relevance": 1, "stanza_neg": 7, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096908088", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "00:23:00", "dateTime": "2022-06-30T00:23:00Z", "dateTimePub": "2022-06-30T00:22:00Z", "dataType": "news", "sim": 0.7058823704719543, "url": "https://www.northernirelandnews.com/news/272604946/ukraine-planning-series-of-provocations-russia", "title": "Ukraine planning series of provocations Russia", "body": "Kiev wants to trigger Russian strikes on civilians and stage a fake chemical weapon attack, Moscow claims\n\nThe Ukrainian government is setting the stage for a number of provocations that would falsely implicate Russia in war crimes and atrocities, including a chemical weapon attack, the Russian military claimed on Tuesday.\n\nAmong other things, Kiev plans to launch rocket artillery strikes from the city of Krivoy Rog in the Dnepropetrovsk Region, according to a statement by Colonel General Mikhail Mizintsev. Ukrainian nationalists would fire from a location in a residential area at a hospital in a Russia-controlled community, he claimed.\n\n\"The Ukrainian neo-Nazis want to trigger return fire and then accuse the Russian armed forces of indiscriminate attacks against civilian infrastructure and Ukrainian non-combatants,\" Mizintsev said.\n\nIn a separate case, the Security Service of Ukraine (SBU) has been in contact with health officials in Odessa Region to \"work out issues with reception and treatment of people injured by toxic chemicals,\" the official added. The Russian military believes this to be an indicator that Kiev wants to stage a fake chemical weapon attack and blame it on Russia.\n\nMizintsev is the head of the National Defense Control Center of Russia, and also supervises the Russian military's humanitarian mission for the Ukraine operation. In his statement, he addressed Western nations and international organizations such as the UN and the International Committee of the Red Cross, warning that Kiev is preparing \"these and other similar provocations\" against Russia, using the supportive media to make the claims seem credible.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "northernirelandnews.com", "dataType": "news", "title": "Northern Ireland News"}, "authors": [], "image": "https://cdn.bignewsnetwork.com/rtc1656533615.jpg", "eventUri": "eng-7821909", "sentiment": -0.3960784313725491, "wgt": 180, "relevance": 1, "stanza_neg": 4, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7094973821", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "14:23:00", "dateTime": "2022-06-28T14:23:00Z", "dateTimePub": "2022-06-28T14:20:00Z", "dataType": "news", "sim": 0.7058823704719543, "url": "https://www.rt.com/news/557998-russia-ukraine-conflict-end-conditions/", "title": "Moscow gives recipe for fast tracking to Ukraine conflict end  --  RT World News", "body": "Ukraine could stop everything by the end of the day if it fulfills Russia's demands, Kremlin spokesperson says\n\nIf Kiev orders its troops to lay down their arms and fulfills Moscow's demands, the entire Russian-Ukrainian conflict could be over by the end of the day, Kremlin spokesperson Dmitry Peskov told reporters during a conference call on Tuesday.\n\n\"The Ukrainian side can stop everything before the end of today. There has to be an order for the nationalist battalions and Ukrainian soldiers to lay down their arms. Russia's demands must also be met,\" Peskov said, commenting on Ukrainian President Volodymyr Zelensky's recent claim that the conflict must end before the winter.\n\nPeskov noted that \"everything else is just Zelensky's thoughts,\" adding that Russia's special operation in Ukraine was going as planned and achieving its goals.\n\nReuters reported on Monday that Zelensky, speaking to the leaders of the G7 via a video link, insisted that the conflict between Moscow and Kiev had to be resolved by the end of the year before harsh winter conditions made it harder for Ukrainian troops to fight against Russian forces. According to the outlet, he urged the G7 nations to provide Ukraine with more weapons and pass tougher sanctions on Moscow.\n\nAccording to a French official cited by AFP, during the same address, Zelensky also stated that Ukraine had no intention of holding talks with Russia until it obtained a more favorable position and took back the territories it lost after Moscow launched its offensive in late February.\n\nThe last round of talks between Moscow and Kiev was held in March in Turkey, when the two sides attempted to negotiate a peaceful solution to the conflict. Since then, however, the talks have completely stalled, as the Ukrainian side has insisted it would only come back to the table when it was in a \"stronger negotiating position.\"\n\nUkraine's top negotiator David Arakhamia suggested last week that Kiev believes it could achieve this \"favorable position\" by late August after it conducts \"counteroffensive operations in certain areas.\"\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered Minsk Protocol was designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bb0c892030270a5057b1b3.jpg", "eventUri": "eng-7821909", "sentiment": -0.1843137254901961, "wgt": 180, "relevance": 1, "stanza_neg": 4, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096022546", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "09:57:00", "dateTime": "2022-06-29T09:57:00Z", "dateTimePub": "2022-06-29T09:55:00Z", "dataType": "news", "sim": 0.6901960968971252, "url": "https://www.rt.com/russia/558047-nato-tells-ukraine-fight/", "title": "NATO tells Ukraine to fight on  --  RT Russia & Former Soviet Union", "body": "Fighting against Russia with Western help is the only way forward for Ukraine, NATO members told President Volodymyr Zelensky, the Belgian prime minister said on Wednesday.\n\n\"We make it very clear that this war can only be won on the battlefield and we should continue to support President Zelensky and the Ukrainian population as much as possible to be able to win the war on the battlefield,\" Belgian Prime Minister Alexander De Croo told journalists on the sidelines of the NATO summit in Madrid.\n\nHe said he had the chance to personally interact with and encourage Zelensky and pointed out that his country was among the first to offer military support to Kiev and will continue sending arms to Kiev, he assured.\n\n\"NATO support in the broad sense has been there from the start, and will continue to be there,\" he added.\n\nNATO nations have been training Ukrainian troops since the 2014 armed coup in Kiev. When Russia launched its offensive against Ukraine more than four months ago, it cited the military bloc's eastward expansion as a key reason. Moscow perceives NATO as a hostile organization and a threat to its national security.\n\nThe Belgian prime minister also said that Ukraine was given a strong gesture of support by the EU, when it was offered candidate status last week. He said Brussels also sent \"a very important message\" about EU enlargement to Moldova, which became a candidate too.\n\n\"Some people will say: 'Well, it's symbolic'. But symbolic messages are extremely important today,\" De Croo said, referring to the fact that EU nations expect neither Ukraine nor Moldova to join them as fully-fledged members anytime soon.\n\nThe Belgian PM praised the ongoing NATO summit as a success, due to Turkey lifting its objections to Sweden and Finland joining the alliance, which was announced on Tuesday.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bc080d85f5406a8f035a57.jpg", "eventUri": "eng-7821909", "sentiment": 0.1764705882352942, "wgt": 176, "relevance": 1, "stanza_neg": 2, "stanza_neu": 14, "stanza_pos": 1, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096662591", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "18:48:00", "dateTime": "2022-06-29T18:48:00Z", "dateTimePub": "2022-06-29T18:47:00Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.daily-sun.com/printversion/details/629309/NATO-tells-Ukraine-to-fight-on", "title": "NATO tells Ukraine to fight on | Daily Sun |", "body": "MADRID: The Belgian Prime Minister said on Wednesday that NATO members told President Volodymyr Zelensky fighting against Russia with Western help is the only way forward for Ukraine, reports RT.com.\n\n\"We make it very clear that this war can only be won on the battlefield and we should continue to support President Zelensky and the Ukrainian population as much as possible to be able to win the war on the battlefield,\" Belgian Prime Minister Alexander De Croo told journalists on the sidelines of the NATO summit in Madrid.\n\n\"NATO support in the broad sense has been there from the start, and will continue to be there,\" he added.\n\nNATO nations have been training Ukrainian troops since the 2014 armed coup in Kiev. When Russia launched its offensive against Ukraine more than four months ago, it cited the military bloc's eastward expansion as a key reason. Moscow perceives NATO as a hostile organisation and a threat to its national security.\n\nThe Belgian prime minister also said that Ukraine was given a strong gesture of support by the EU, when it was offered candidate status last week.\n\nHe said Brussels also sent \"a very important message\" about EU enlargement to Moldova, which became a candidate too.\n\n\"Some people will say: 'Well, it's symbolic'. But symbolic messages are extremely important today,\" De Croo said, referring to the fact that EU nations expect neither Ukraine nor Moldova to join them as fully-fledged members anytime soon.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state.\n\nThe protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "daily-sun.com", "dataType": "news", "title": "Daily Sun"}, "authors": [{"uri": "daily_sun@daily-sun.com", "name": "Daily Sun", "type": "author", "isAgency": false}], "image": "https://www.daily-sun.com/assets/importent_images/common-pic-large.png", "eventUri": "eng-7821909", "sentiment": 0.0980392156862746, "wgt": 170, "relevance": 1, "stanza_neg": 2, "stanza_neu": 12, "stanza_pos": 1, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7097629353", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "12:35:00", "dateTime": "2022-06-30T12:35:00Z", "dateTimePub": "2022-06-30T12:00:00Z", "dataType": "news", "sim": 0.6627451181411743, "url": "https://sana.sy/en/?p=276685", "title": "US intelligence sets out possible scenarios for Ukraine", "body": "Mikdad: Syria has succeeded in defending just causes of Syria and the Arab nation\n\nA protracted military conflict is the most likely of three possible scenarios, according to intelligence chief Avril Haines\n\nWashington, SANA-\n\nHostilities in Ukraine will most likely continue for the foreseeable future unless Ukrainian forces collapse and Russia achieves its goals, a US intelligence assessment said on Wednesday. A peaceful resolution is currently impossible, American officials believe.\n\nThe gloomy prediction was made by Director of National Intelligence Avril Haines during a discussion in Washington hosted by tech giant Google. In her first public remarks on Ukraine since May, she said US intelligence had considered three possible scenarios for the conflict in Ukraine.\n\nThe most likely one is a grinding war in which Russia makes \"incremental gains, with no breakthrough.\" Another scenario involves Russia succeeding in crushing \"one of [Ukraine's] most capable and well-equipped forces\" in the east, leading to \"a slump in the Ukrainian resistance.\" The third possibility involves Ukraine managing to stabilize the front line, and possibly achieving minor gains in Kherson Region, which is currently dominated by Russian forces.\n\n\"We also, to be clear, don't see right now an opportunity for both sides to come to a peaceful agreement,\" she said.\n\nHaines said her agency continues to believe that Russian President Vladimir Putin wants to capture \"most of Ukraine,\" but added that the country's forces have been degraded by four months of fighting in Ukraine.\n\n\"We perceive a disconnect between Putin's near-term military objectives in this area and his military's capacity, a kind of mismatch between his ambitions and what the military is able to accomplish,\" she said.\n\nUkrainian President Volodymyr Zelensky reportedly told G7 leaders earlier this week that he wanted to wrap up hostilities with Russia before the end of the year. He called on the Western powers to ramp up supplies of weapons to his country, according to European government sources familiar with his private video-link address.\n\nUkrainian officials claim that foreign weapons are necessary for fighting Russia, but that their country would not surrender even if none were sent. Foreign Minister Dmitry Kuleba told German media this month that Ukrainian soldiers will \"fight with shovels\" if they have to.\n\nThe Russian leadership has declined to set any timetable for the Ukraine operation and has repeatedly claimed it was going as planned and would ultimately achieve all its objectives. Moscow has described its goals as ensuring security for itself and for the Donetsk and Lugansk People's Republics, which it recognized as sovereign states days before launching the offensive.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, which were designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian president Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "sana.sy", "dataType": "news", "title": "S A N A"}, "authors": [{"uri": "nisreen@sana.sy", "name": "nisreen", "type": "author", "isAgency": false}], "image": "https://sana.sy/en/wp-content/uploads/2022/06/russia-ukraine-1238751922.jpg", "eventUri": "eng-7821909", "sentiment": 0.2549019607843137, "wgt": 169, "relevance": 1, "stanza_neg": 6, "stanza_neu": 18, "stanza_pos": 1, "swn_neg": 25, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7093476165", "lang": "eng", "isDuplicate": false, "date": "2022-06-27", "time": "12:24:00", "dateTime": "2022-06-27T12:24:00Z", "dateTimePub": "2022-06-27T12:24:00Z", "dataType": "news", "sim": 0.6627451181411743, "url": "https://www.rt.com/russia/557907-kremlin-response-ukraine-missiles/", "title": "Moscow reacts to reports of new weapons for Ukraine  --  RT Russia & Former Soviet Union", "body": "Russia continues to safeguard its interests, the Kremlin has said in response to reports about Washington's plans to send new missile systems to Ukraine.\n\n\"We didn't receive any notifications on the matter. As far as actions to defend [our] interests are concerned, [we are] making them on a regular basis,\" Kremlin spokesman Dmitry Peskov told reporters on Monday.\n\nPeskov's statement came after several news agencies reported that the US was purchasing a medium-to-long range surface-to-air missile system for Ukraine.\n\nThe Associated Press said the system in question is the Norwegian-developed NASAMS - one of the weapons Ukrainian President Volodymyr Zelensky has requested in the past.\n\nThe US and other NATO countries have been increasingly supplying Kiev with heavy weapons to help it fight Russian troops. The recent deliveries include US-made M142 HIMARS multiple rocket launchers and M777 howitzers.\n\nPeskov said this month that \"flooding\" Ukraine with foreign weapons will not change the course of the conflict and will only lead to more suffering and destruction in Ukraine.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b99f1585f54006cc420aa2.jpg", "eventUri": "eng-7821909", "sentiment": -0.1137254901960785, "wgt": 169, "relevance": 1, "stanza_neg": 3, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7097582887", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "12:01:00", "dateTime": "2022-06-30T12:01:00Z", "dateTimePub": "2022-06-30T11:40:00Z", "dataType": "news", "sim": 0.6627451181411743, "url": "https://www.rt.com/russia/558140-russia-withdraws-snake-island/", "title": "Russia makes move to alleviate food crisis  --  RT Russia & Former Soviet Union", "body": "The Russian military has withdrawn from Black Sea island it had captured, claiming it was for the sake of grain freight traffic\n\nRussian troops were withdrawn from Ukraine's Snake Island on Thursday, the defense ministry announced during a daily briefing. The move was described as a goodwill gesture meant to alleviate concerns over Russia possibly blocking attempts to haul grain out of Ukraine.\n\n\"This demonstrated to the international community that the Russian Federation does not hinder the UN effort to organize a humanitarian corridor to ship agricultural products from the Ukrainian territory,\" Col. Gen. Igor Konashenkov, the spokesman for the ministry, said.\n\nKonashenkov assessed that with no Russian presence on the island, Kiev would find it more difficult to accuse Russia of exacerbating the global food crisis by citing the Russian Navy's control of the northwestern part of the Black Sea as a roadblock to the movement of grain.\n\n\"The ball is now in the court of the Ukrainian side, which would not remove mines from its Black Sea coast, including the areas near ports,\" the Russian official said.\n\nWestern nations and Ukraine have been accusing Russia of blocking seaborne exports from Kiev-controlled ports like Odessa, claiming that it was a major factor of the global hike in food prices.\n\nMoscow has denied the allegations, saying that its Navy offered safe passage to civilian ships on a daily basis. It's Ukraine, Russia said, who has prevented foreign ships from arriving and leaving its ports. Ukraine's use of old sea mines, which are prone to coming untethered during storms, created a major problem for sea traffic, Moscow argued.\n\nRussia captured Snake Island, which is located 35 kilometers off the Ukrainian shore near its border with Romania, in the early days of its attack on Ukraine. Ukrainian President Volodymyr Zelensky initially claimed that border guards defending the islet had all been killed after defying overwhelming Russian forces. It later turned out they'd actually surrendered.\n\nKiev reportedly launched at least two major attempts to retake the island from Russia. Russian troops reported inflicting serious damage on their opponents in both cases. Moscow rebuked the Ukrainian operations as senseless attempts by the Ukrainian government to score publicity points.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bd8b2f2030274d2a3a02ad.jpg", "eventUri": "eng-7821909", "sentiment": -0.1607843137254902, "wgt": 169, "relevance": 1, "stanza_neg": 6, "stanza_neu": 17, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7097296365", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "08:22:00", "dateTime": "2022-06-30T08:22:00Z", "dateTimePub": "2022-06-30T08:07:00Z", "dataType": "news", "sim": 0.6549019813537598, "url": "https://www.rt.com/viral/558121-us-intelligence-ukraine-scenarios/", "title": "US intel sets out possible scenarios for Ukraine  --  RT Viral", "body": "Hostilities in Ukraine will most likely continue for the foreseeable future unless Ukrainian forces collapse and Russia achieves its goals, a US intelligence assessment said on Wednesday. A peaceful resolution is currently impossible, American officials believe.\n\nThe gloomy prediction was made by Director of National Intelligence Avril Haines during a discussion in Washington hosted by tech giant Google. In her first public remarks on Ukraine since May, she said US intelligence had considered three possible scenarios for the conflict in Ukraine.\n\nThe most likely one is a grinding war in which Russia makes \"incremental gains, with no breakthrough.\" Another scenario involves Russia succeeding in crushing \"one of [Ukraine's] most capable and well-equipped forces\" in the east, leading to \"a slump in the Ukrainian resistance.\" The third possibility involves Ukraine managing to stabilize the front line, and possibly achieving minor gains in Kherson Region, which is currently dominated by Russian forces.\n\n\"We also, to be clear, don't see right now an opportunity for both sides to come to a peaceful agreement,\" she said.\n\nHaines said her agency continues to believe that Russian President Vladimir Putin wants to capture \"most of Ukraine,\" but added that the country's forces have been degraded by four months of fighting in Ukraine.\n\n\"We perceive a disconnect between Putin's near-term military objectives in this area and his military's capacity, a kind of mismatch between his ambitions and what the military is able to accomplish,\" she said.\n\nUkrainian President Volodymyr Zelensky reportedly told G7 leaders earlier this week that he wanted to wrap up hostilities with Russia before the end of the year. He called on the Western powers to ramp up supplies of weapons to his country, according to European government sources familiar with his private video-link address.\n\nUkrainian officials claim that foreign weapons are necessary for fighting Russia, but that their country would not surrender even if none were sent. Foreign Minister Dmitry Kuleba told German media this month that Ukrainian soldiers will \"fight with shovels\" if they have to.\n\nThe Russian leadership has declined to set any timetable for the Ukraine operation and has repeatedly claimed it was going as planned and would ultimately achieve all its objectives. Moscow has described its goals as ensuring security for itself and for the Donetsk and Lugansk People's Republics, which it recognized as sovereign states days before launching the offensive.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, which were designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian president Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bd57d885f5406a8f035ad9.jpg", "eventUri": "eng-7821909", "sentiment": 0.09019607843137245, "wgt": 167, "relevance": 1, "stanza_neg": 6, "stanza_neu": 16, "stanza_pos": 0, "swn_neg": 22, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096171385", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "11:55:00", "dateTime": "2022-06-29T11:55:00Z", "dateTimePub": "2022-06-29T11:45:00Z", "dataType": "news", "sim": 0.6509804129600525, "url": "https://www.rt.com/russia/558064-ukraine-provocations-russian-military/", "title": "Ukraine mulls series of provocations - Russia  --  RT Russia & Former Soviet Union", "body": "The Ukrainian government is setting the stage for a number of provocations that would falsely implicate Russia in war crimes and atrocities, including a chemical weapon attack, the Russian military claimed on Tuesday.\n\nAmong other things, Kiev plans to launch rocket artillery strikes from the city of Krivoy Rog in Dnepropetrovsk Region, according to a statement by Colonel General Mikhail Mizintsev. Ukrainian nationalists would fire from a location in a residential area at a hospital in a Russia-controlled community, he claimed.\n\n\"The Ukrainian neo-Nazis want to trigger return fire and then accuse the Russian armed forces of indiscriminate attacks against civilian infrastructure and Ukrainian non-combatants,\" Mizintsev said.\n\nIn a separate case, the Security Service of Ukraine (SBU) has been in contact with health officials in Odessa Region to \"work out issues with reception and treatment of people injured by toxic chemicals,\" the official added. The Russian military believes this to be an indicator that Kiev wants to stage a fake chemical weapon attack and blame it on Russia.\n\nMizintsev is the head of the National Defense Control Center of Russia, and also supervises the Russian military's humanitarian mission for the Ukraine operation. In his statement, he addressed Western nations and international organizations such as the UN and the International Committee of the Red Cross, warning that Kiev is preparing \"these and other similar provocations\" against Russia, using the supportive media to make the claims seem credible.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bc355b20302714686787cc.jpg", "eventUri": "eng-7821909", "sentiment": -0.3725490196078431, "wgt": 166, "relevance": 1, "stanza_neg": 4, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096379677", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "14:36:00", "dateTime": "2022-06-29T14:36:00Z", "dateTimePub": "2022-06-29T14:32:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://www.rt.com/russia/558071-zelensky-ukraine-nato-aid/", "title": "Zelensky demands $5 billion from NATO, cites security in Europe  --  RT Russia & Former Soviet Union", "body": "Ukrainian President Volodymyr Zelensky has urged the US-led NATO bloc to ramp up support of his country amid the ongoing conflict with Russia, claiming that Kiev's defeat would result in a \"delayed\" war between Moscow and the whole West. Zelensky made the remarks as he addressed the NATO summit in Madrid via a video link on Wednesday.\n\n\"It's either urgent aid to Ukraine sufficient for victory, or a delayed war between Russia and you,\" Zelensky told NATO leaders.\n\nThe country needs both direct military and financial aid, Zelensky stated, adding that some $5 billion a month was needed to cover its budget deficit. Top Ukrainian officials have repeatedly called upon the West to provide financial support.\n\n\"Financial aid for Ukraine has no less significance than arms deliveries,\" Zelensky said. \"We need some $5 billon every month, you know that. And this is a fundamental thing, needed for defense and protection.\"\n\nTo help Ukraine now end this war with a victory on the battlefield, that is, to give a really strong response to Russia's actions - this is what we, and the entire alliance, the whole Euro-Atlantic community need.\n\nOnce the conflict is over, Ukraine must be provided with a decent place in the Western security architecture, Zelensky insisted, rejecting the prospect of Ukraine remaining in a \"gray zone\" between Russia and the NATO bloc. \"We need security guarantees, and you must find a place for Ukraine in the common security space,\" he stressed.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bc61dd20302714686787ff.jpg", "eventUri": "eng-7821909", "sentiment": -0.1607843137254902, "wgt": 165, "relevance": 1, "stanza_neg": 4, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7092580308", "lang": "eng", "isDuplicate": false, "date": "2022-06-26", "time": "16:57:00", "dateTime": "2022-06-26T16:57:00Z", "dateTimePub": "2022-06-26T16:55:00Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://www.rt.com/russia/557866-drilling-rig-shelled-ukraine/", "title": "Russian drilling rig shelled again  --  RT Russia & Former Soviet Union", "body": "No casualties have been reported following the Ukrainian attack, Crimea's emergency services say\n\nA Russian offshore drilling rig in the Black Sea has been shelled, in the second similar attack in less than a week, a spokesperson for Crimea's emergency services told TASS on Sunday, blaming the strike on the Ukrainian military.\n\nEarlier, the Baza Telegram channel, citing its own sources, reported that a projectile which had hit the Chernomorneftegaz-owned Tavrida floating drilling rig overnight, left a hole in the platform's helipad.\n\n\"This is shelling by the Armed Forces of Ukraine, there are no casualties,\" the region's emergency services spokesman said without providing further details.\n\nOn June 20, the head of Crimea, Sergey Aksyonov, revealed that Ukraine had shelled Chernomorneftegaz drilling platforms 71km from Odessa.\n\nThree platforms were damaged, including the Tavrida. One of the platforms (BK-1) was completely destroyed. Seven people are missing, and three sustained injuries. In total, there were 109 people on the platform, with the majority of them subsequently evacuated.\n\nThe Russian Investigative Committee opened a criminal case in relation to the June 20 shelling.\n\nEarlier this month, the Ukrainian presidential representative for Crimea, Tamila Tasheva, said Kiev is now relying on military means to 'return' Crimea to Ukraine, and that Russia's military campaign prompted Kiev to largely abandon diplomacy regarding the peninsula's 'de-occupation'.\n\nUkrainian troops have been losing territory to Russia and allied forces in Donbass, even as Western nations supply more sophisticated weapons to Kiev. Several Ukrainian officials have stated that the pledge to not use foreign weapons to attack targets in Russia does not apply to Crimea, which Kiev considers part of its territory.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b88b76203027022275ead2.jpg", "eventUri": "eng-7821909", "sentiment": -0.388235294117647, "wgt": 165, "relevance": 1, "stanza_neg": 9, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7095099534", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "16:05:00", "dateTime": "2022-06-28T16:05:00Z", "dateTimePub": "2022-06-28T15:44:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.rt.com/russia/558008-macron-refuses-designate-russia/", "title": "Macron refuses to designate Russia 'sponsor of terrorism'  --  RT Russia & Former Soviet Union", "body": "French President Emmanuel Macron did not support the proposal of his Ukrainian counterpart Volodymyr Zelensky to designate Russia a \"sponsor of terrorism,\" explaining that Paris doesn't need any \"definitions\" to sanction Moscow or condemn its alleged \"war crimes.\"\n\nOn Monday, Zelensky claimed that \"the Russian state had become the largest terrorist organization in the world.\" \"And this must be a legal fact,\" the Ukrainian president wrote on Telegram.\n\nCommenting on Zelensky's statement during a press conference on Tuesday, Macron said that his country does not follow such \"methodology\" and has been consistent in its approach to Russian \"war crimes.\" Referring to the alleged murder of civilians in the city of Bucha by Russian forces (something that Moscow vehemently denies), Macron stated that \"these are war crimes.\" He stressed that Paris condemns them and supports investigations that will eventually bring those responsible for the atrocities to \"Ukrainian and international justice.\"\n\nMoreover, France does not need any judicial definitions for sanctioning Russia, Macron claimed.\n\n\"We sanction Russia and we do not need any definitions to carry out these sanctions,\" the French leader said.\n\nHe added that as \"Russia cannot and should not win\" in the conflict, France and its allies will continue to impose restrictions on Moscow and to support Ukraine, both economically and militarily, for as long as will be necessary. According to Macron, the goal is to ensure that Kiev can negotiate with Russia \"on its terms and at the moment it chooses.\"\n\nMacron has consistently refused to use judicial terms for describing the situation in Ukraine. In April, he said that he would not use the word 'genocide' to describe Russia's conduct in Ukraine, explaining that \"the word 'genocide' must be qualified by jurists, not by politicians.\"\n\nZelensky, meanwhile, claimed that everyone in the world should know that \"buying or transporting Russian oil, maintaining contacts with Russian banks, paying taxes and customs duties to the Russian state means giving money to terrorists.\"\n\nSince the launch of the Russian military offensive in Ukraine, Moscow and Kiev have been accusing each other of targeting civilians and committing other war crimes. On Monday, Ukraine claimed Russia attacked a shopping center in the city of Kremenchug, killing and injuring many civilians. The Russian military responded that it had targeted a stockpile of Western weapons but that the detonation of the munitions caused damage to a nearby shopping mall, which, according to Moscow, was non-functioning.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bb1bd12030270b5c0300e6.jpg", "eventUri": "eng-7821909", "sentiment": -0.3333333333333334, "wgt": 163, "relevance": 1, "stanza_neg": 7, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 20, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7096074025", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "10:37:00", "dateTime": "2022-06-29T10:37:00Z", "dateTimePub": "2022-06-29T10:05:00Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.rt.com/news/558057-scholz-laughs-ukraine-security/", "title": "Scholz laughs when asked about Ukraine  --  RT World News", "body": "The German chancellor laughed off a question about security guarantees that members of the G7 reportedly plan to extend to Ukraine once its military conflict with Russia is over. Olaf Scholz said he could elaborate on them but declined to do so.\n\nThe brief exchange happened on Tuesday during a press conference that the German chancellor gave, after wrapping up a G7 summit that he hosted. A journalist mentioned a future security arrangement for Kiev and asked if the German leader could describe it in more detail.\n\n\"Yes,\" Scholz said after a short burst of suppressed laughter. A dramatic pause lingered as the press waited for him to continue. \"That's all,\" he said, making it clear that he didn't plan to share anything with the public.\n\nThe final statement of the G7 summit expressed the resolve of leading Western nations to offer \"sustained security commitments to help Ukraine defend itself and to secure its free and democratic future.\"\n\nThe document was released on Tuesday after Ukrainian President Volodymyr Zelensky spoke to the G7 leaders via video link. He reiterated Kiev's calls to impose more sanctions against Russia. According to European government sources, Zelensky asked for more air defense systems and said he wanted the hostilities with Russia to end with his nation's victory before the year's end.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bc22ea85f54033aa53873d.jpg", "eventUri": "eng-7821909", "sentiment": 0.223529411764706, "wgt": 163, "relevance": 1, "stanza_neg": 4, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7093401278", "lang": "eng", "isDuplicate": false, "date": "2022-06-27", "time": "11:25:00", "dateTime": "2022-06-27T11:25:00Z", "dateTimePub": "2022-06-27T11:20:00Z", "dataType": "news", "sim": 0.6313725709915161, "url": "https://www.rt.com/russia/557901-ukraine-russia-nuclear-cooperation/", "title": "Ukraine pulls plug on nuclear cooperation with Russia  --  RT Russia & Former Soviet Union", "body": "Ukraine's nuclear regulator announced that its head ordered it to stop working with Russia due to the hostilities between the two nations.\n\nA short statement published on Monday by the State Nuclear Regulatory Inspectorate of Ukraine said that last week, acting Chief Inspector\n\nOleg Korikov ordered that two agreements with Moscow on nuclear regulation be nullified. Signed in 1996 and 2002, they set the legal framework for the agency's cooperation and information sharing with its Russian counterpart, Rostekhnadzor.\n\nThe Ukrainian agency cited \"Russian aggression\" against the country as the reason for pulling the plug on the agreements. It said it notified the Ukrainian Foreign Ministry about the decision.\n\nUkraine's civilian nuclear industry was built when the country was part of the USSR, and for decades it relied on Russian expertise to keep it running. The Russian producer of nuclear fuel rods, TVEL, has long been the primary supplier of fuel for the nation's power plants.\n\nThe 2014 crisis dealt a serious blow to the cooperation between the two countries, with Kiev declaring that it would use Western fuel instead. However, attempts by America's Westinghouse Electric Company to create replacement products for Soviet-built plants in Eastern Europe only met with limited success. Ukraine also needs the domestic infrastructure to store nuclear waste, a problem which Russia typically deals with for its clients.\n\nAs late as 2018, officials in Kiev said they wanted TVEL to open a subsidiary manufacturer in Ukraine, despite the souring relations between the two nations at the time.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b991a72030271fd83eb61c.jpg", "eventUri": "eng-7821909", "sentiment": -0.05882352941176472, "wgt": 161, "relevance": 1, "stanza_neg": 3, "stanza_neu": 13, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7093726318", "lang": "eng", "isDuplicate": false, "date": "2022-06-27", "time": "15:49:00", "dateTime": "2022-06-27T15:49:00Z", "dateTimePub": "2022-06-27T15:46:00Z", "dataType": "news", "sim": 0.6274510025978088, "url": "https://www.rt.com/russia/557932-russia-claims-eliminate-mercenaries/", "title": "Russia claims to eliminate mercenaries involved in murdering POWs  --  RT Russia & Former Soviet Union", "body": "A group of fighters from the Georgian Legion have been eliminated in the LPR, the Russian Defense Ministry has revealed\n\nRussian forces eliminated a group of Georgian mercenaries, who were fighting on the Ukrainian side and were allegedly involved in the abuse and murders of the Russian prisoners, Russian military spokesman Lieutenant General Igor Konashenkov said on Monday.\n\nAccording to Konashenkov, on June 26, three kilometers from the Lisichansk oil refinery in the Lugansk People's Republic, Russian units \"destroyed two sabotage and reconnaissance groups of mercenaries with a total number of 14 militants.\"\n\nThe first group, according to the spokesman, \"consisted of citizens of various European countries,\" while the second one listed only mercenaries from the so-called Georgian Legion. According to Konashenkov, \"Georgian militants were involved in the brutal torture and murder of Russian servicemen near Kiev in March this year.\"\n\nSince the launch of the Russian military offensive in Ukraine at the end of February, Moscow and Kiev have been accusing each other of abuse and torture, as well as of atrocities against civilians. In May, the Russian Investigative Committee said it was looking into a video published on social media, showing a Georgian mercenary beating a captured Russian soldier.\n\nTatyana Moskalkova, Russia's top human rights official, voiced concerns this month over the treatment of Russian prisoners in Ukraine. The International Red Cross had not provided any information about visits to check on the conditions the Russian POWs have been kept in, she claimed.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered Minsk Protocol was designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62b9d07b85f540607d6bc703.jpg", "eventUri": "eng-7821909", "sentiment": -0.5372549019607843, "wgt": 160, "relevance": 1, "stanza_neg": 7, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7095348070", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "20:14:00", "dateTime": "2022-06-28T20:14:00Z", "dateTimePub": "2022-06-28T19:56:00Z", "dataType": "news", "sim": 0.6235294342041016, "url": "https://www.sott.net/article/469223-Russia-says-mercenaries-involved-in-murdering-POWs-has-been-eliminated", "title": "Russia says mercenaries involved in murdering POWs has been 'eliminated' -- Sott.net", "body": "A group of fighters from the Georgian Legion have been eliminated in the LPR, the Russian Defense Ministry has revealed\n\nRussian forces have eliminated a group of Georgian mercenaries, fighting on the Ukrainian side, who were allegedly involved in the abuse and murder of prisoners, the spokesman for the Defense Ministry in Moscow, Lieutenant General Igor Konashenkov, said on Monday.\n\nAccording to Konashenkov, on June 26, three kilometers from the Lisichansk oil refinery in the Lugansk People's Republic, Russian units \"destroyed two sabotage and reconnaissance groups of mercenaries with a total number of 14 militants.\"\n\nThe first group, according to the spokesman, \"consisted of citizens of various European countries,\" while the second listed only mercenaries from the so-called Georgian Legion. According to Konashenkov, \"Georgian militants were involved in the brutal torture and murder of Russian servicemen near Kiev in March this year.\"\n\nSince the launch of the Russian military offensive in Ukraine at the end of February, Moscow and Kiev have been accusing each other of abuse and torture, as well as of atrocities against civilians. In May, the Russian Investigative Committee said it was looking into a video published on social media, showing a Georgian mercenary beating a captured Russian soldier.\n\nTatyana Moskalkova, Russia's top human rights official, voiced concerns this month over the treatment of Russian prisoners in Ukraine. The International Red Cross had not provided any information about visits to check on the conditions the Russian POWs have been kept in, she claimed.\n\nRussia attacked the neighboring state in late February, following Ukraine's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered Minsk Protocol was designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "sott.net", "dataType": "news", "title": "Signs Of The TImes"}, "authors": [], "image": "https://www.sott.net/image/s32/650232/full/7ad96bb4fcc7b15f91bc0f22e18321.jpg", "eventUri": "eng-7821909", "sentiment": -0.5372549019607843, "wgt": 159, "relevance": 1, "stanza_neg": 6, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7094834284", "lang": "eng", "isDuplicate": false, "date": "2022-07-01", "time": "02:58:00", "dateTime": "2022-07-01T02:58:00Z", "dateTimePub": "2022-06-28T11:41:00Z", "dataType": "news", "sim": 0.6235294342041016, "url": "https://www.rt.com/russia/557977-urkaine-friendly-fire-claims/", "title": "Foreign mercenaries shot allied Ukrainian troops - Moscow  --  RT Russia & Former Soviet Union", "body": "A lack of competence among Ukrainian forces, including foreigners recruited to fight for Kiev, has resulted in at least two known cases of friendly fire, the Russian military claimed on Tuesday.\n\nIn one reported mix-up, recruits arriving at the position of the 97th battalion of the 60th infantry brigade of the Ukrainian Armed Forces were shelled by the same people they were supposed to be joining.\n\nAnother incident occurred with soldiers of the 28th mechanized brigade, the Russian Defense Ministry claimed. A recon team of that unit was attacked by foreign mercenaries, who killed four troops and injured three others, the ministry said in a daily briefing.\n\nThe report did not offer further details about when and where the alleged accidents happened.\n\nAccounts of friendly fire incidents have also come from Western fighters. Last week, a Rolling Stone story about US war veterans killed or captured in Ukraine mentioned instances like these, among other issues that foreign combatants regularly experience there.\n\n\"We had a two-hour firefight that later turned out to be against Ukrainian special forces. It is unbelievable what goes on here,\" Tristan Nettles, a member of an English-speaking squad fighting in Ukraine, told the magazine.\n\n\"Bridges blown up while friendly forces are still on the other side, no communication between units, friendly fire all the time,\" he said regarding the situation on the battlefield.\n\nRussia attacked Ukraine in late February, following Kiev's failure to implement the terms of the Minsk agreements, first signed in 2014, and Moscow's eventual recognition of the Donbass republics of Donetsk and Lugansk. The German- and French-brokered protocols were designed to give the breakaway regions special status within the Ukrainian state.\n\nThe Kremlin has since demanded that Ukraine officially declare itself a neutral country that will never join the US-led NATO military bloc. Kiev insists the Russian offensive was completely unprovoked and has denied claims it was planning to retake the two republics by force.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bae67485f5403831722c4c.jpg", "eventUri": "eng-7821909", "sentiment": -0.192156862745098, "wgt": 159, "relevance": 1, "stanza_neg": 8, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096586559", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "17:32:00", "dateTime": "2022-06-29T17:32:00Z", "dateTimePub": "2022-06-29T17:30:00Z", "dataType": "news", "sim": 0.6039215922355652, "url": "https://www.rt.com/russia/558085-ukraine-intelligence-terrorism-probe/", "title": "Moscow launches probe over Kiev's terror threats  --  RT Russia & Former Soviet Union", "body": "The Russian Investigative Committee launched a criminal probe on Wednesday over remarks made by the head of Ukrainian military intelligence, Kirill Budanov, who threatened \"attacks and sabotage operations\" on Russia's territory.\n\nBudanov made the 'warning' in an interview with the Financial Times over the weekend, claiming that Moscow has been already facing \"partisan activities\" in the Ukrainian territories seized amid the ongoing conflict that began in late February. The attack and sabotage operations are not limited to the seized land and \"are held everywhere, and they were and will be held in Russia and many other places,\" he told the newspaper.\n\nBudanov now faces charges in Russia over \"threatening to stage a terror act.\" According to Russian law, such an offense incurs a heavy penalty and can land someone convicted behind bars for up to 15 years.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bc8bb185f54063a32e3f28.jpg", "eventUri": "eng-7821909", "sentiment": -0.2941176470588235, "wgt": 154, "relevance": 1, "stanza_neg": 4, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 10, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096811445", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "21:47:00", "dateTime": "2022-06-29T21:47:00Z", "dateTimePub": "2022-06-29T21:46:00Z", "dataType": "news", "sim": 0.5960784554481506, "url": "https://www.rt.com/russia/558106-russia-ukraine-largest-pow-exchange/", "title": "Russia and Ukraine hold largest POW exchange  --  RT Russia & Former Soviet Union", "body": "Russia and Ukraine held a new prisoner of war exchange on Wednesday. The swap has become the largest exchange since the beginning of the ongoing conflict, with each side surrendering 144 prisoners.\n\nUkraine's military intelligence service was the first to announce the exchange, releasing photos of the swap.\n\nThe batch included 43 fighters with the notorious Azov regiment, Ukraine's military intelligence noted. Hundreds of fighters of the neo-Nazi unit ended up in Russia's custody after surrendering at the Azovstal steel plant in the city of Mariupol.\n\nWhile Moscow has remained silent on the swap so far, the exchange was confirmed by the head of the Donetsk People's Republic, Denis Pushilin. \"Today, 144 fighters of the Donetsk People's Republic and the Russian Federation, captured by the enemy, we are returning home,\" Pushilin wrote in a social media post.\n\n\"We gave Kiev the same number of prisoners from the armed forces of Ukraine, most of whom were wounded. Several of them are privates of nationalist battalions, their condition is deplorable: the wounds are severe, with amputation of limbs and other complications,\" he added.\n\nBoth Russia and Ukraine claim to have captured scores of each others' soldiers since Moscow launched its military campaign in the neighboring country in late February. Early in June, Moscow said it was holding nearly 6,500 Ukrainian fighters in custody. Ukrainian officials previously reported that 11 rounds of exchanges had taken place, with dozens of prisoners swapped.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bcc72f203027200248ce75.jpeg", "eventUri": "eng-7821909", "sentiment": -0.2313725490196078, "wgt": 152, "relevance": 1, "stanza_neg": 5, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 17, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7096811446", "lang": "eng", "isDuplicate": false, "date": "2022-06-29", "time": "21:47:00", "dateTime": "2022-06-29T21:47:00Z", "dateTimePub": "2022-06-29T21:32:00Z", "dataType": "news", "sim": 0.5490196347236633, "url": "https://www.rt.com/russia/558101-donbass-shelling-girl-killed/", "title": "Mother recounts losing her 6-year-old daughter in Donbass shelling  --  RT Russia & Former Soviet Union", "body": "RT's video news agency Ruptly spoke to Nina Grebennikova, the mother of the six-year-old girl Alina who was killed last week in Donbass. The girl was fatally wounded when the Ukrainian military shelled the city of Makeevka, located just to the northeast of the city of Donetsk.\n\nOn the day of the deadly shelling, Nina with her husband and their three daughters, as well as her neighbor with her three children, went for a walk in a garden located near a local school.\n\n\"It's just, you know, they are shooting everywhere - we didn't know where to take a walk with the kids. And at that time there was an explosion,\" Nina says.\n\nThe six-year-old was riding her bicycle when \"everything started exploding above our heads\", the mother recalls. The family dropped to the ground to take cover from the shelling, but Alina was hit in the head by a piece of shrapnel.\n\nI jumped up and my baby was lying down. She, it turns out, was near the bike. And a pool of blood. And I grabbed her, started shouting for an ambulance to be called.\n\nThe girl was rushed to the hospital, but her wound turned out to be fatal. The piece of shrapnel penetrated deep into Alina's brain, and it was impossible to even attempt surgery to try and save her, the chief doctor of the Makeevka hospital, Anna Rudnichenko, told local media.\n\nThe Ukrainian military has repeatedly subjected residential areas of Donetsk and other settlements across Donbass to heavy artillery and rocket shelling amid the ongoing conflict with Russia. Moscow has accused Kiev of deliberately targeting residential areas located nowhere near military targets, blasting such actions as \"barbaric.\"\n\n\"We're seeing absolutely barbaric shelling of civilian facilities. They're barbaric. In recent days, we've witnessed these shellings intensify,\" Kremlin spokesman Dmitry Peskov said earlier this month.\n\nRussia sent troops into Ukraine on February 24, citing Kiev's failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Petro Poroshenko has since admitted that Kiev's main goal was to use the ceasefire to buy time and \"create powerful armed forces.\"\n\nIn February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.", "source": {"uri": "rt.com", "dataType": "news", "title": "RT"}, "authors": [], "image": "https://cdni.russiatoday.com/files/2022.06/article/62bcc2cb85f540645e059e47.jpg", "eventUri": "eng-7821909", "sentiment": -0.1529411764705882, "wgt": 140, "relevance": 1, "stanza_neg": 11, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 23, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7094270460", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "03:50:00", "dateTime": "2022-06-28T03:50:00Z", "dateTimePub": "2022-06-28T03:39:00Z", "dataType": "news", "sim": 0.4862745106220245, "url": "https://tass.com/world/1472327", "title": "Russia's 'default' and Kiev's rejection of talks: events around Ukraine", "body": "The Russian Aerospace Forces delivered strikes by four precision missiles to obliterate workshops of the Artyom rocket-building corporation in Kiev, according to Russia's Defense Ministry\n\nMOSCOW, June 28. /TASS/. Moody's stated on Monday that Russia defaulted on Eurobonds while it also became known that Ukraine rejected negotiations with Russia until Kiev is able to hold them from \"strong positions.\"\n\nTASS gathered information on main events in Ukraine and around it for the day.\n\nThe Russian Aerospace Forces delivered strikes by four precision missiles to obliterate workshops of the Artyom rocket-building corporation in Kiev, according to Russia's Defense Ministry. The agency reported that all the missiles reached their targets while two air defense missiles intercepting them were shot down by Ukraine's air defense and one of them \"presumably, <...> fell on a residential building.\"\n\nAdditionally, the ministry reported that Russian units eliminated 14 foreign mercenaries near Lisichansk some of whom \"were involved in the brutal torture and murder of Russian servicemen near Kiev in March this year.\"\n\nLisichansk is the last large city in the LPR still controlled by Ukraine and it may be completely liberated by the end of the week, Vitaly Kiselev, an aide to the LPR interior minister, told TASS.\n\nThe office of the DPR's Prosecutor General reported that bodies of 172 Ukrainian soldiers had been found on the territory of the Azovstal plant in Mariupol. The agency also published names of 52 people found in a mass burial in one of city's parks.\n\nMoody's said that Russia had defaulted on its foreign debt obligations since holders of Russia's sovereign debt had not received coupon payments on two Eurobonds by the time the 30-calendar-day grace period expired. Earlier, Bloomberg noted that this was Russia's first default on its foreign debt since 1918.\n\nMeanwhile, this concerns May payments which Russia had made ahead of time, before the US license lapsed which had allowed Russia to service its foreign debt. Russia's Finance Ministry noted that in this case the payments were not received due to actions by third parties.\n\nIn June, Russia for the first time used a new mechanism to pay its Eurobond coupon in rubles since Western sanctions prevent it from servicing the foreign debt by other means. Moody's stated that it would view such payments as a default. Russian authorities repeatedly stressed their readiness to fulfill their debt obligations and the availability of funds to do so.\n\nUkraine won't negotiate with Russia until it finds itself in \"strong positions,\" Ukrainian President Vladimir Zelensky told G7 leaders via a video link on Monday. He also said that he wouldn't want for combat to drag out until winter and urged to introduce new sanctions against Moscow and supply more arms to Kiev.\n\nIn particular, he proposed to G7 to join work on developing security guarantees for Ukraine and participate in its restoration following the end of military actions as well as urged to radically restrict prices for Russian oil at global markets and create an effective mechanism to confiscate Russian frozen or arrested assets.\n\nOn the same day, the Ukrainian leader asserted that he was ready to respond to a hypothetical threat on the part of Transnistria at a joint press conference with his Moldovan counterpart Maia Sandu who was in Kiev on an unannounced visit.\n\nThe North Atlantic Treaty Organization plans to beef up its battlegroups on the alliance's eastern flank and boost its high readiness forces to over 300,000 from the current 40,000, NATO Secretary General Jens Stoltenberg said on Monday in the run-up to the alliance's summit in Madrid. According to him, Brussels is also planning to bolster its battlegroups on eastern borders.\n\nThe US announced new sanctions against Russia which will involve, among others, defense companies and research organizations, as well as \"dozens of other defense-related entities and individuals.\" Additionally, Washington plans to impose visa restrictions on about 500 Russian officials, introduce higher tariffs on more than 570 groups of goods from Russia as well as approve restrictions that will affect officials on Ukraine's liberated territories.\n\nAccording to US National Security Advisor Jake Sullivan, Washington will supply modern medium-and long-range air defense systems to Ukraine which Zelensky asked for earlier.\n\nG7 member states are ready to expand their cooperation with Ukraine on intelligence, maritime security and information sharing, the group said in its statement published Monday.\n\nAdditionally, the Group of Seven stated that it will earmark about $29.5 bln in budget support for Kiev. Meanwhile, Ukrainian Finance Minister Sergey Marchenko noted that the country spends $5 bln monthly on the conflict with Russia and the Western support is insufficient to cover all the expenses.\n\nThe G7 countries also vowed to seek new ways to isolate Russia from global markets and decrease its income. Kyodo reported, citing a US official, that the group is close to a decision to call for restrictions on prices for Russian oil but it has not yet been officially announced.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "eventUri": "eng-7821909", "sentiment": -0.2, "wgt": 124, "relevance": 1, "stanza_neg": 10, "stanza_neu": 21, "stanza_pos": 1, "swn_neg": 32, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7094314896", "lang": "eng", "isDuplicate": false, "date": "2022-06-28", "time": "04:52:00", "dateTime": "2022-06-28T04:52:00Z", "dateTimePub": "2022-06-28T04:18:00Z", "dataType": "news", "sim": 0.4588235318660736, "url": "https://tass.com/politics/1472329", "title": "Continued arms supplies from US to Ukraine increase threat of further escalation  --  envoy", "body": "WASHINGTON, June 28. /TASS/. Continued weapons deliveries from Washington to Kiev only tighten the conflict spiral and heighten the threat of the further aggravation with unpredictable consequences, Russian Ambassador to the US Anatoly Antonov said on Monday.\n\n\"The reckless and unanswered flooding of Ukraine with arms only tightens the conflict spiral and increases the threat of the further escalation with unpredictable consequences,\" the Russian Embassy's Telegram channel quoted him as saying. \"However, Washington's ruling circles, blinded by the idea to weaken Russia, are still not capable to rationally assess the whole danger of their moves,\" the envoy added.\n\n\"The administration increases the supplies of weapons to Kiev. If previously they were delivering MPADS and ATGMs, now it's on to heavy artillery, MLRS and, by all appearances, air defense systems,\" he noted.\n\nThe diplomat emphasized that additionally, the US shares intelligence data with the Ukrainian side and consults as to \"how to act on the battlefield.\" \"Essentially, with its provocative moves the US is pushing the Kiev regime to commit mass murders of civilians. Additionally, here they are condoning the continued deployment of US mercenaries to Ukraine,\" he added. \"Such a policy creates additional risks in relations between the largest nuclear powers,\" the ambassador emphasized.\n\nOn February 24, Russian President Vladimir Putin said in a televised address that in response to a request by the heads of the Donbass republics he had made a decision to carry out a special military operation in order to protect people \"who have been suffering from abuse and genocide by the Kiev regime for eight years.\" Following this, the US and its allies announced the introduction of sweeping sanctions against Russia and stepped up arms deliveries to Kiev.", "source": {"uri": "tass.com", "dataType": "news", "title": "TASS"}, "authors": [], "image": "https://phototass2.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20220628/1358379.jpg", "eventUri": "eng-7821909", "sentiment": -0.2549019607843137, "wgt": 117, "relevance": 1, "stanza_neg": 4, "stanza_neu": 9, "stanza_pos": 0, "swn_neg": 13, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7097793852", "lang": "eng", "isDuplicate": false, "date": "2022-06-30", "time": "14:42:00", "dateTime": "2022-06-30T14:42:00Z", "dateTimePub": "2022-06-30T13:00:00Z", "dataType": "news", "sim": 0.4588235318660736, "url": "https://apokalypsnu.nl/2022/06/30/ukraine-war-120-days/", "title": "Ukraine War: 120 Days", "body": "A no-nonsense analysis of the ongoing Ukraine war and its global impact.\n\nMilitary Situation\n\nThe initial Russian offensive (\"phase 1\") consisted in a direct advance from Belarus to the northern gates of Kiev and the simultaneous opening of multiple fronts in the north-east, east, and south of Ukraine. There have been various theories as to what the initial Russian strategy was (e.g. conquering Kiev or 'binding Ukrainian forces'), but most likely, Russia tried to force a collapse or capitulation of the Ukrainian government, in which case Russia would have won the war without really fighting it.\n\nIndeed, just one day after the beginning of the invasion, Russian President Putin proposed a kind of \"military coup\" in Ukraine to make it easier to \"reach an agreement\". There were also several rounds of negotiations between Moscow and Kiev in Belarus and Turkey.\n\nYet this initial, political-military plan failed and was halted in late March, about one month after the beginning of the invasion.\n\nNevertheless, already by early March Russia had conquered extensive territories in southern Ukraine connecting the Donbas and Crimea and had been able to restore water supply to the Crimean Peninsula (which had been cut off by Ukraine since 2014;", "source": {"uri": "apokalypsnu.nl", "dataType": "news", "title": "Apokalyps Nu!"}, "authors": [{"uri": "swiss_policy_research@apokalypsnu.nl", "name": "Swiss Policy Research", "type": "author", "isAgency": false}], "image": "https://i0.wp.com/apokalypsnu.nl/wp-content/uploads/2022/06/275367-ukraine-war-120-days.jpg?fit=1199%2C848&ssl=1", "eventUri": "eng-7821909", "sentiment": -0.1843137254901961, "wgt": 117, "relevance": 1, "stanza_neg": 2, "stanza_neu": 6, "stanza_pos": 0, "swn_neg": 8, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7092425364", "lang": "eng", "isDuplicate": false, "date": "2022-06-26", "time": "13:26:00", "dateTime": "2022-06-26T13:26:00Z", "dateTimePub": "2022-06-26T13:05:00Z", "dataType": "news", "sim": 0.4392156898975372, "url": "https://www.ansa.it/nuova_europa/en/news/sections/politics/2022/06/26/ukraine-missile-attack-on-kiev.-residential-buildings-hit_b30cf9c0-fcd2-4d78-ba1c-a114c1b0aa99.html", "title": "Ukraine, missile attack on Kiev. Residential buildings hit - Politics - Nuova Europa", "body": "(ANSA) - TRIESTE, 26 GIU - One civilian was killed in the rocket attack launched by Russian forces against the Ukrainian capital Kiev this morning, the Prosecutor General's Office announced on Telegram, Ukrinform reports.\n\nSo far, four civilians-including a seven-year-old girl-have also been pulled from the rubble and taken to hospitals.\n\nAt least 14 missiles were fired at dawn on the capital, according to Ukrainian MP Oleksiy Gancharenko.\n\nU.S. President Joe Biden, in Germany for the G7, called this morning's Russian shelling of Kiev an act of 'barbarism'.\n\nThe attack took place at 6:30 a.m. local time. The Kiev Independent speaks of three deflagrations while according to reports on social media the explosions were more numerous, at least four, and were caused by Russian cruise missiles. The airstrike alert resounded several times during the night in the Ukrainian capital. \"Several explosions occurred in the Shevchenkivskyi district. Rescuers and ambulances were on the scene,\" Kiev Mayor Vitali Klitschko wrote on telegram.\n\n\"As a result of enemy shelling, a fire broke out in a 9-story residential building with partial destruction of the 7th, 8th and 9th floors,\" a statement read. A fire occurred over a total area of 300 sq. m. Measures are underway to extinguish the fire and rescue people.\" \"The G7 summit must respond with more sanctions against Russia and more heavy weapons for Ukraine,\" Ukrainian Foreign Minister Dmytro Kouleba writes this on Twitter, calling for \"defeating sick imperialism\" after Russian missiles were fired on Kiev this morning.\n\nMeanwhile, the death toll of children injured in Ukraine since the start of the Russian invasion has risen to 613, the country's Prosecutor General's Office reported Urkinform. The number of children killed remained unchanged from yesterday at 339. (ANSA).", "source": {"uri": "ansa.it", "dataType": "news", "title": "ANSA.it"}, "authors": [], "image": "https://www.ansa.it/webimages/foto_large/2022/6/26/f13e3fa97e27ecedaeac89f04db757f6.jpg", "eventUri": "eng-7821909", "sentiment": -0.2470588235294118, "wgt": 112, "relevance": 1, "stanza_neg": 5, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}]