[{"uri": "7114688852", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "15:45:00", "dateTime": "2022-07-14T15:45:00Z", "dateTimePub": "2022-07-14T15:29:00Z", "dataType": "news", "sim": 0.8392156958580017, "url": "https://www.ukrinform.net/rubric-ato/3529112-death-toll-in-russias-missile-attack-on-vinnytsia-rises-to-22.html", "title": "Death toll in Russia's missile attack on Vinnytsia rises to 22", "body": "A total of 22 civilians have been reported killed in Russia's missile attack on the city of Vinnytsia.\n\nThe relevant statement was made by Chief of the National Police of Ukraine Ihor Klymenko on Facebook, an Ukrinform correspondent reports.\n\n\"As of 05:00 p.m., a total of 22 bodies of victims were found. Only six of them have been indentified so far,\" Klymenko wrote.\n\nIn his words, 39 persons were listed as missing after Russia's missile attack. Two of those who went missing have been found among the injured. One more missing person was among those killed.\n\n\"About 100 people received injuries of various degrees of severity. The missile strikes also caused damage to over 50 buildings of different purpose and over 40 cars,\" Klymenko noted.\n\nAccording to Klymenko, the police cordoned off and secured the impact area, so that law enforcement officers could thoroughly collect the evidence of Russia's war crimes and protect the intact premises against looters.\n\nA reminder that, on July 14, 2022, the Russian military fired Kalibr cruise missiles from a submarine in the Black Sea at downtown Vinnytsia. Two missiles were shot down by the Air Force of the Armed Forces of Ukraine.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1657805830-869.jpg", "eventUri": "eng-7862224", "sentiment": -0.3568627450980392, "wgt": 214, "relevance": 1, "stanza_neg": 5, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7114726315", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "16:17:00", "dateTime": "2022-07-14T16:17:00Z", "dateTimePub": "2022-07-14T14:49:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://en.interfax.com.ua/news/general/846004.html", "title": "Death toll from Russian missile attack on Vinnytsia rises to 22 - police", "body": "The number of victims of a Russian missile attack on Vinnytsia on Thursday has increased to 22 people, the bodies of six people have been identified, Chief of the National Police Ihor Klymenko has said.\n\n\"The missile attack on Vinnytsia: as of 5 p.m., the bodies of 22 victims have been found. Only six of them have been identified,\" he said on Facebook.\n\nDNA testing might be needed to identify the victims of the attack, he said. Therefore, the authorities ask the direct relatives (biological parents and children) of those who have gone missing to get in touch and provide their biological samples.\n\nKlymenko recalled the hotline phone numbers: (050) 222 0326 or 59-42-00.\n\nHe also said that the police have found two people who were missing among those injured and one more missing person was found among the victims.\n\n\"There are still 39 people on the list of those missing as a result of the missile attack on Vinnytsia,\" Klymenko said.\n\nHe also noted that around 100 people suffered injuries of various degrees of severity.\n\nIn addition, more than 50 various buildings and more than 40 cars were damaged in the missile attack, he said.\n\nThe district has been encircled by the police in order to collect all necessary evidence of Russia's another war crime as well as prevent possible looting.", "source": {"uri": "en.interfax.com.ua", "dataType": "news", "title": "Interfax-Ukraine"}, "authors": [], "image": "https://interfax.com.ua/media/thumbs/images/2022/07/UjW9kK_aZmna.jpg", "eventUri": "eng-7862224", "sentiment": -0.4745098039215686, "wgt": 211, "relevance": 1, "stanza_neg": 4, "stanza_neu": 7, "stanza_pos": 0, "swn_neg": 11, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115180093", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "01:53:00", "dateTime": "2022-07-15T01:53:00Z", "dateTimePub": "2022-07-15T01:52:00Z", "dataType": "news", "sim": 0.8274509906768799, "url": "https://nation.com.pk/2022/07/15/russian-cruise-missiles-kill-at-least-22-people-in-vinnytsia-ukraine-says/", "title": "Russian cruise missiles kill at least 22 people in Vinnytsia, Ukraine says", "body": "VINNYSTIA - At least 22 people have died in an attack on the central Ukrainian town of Vinnystia, according to Chief of Ukraine's National Police Ihor Klymenko.\n\nThe number of dead includes three children, and dozens of people are still unaccounted for, according to Ukraine's State Emergency Service.\n\nA further 52 people, including four children, have been hospitalized, 34 of whom are in a serious condition, SES said. Klymenko said only six of the bodies had so far been identified, and DNA tests may be required to identify others. Thirty-nine people were still listed as missing, he said.\n\nMore than 50 buildings and more than 40 cars were damaged by the strikes, Klymenko added. The attack was carried out with Russian Kalibr cruise missiles that were launched from submarines stationed in the Black Sea, according to Kyrylo Tymoshenko, the deputy head of the Office of the President of Ukraine.\n\n\"The enemy continues to keep ready 32 cruise missiles of the 'Kalibr' type on three surface and two submarine ships, and two big landing ships are also present\" in the Black Sea, the Operational Command South of the Ukrainian Armed Forces had said on Monday. Dmytro Kuleba, Ukraine's foreign minister, described the missile attack as \"terrorism.\"\n\n\"Already 20 civilians have been confirmed dead following a Russian missile strike on Vinnytsia. Three children, including a toddler, in the photo. This is terrorism,\" Kuleba tweeted. \"Deliberate murder of civilians to spread fear. Russia is a terrorist state and must be legally recognized as such,\" he added.", "source": {"uri": "nation.com.pk", "dataType": "news", "title": "The Nation"}, "authors": [], "image": "https://nation.com.pk/storage/2022/07/Ukraine14-A.jpg", "eventUri": "eng-7862224", "sentiment": -0.4352941176470588, "wgt": 211, "relevance": 1, "stanza_neg": 4, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115885816", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "13:58:00", "dateTime": "2022-07-15T13:58:00Z", "dateTimePub": "2022-07-15T13:50:00Z", "dataType": "news", "sim": 0.8156862854957581, "url": "https://egyptindependent.com/in-vinnytsia-relatives-of-the-missing-submit-dna-samples-to-help-identify-the-dead/", "title": "In Vinnytsia, relatives of the missing submit DNA samples to help identify the dead - Egypt Independent", "body": "The relatives of people missing after Thursday's missile strikes on the central Ukrainian town of Vinnytsia have submitted DNA samples to help officials identify the dead, according to a Ukrainian police chief.\n\n\"Fourteen relatives of missing persons have submitted their biological samples,\" Ihor Klymenko, chief of Ukraine's National Police, said in a statement on Facebook.\n\n\"Our specialists have already conducted more than 200 comparisons of selected DNA profiles. Twelve of the 19 identified persons were recognized with the help of this rapid DNA identification technology,\" Klymenko added.\n\nEight people are still missing, Klymenko's statement said.\n\nKlymenko also gave details of the three children who died in the attacks -- a 4-year-old girl, whose mother is in hospital, and two boys, aged 7 and 8.\n\n\"One of the boys was being examined at the medical center at the time of the attack. He died together with his mother. Another was waiting for his uncle in a parked car and got into a fire trap. A relative of this boy was thrown away by the blast wave, now he is hospitalized,\" Klymenko said.\n\nSome background: The Russian Ministry of Defense said Friday that the missile attack in Vinnytsia in central Ukraine targeted a military facility at a time when a meeting of the Ukrainian Air Force command was taking place.\n\nAt least 23 people were killed in the attack according to Ukraine's State Emergency Service, including three children. On Thursday, the Vinnytsia head of police, Igor Klymenko, said that \"three Russian missiles were aimed at a building with office premises.\"\n\nUkrainian Foreign Minister Dmytro Kuleba described the missile attack as \"terrorism\" and a \"deliberate murder of civilians to spread fear.\"\n\nIn the wake of the attack, Ukrainian President Volodymyr Zelensky called on the international community to officially recognize Russia as a terrorist state, saying \"Russia has shown its attitude to international law, to Europe, and to the entire civilized world.\"", "source": {"uri": "egyptindependent.com", "dataType": "news", "title": "Egypt Independent"}, "authors": [], "image": "https://amayei.nyc3.digitaloceanspaces.com/2022/07/inbound360372537412040717.jpg", "eventUri": "eng-7862224", "sentiment": -0.3333333333333334, "wgt": 208, "relevance": 1, "stanza_neg": 3, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7115715821", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "11:32:00", "dateTime": "2022-07-15T11:32:00Z", "dateTimePub": "2022-07-15T10:09:00Z", "dataType": "news", "sim": 0.7686274647712708, "url": "https://en.interfax.com.ua/news/general/846171.html", "title": "Police identify 19 out of 23 killed in missile attacks on Vinnytsia, eight more people considered missing - National Police chief", "body": "Law enforcers have identified 19 of the 23 killed as a result of hostile missile attacks on Vinnytsia on July 14, Chief of the National Police of Ukraine Ihor Klymenko has said.\n\n\"Police have identified 19 out of 23 killed in missile attacks on Vinnytsia. Three children are among Russia's victims: a four-year-old girl and two boys, aged seven and eight,\" Klymenko said on his Facebook page on Friday.\n\nThe National Police chief said that one of the boys was being examined at the medical center at the time of the attack. \"He died together with his mother,\" Klymenko said.\n\nAccording to him, another boy was waiting for his uncle in a parked car and got into a fire trap.\n\n\"A relative of this boy was thrown away by an explosive wave, now he is hospitalized,\" the chief of the National Police said.\n\nHe also said the mother of the killed four-year-old girl is also in a severe condition in hospital.\n\n\"Some 14 relatives of the missing have handed in their biological samples. Our specialists have already made more than 200 comparisons of the isolated DNA profiles. Some 12 out of 19 identified individuals were identified precisely with the help of high-speed DNA installation technology,\" Klymenko said.\n\nThe chief of the National Police said that 183 victims applied for medical assistance after the missile attacks, 82 of them were hospitalized. \"There are four children among the wounded. Eight people are still considered missing,\" Klymenko said.", "source": {"uri": "en.interfax.com.ua", "dataType": "news", "title": "Interfax-Ukraine"}, "authors": [], "image": "https://interfax.com.ua/media/thumbs/images/2022/07/uKDkAwI98p5F.jpg", "eventUri": "eng-7862224", "sentiment": -0.5058823529411764, "wgt": 196, "relevance": 1, "stanza_neg": 6, "stanza_neu": 7, "stanza_pos": 1, "swn_neg": 14, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7114698425", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "15:52:00", "dateTime": "2022-07-14T15:52:00Z", "dateTimePub": "2022-07-14T15:52:00Z", "dataType": "news", "sim": 0.7529411911964417, "url": "https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-07-14-22/h_445618bc0e6522b882e3f5dcffe06054", "title": "Russian cruise missiles from Black Sea killed at least 22 people in attack on Vinnytsia, Ukraine says", "body": "Russian cruise missiles from Black Sea killed at least 22 people in attack on Vinnytsia, Ukraine says\n\nAt least 22 people have died in an attack on the central Ukrainian town of Vinnystia, according to Chief of Ukraine's National Police Ihor Klymenko.\n\nThe number of dead includes three children, and dozens of people are still unaccounted for, according to Ukraine's State Emergency Service.\n\nA further 52 people, including four children, have been hospitalized -- 34 of whom are in a serious condition, SES said.\n\nKlymenko said only six of the bodies had so far been identified, and DNA tests may be required to identify others.\n\nThirty-nine people were still listed as missing, he said.\n\nMore than 50 buildings and more than 40 cars were damaged by the strikes, Klymenko added.\n\nThe attack was carried out with Russian Kalibr cruise missiles that were launched from submarines stationed in the Black Sea, according to Kyrylo Tymoshenko, the deputy head of the Office of the President of Ukraine.\n\n\"The enemy continues to keep ready 32 cruise missiles of the 'Kalibr' type on three surface and two submarine ships, and two big landing ships are also present\" in the Black Sea, the Operational Command South of the Ukrainian Armed Forces had said on Monday.\n\nDmytro Kuleba, Ukraine's foreign minister, described the missile attack as \"terrorism.\"\n\n\"Already 20 civilians have been confirmed dead following a Russian missile strike on Vinnytsia. Three children, including a toddler, in the photo. This is terrorism,\" Kuleba tweeted.\n\n\"Deliberate murder of civilians to spread fear. Russia is a terrorist state and must be legally recognized as such,\" he added.", "source": {"uri": "edition.cnn.com", "dataType": "news", "title": "CNN International"}, "authors": [], "image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1a7290c8-8f5f-4e0d-8b70-8546aebe7a29.JPG", "eventUri": "eng-7862224", "sentiment": -0.4509803921568627, "wgt": 192, "relevance": 1, "stanza_neg": 5, "stanza_neu": 10, "stanza_pos": 0, "swn_neg": 15, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7114748754", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "16:38:00", "dateTime": "2022-07-14T16:38:00Z", "dateTimePub": "2022-07-14T16:37:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://news.az/news/russian-cruise-missiles-from-black-sea-killed-at-least-22-people-in-attack-on-vinnytsia-ukraine-says", "title": " Russian cruise missiles from Black Sea killed at least 22 people in attack on Vinnytsia, Ukraine says ", "body": "At least 22 people have died in an attack on the central Ukrainian town of Vinnystia, according to Chief of Ukraine's National Police Ihor Klymenko, News.az reports citing UNIAN\n\nThe number of dead includes three children, and dozens of people are still unaccounted for, according to Ukraine's State Emergency Service.\n\nA further 52 people, including four children, have been hospitalized -- 34 of whom are in a serious condition, SES said.\n\nKlymenko said only six of the bodies had so far been identified, and DNA tests may be required to identify others.\n\nThirty-nine people were still listed as missing, he said.\n\nMore than 50 buildings and more than 40 cars were damaged by the strikes, Klymenko added.", "source": {"uri": "news.az", "dataType": "news", "title": "News.az"}, "authors": [{"uri": "sadiq_məmmədov@news.az", "name": "Sadiq Məmmədov", "type": "author", "isAgency": false}], "image": " https://news.az/uploads/2022/07/14/news/175236/medium/175236-0211397.jpg  ", "eventUri": "eng-7862224", "sentiment": -0.388235294117647, "wgt": 184, "relevance": 1, "stanza_neg": 6, "stanza_neu": 0, "stanza_pos": 0, "swn_neg": 6, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115705143", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "11:24:00", "dateTime": "2022-07-15T11:24:00Z", "dateTimePub": "2022-07-15T11:17:00Z", "dataType": "news", "sim": 0.7137255072593689, "url": "https://www.ukrinform.net/rubric-ato/3529671-police-identified-19-of-23-killed-by-russian-missile-strikes-on-vinnytsia.html", "title": "Police identified 19 of 23 killed by Russian missile strikes on Vinnytsia", "body": "The head of the National Police of Ukraine, Ihor Klymenko, said in a Facebook post, Ukrinform reports.\n\n\"The police have identified 19 of 23 people killed by rocket attacks on Vinnytsia. Among the victims of Russia are three children: a 4-year-old girl and two boys, 7 and 8,\" said Klymenko.\n\nAccording to him, one of the boys was being examined at the medical center at the time of the attack. He died together with his mother.\n\nAnother boy was waiting for his uncle in a parked car and got into a fire trap. Relatives of the boy were thrown away by the blast wave. They boy was hospitalized.\n\nThe head of the National Police noted that the mother of the killed 4-year-old girl is also in a serious condition in the hospital.\n\n\"14 relatives of the missing persons have submitted their biological samples. Our experts have already conducted more than 200 comparisons of the isolated DNA profiles. 12 of the 19 identified persons were identified with the help of the technology of rapid DNA analysis,\" Klymenko said.\n\nHe also noted that 183 victims applied for medical aid, 82 of them were hospitalized. Among those injured are four children. Eight people are still considered missing.\n\nAs Ukrinform reported, on July 14, Russia struck Vinnytsia with Kalibr missiles, launched from a submarine deployed in the Black Sea.", "source": {"uri": "ukrinform.net", "dataType": "news", "title": "Ukrinform-EN"}, "authors": [], "image": "https://static.ukrinform.com/photos/2022_07/thumb_files/630_360_1657802853-462.jpg", "eventUri": "eng-7862224", "sentiment": -0.3725490196078431, "wgt": 182, "relevance": 1, "stanza_neg": 5, "stanza_neu": 11, "stanza_pos": 0, "swn_neg": 16, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 1, "title_swn_sent": 0}, {"uri": "7115701717", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "11:20:00", "dateTime": "2022-07-15T11:20:00Z", "dateTimePub": "2022-07-15T11:20:00Z", "dataType": "news", "sim": 0.7019608020782471, "url": "https://en.hromadske.ua/posts/police-identified-19-of-the-23-people-who-died-due-to-russian-attacks-on-vinnytsia-8-people-are-considered-missing", "title": "Police identified 19 of the 23 people who died due to Russian attacks on Vinnytsia. 8 people are considered missing", "body": "Consequences of the Russian missile attack on Vinnytsia, July 14 2022 State Emergency Service of Ukraine\n\nThe National Police identified 19 of the 23 people who died due to the Russian missile strikes on Vinnytsia on July 14. 8 people are still considered missing, reported the Head of the National Police, Ihor Klymenko, around noon on July 15.\n\n14 relatives of the people who disappeared after the rocket attack submitted their biological samples. Specialists have already conducted more than 200 comparisons of selected DNA profiles. 12 of the 19 identified persons were identified using the technology of rapid DNA identification.\n\nKlymenko said that a total of 183 victims sought medical help, 82 of them were hospitalized. Among the injured are 4 children.\n\n\"Among the victims of Russian attack are 3 children: a 4-year-old girl and two boys, 7 and 8 years old. One of the boys was being examined at the medical center at the time of the attack. He died together with his mother. Another was waiting for his uncle in a parked car and fell into a fire trap, now he is hospitalized. Relatives of this boy were thrown away by the blast wave. The mother of the dead 4-year-old girl is also in serious condition in the hospital,\" the Head of National Police said.\n\nMissile attacks on Vinnytsia\n\nRussia attacked the crowded center of Vinnytsia around 10:45 a.m. local time on July 14 with Kalibr cruise missiles from a submarine in the Black Sea. The attack also damaged Yuvileynyy Centre, House of Officers, the medical diagnostic center, about 55 houses and 40 cars.\n\nPresident Volodymyr Zelensky called the missile attacks on Vinnytsia an open act of terrorism. July 15 has been declared a day of mourning for those killed in the attack on Vinnytsia. More than 20 people were detained in the city and are being investigated for their involvement in adjusting the shelling.", "source": {"uri": "en.hromadske.ua", "dataType": "news", "title": "en.hromadske.ua"}, "authors": [], "image": "https://s3-eu-central-1.amazonaws.com/hromadske-en/posts/image_tizers/000/003/974/sharer/cad0f046baf870078.jpeg?1657883012", "eventUri": "eng-7862224", "sentiment": -0.3803921568627451, "wgt": 179, "relevance": 1, "stanza_neg": 9, "stanza_neu": 12, "stanza_pos": 0, "swn_neg": 21, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7114809070", "lang": "eng", "isDuplicate": false, "date": "2022-07-14", "time": "17:32:00", "dateTime": "2022-07-14T17:32:00Z", "dateTimePub": "2022-07-14T17:32:00Z", "dataType": "news", "sim": 0.6941176652908325, "url": "https://www.pravda.com.ua/eng/news/2022/07/14/7358131/", "title": "Russian missile strike on Vinnytsia: bodies of 22 dead found, only 6 were identified ", "body": "As a result of Russian missile strikes on Vinnytsia on Thursday, as of 5 p.m., the bodies of 22 dead were found, only 6 of them were identified, and 39 people are considered missing.\n\nSource: the head of the National Police Igor Klymenko on Facebook\n\nQuote: \"Missile strikes on Vinnytsia: as of 5 p.m., the bodies of 22 victims were found. Only 6 of them have so far been identified.\n\nTo establish the identity of the victims, DNA examinations may be required, so investigators ask direct relatives (native parents and children) of the missing to get in touch and hand over biological samples. I remind you of the hotline numbers: 050-222-03-26 or 59-42-00\n\nThe police found two missing persons among the wounded. Unfortunately, one missing person was found among the dead. In total, 39 people remain on the list of missing persons as a result of missile strikes on Vinnytsia.\"\n\nDetails: According to the National Police, about a hundred people received injuries with various degrees of severity.\n\nThe strikes damaged more than 50 buildings for various purposes and more than 40 cars.\n\nIt is reported that the police resricted and took this area under protection so that law enforcement officers could carefully collect the necessary evidence of Russian Federation's war crimes and protect the intact premises from possible looters.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/9/0/90ccfdd-293659690-484645306997113-559248390916355105-n.jpg", "eventUri": "eng-7862224", "sentiment": -0.388235294117647, "wgt": 177, "relevance": 1, "stanza_neg": 4, "stanza_neu": 8, "stanza_pos": 0, "swn_neg": 12, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}, {"uri": "7115831899", "lang": "eng", "isDuplicate": false, "date": "2022-07-15", "time": "13:15:00", "dateTime": "2022-07-15T13:15:00Z", "dateTimePub": "2022-07-15T13:11:00Z", "dataType": "news", "sim": 0.6627451181411743, "url": "https://www.pravda.com.ua/eng/news/2022/07/15/7358273/", "title": "Four people killed in Vinnytsia remain unidentified; the fate of 8 people is unknown", "body": "The police have identified 19 of the 23 people who were killed as a result of rocket attacks on the centre of Vinnytsia on 14 July. The number of missing people has fallen from 18 to 8.\n\nSource: Ihor Klymenko, chief of the National Police\n\nQuote from Klymenko: \"The police have identified 19 of the 23 people who were killed as a result of rocket attacks on Vinnytsia. Three children are among the Russians' victims: a 4-year-old girl and two boys aged 7 and 8.\n\nOne of the boys was being examined at the medical centre at the time of the attack. He died together with his mother.\n\nAnother boy was waiting for his uncle in a parked car and was caught in a fire trap. His relatives were thrown aside by the blast. He is now in hospital.\n\nThe mother of the 4-year-old girl who died is also in a serious condition in hospital.\"\n\nWe have launched English Twitter! Follow us!\n\nDetails: 14 relatives of missing people have provided biological samples. Specialists have already conducted more than 200 comparisons of selected DNA profiles.\n\n12 of the 19 identified people were identified with the help of rapid DNA identification technology.\n\n183 injured people sought medical help and 82 of them were hospitalised. Four children are among the injured.\n\nKlymenko reported at 13:00 that 8 people are still considered missing.\n\nIn the morning, 18 people were considered missing, and 13 people were unidentified: two children (boys) and 11 adults.\n\nThe State Emergency Service reports that as of 12:00, 197 people attended medical facilities. Of these, 117 people were referred for outpatient treatment and 80 people were hospitalised with injuries of varying degrees of severity (including 3 children). 23 people died (including 3 children; 1 person died in hospital).\n\nOn 15 July, mourning was announced in Vinnytsia.\n\nPreviously: According to a new law, during the period of martial law in Ukraine, military personnel and law enforcement officers must submit DNA samples (free of charge); other citizens can do this voluntarily (for a fee).\n\nBackground: On the morning of 14 July, the Russians hit the centre of Vinnytsia with rockets. As of that evening, the death toll stood at 23. 64 people are in hospital, 5 in critical condition.\n\nA 4-year-old girl, Liza, is among those who were killed. Her mother was taken to intensive care. Little Liza had Down's syndrome; she featured in a video with First Lady Olena Zelenska just before the Christmas holidays in 2021.", "source": {"uri": "pravda.com.ua", "dataType": "news", "title": "��������� ������"}, "authors": [], "image": "https://img.pravda.com/images/doc/8/7/87b5622-vinnytsya-rujnuvannya--dsns-.jpg", "eventUri": "eng-7862224", "sentiment": -0.4666666666666667, "wgt": 169, "relevance": 1, "stanza_neg": 10, "stanza_neu": 23, "stanza_pos": 0, "swn_neg": 33, "swn_neu": 0, "swn_pos": 0, "title_stanza_sent": 0, "title_swn_sent": 0}]